{
  "verses": [
    {
      "verseNumber": 1,
      "verseString": "بَرَاءَةٌ مِنَ اللَّهِ وَرَسُولِهِ إِلَى الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ",
      "verseStringB": "A declaration of immunity from Allah and His Messenger to the associators with whom you had made a treaty."
    },
    {
      "verseNumber": 2,
      "verseString": "فَسِيحُوا فِي الْأَرْضِ أَرْبَعَةَ أَشْهُرٍ وَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ ۙ وَأَنَّ اللَّهَ مُخْزِي الْكَافِرِينَ",
      "verseStringB": "So travel the land for four months, and know that you cannot escape Allah, and that Allah will disgrace the unbelievers."
    },
    {
      "verseNumber": 3,
      "verseString": "وَأَذَانٌ مِنَ اللَّهِ وَرَسُولِهِ إِلَى النَّاسِ يَوْمَ الْحَجِّ الْأَكْبَرِ أَنَّ اللَّهَ بَرِيءٌ مِنَ الْمُشْرِكِينَ ۙ وَرَسُولُهُ ۚ فَإِنْ تُبْتُمْ فَهُوَ خَيْرٌ لَكُمْ ۖ وَإِنْ تَوَلَّيْتُمْ فَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ ۗ وَبَشِّرِ الَّذِينَ كَفَرُوا بِعَذَابٍ أَلِيمٍ",
      "verseStringB": "And a proclamation from Allah and His Messenger to the people on the day of the Greater Pilgrimage, that Allah has disowned the polytheists, and so did His Messenger. If you repent, it will be better for you. But if you turn away, know that you cannot escape Allah. And announce to those who disbelieve a painful punishment."
    },
    {
      "verseNumber": 4,
      "verseString": "إِلَّا الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ ثُمَّ لَمْ يَنْقُصُوكُمْ شَيْئًا وَلَمْ يُظَاهِرُوا عَلَيْكُمْ أَحَدًا فَأَتِمُّوا إِلَيْهِمْ عَهْدَهُمْ إِلَىٰ مُدَّتِهِمْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ",
      "verseStringB": "Except for those among the idolaters with whom you had made a treaty, and have violated none of its terms, nor aided anyone against you. So fulfill your treaty with them to the end of its term. Allah loves the righteous."
    },
    {
      "verseNumber": 5,
      "verseString": "فَإِذَا انْسَلَخَ الْأَشْهُرُ الْحُرُمُ فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدْتُمُوهُمْ وَخُذُوهُمْ وَاحْصُرُوهُمْ وَاقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ ۚ فَإِنْ تَابُوا وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ فَخَلُّوا سَبِيلَهُمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "verseStringB": "Then, when the Sacred Months have passed, kill the polytheists wherever you find them. And capture them, and besiege them, and lie in wait for them at every ambush. But if they repent, and perform the prayers, and give the alms, then let them go their way. Allah is Most Forgiving, Most Merciful."
    },
    {
      "verseNumber": 6,
      "verseString": "وَإِنْ أَحَدٌ مِنَ الْمُشْرِكِينَ اسْتَجَارَكَ فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَامَ اللَّهِ ثُمَّ أَبْلِغْهُ مَأْمَنَهُ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَعْلَمُونَ",
      "verseStringB": "And if any of the associators seek asylum with you, give him asylum, so that he may hear the Word of Allah; then escort him to his place of safety. That is because they are a people who do not know."
    },
    {
      "verseNumber": 7,
      "verseString": "كَيْفَ يَكُونُ لِلْمُشْرِكِينَ عَهْدٌ عِنْدَ اللَّهِ وَعِنْدَ رَسُولِهِ إِلَّا الَّذِينَ عَاهَدْتُمْ عِنْدَ الْمَسْجِدِ الْحَرَامِ ۖ فَمَا اسْتَقَامُوا لَكُمْ فَاسْتَقِيمُوا لَهُمْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ",
      "verseStringB": "How can the associators have a treaty with Allah and with His Messenger, except for those with whom you made a treaty at the Sacred Sanctuary? If they remain upright with you, remain upright with them. Allah loves the reverent."
    },
    {
      "verseNumber": 8,
      "verseString": "كَيْفَ وَإِنْ يَظْهَرُوا عَلَيْكُمْ لَا يَرْقُبُوا فِيكُمْ إِلًّا وَلَا ذِمَّةً ۚ يُرْضُونَكُمْ بِأَفْوَاهِهِمْ وَتَأْبَىٰ قُلُوبُهُمْ وَأَكْثَرُهُمْ فَاسِقُونَ",
      "verseStringB": "How? When they overcome you, they respect neither kinship nor treaty with you. They satisfy you with lip service, but their hearts refuse, and most of them are immoral."
    },
    {
      "verseNumber": 9,
      "verseString": "اشْتَرَوْا بِآيَاتِ اللَّهِ ثَمَنًا قَلِيلًا فَصَدُّوا عَنْ سَبِيلِهِ ۚ إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "They traded away Allah's revelations for a cheap price, and barred others from His path—evil is what they used to do."
    },
    {
      "verseNumber": 10,
      "verseString": "لَا يَرْقُبُونَ فِي مُؤْمِنٍ إِلًّا وَلَا ذِمَّةً ۚ وَأُولَٰئِكَ هُمُ الْمُعْتَدُونَ",
      "verseStringB": "Towards a believer, they respect neither kinship nor treaty. These are the offenders."
    },
    {
      "verseNumber": 11,
      "verseString": "فَإِنْ تَابُوا وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ فَإِخْوَانُكُمْ فِي الدِّينِ ۗ وَنُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ",
      "verseStringB": "But if they repent, and perform the prayers, and give the obligatory charity, then they are your brothers in faith. We detail the revelations for a people who know."
    },
    {
      "verseNumber": 12,
      "verseString": "وَإِنْ نَكَثُوا أَيْمَانَهُمْ مِنْ بَعْدِ عَهْدِهِمْ وَطَعَنُوا فِي دِينِكُمْ فَقَاتِلُوا أَئِمَّةَ الْكُفْرِ ۙ إِنَّهُمْ لَا أَيْمَانَ لَهُمْ لَعَلَّهُمْ يَنْتَهُونَ",
      "verseStringB": "But if they violate their oaths after making a pledge, and attack your faith, then fight the leaders of disbelief—they have no oaths—so that they may cease."
    },
    {
      "verseNumber": 13,
      "verseString": "أَلَا تُقَاتِلُونَ قَوْمًا نَكَثُوا أَيْمَانَهُمْ وَهَمُّوا بِإِخْرَاجِ الرَّسُولِ وَهُمْ بَدَءُوكُمْ أَوَّلَ مَرَّةٍ ۚ أَتَخْشَوْنَهُمْ ۚ فَاللَّهُ أَحَقُّ أَنْ تَخْشَوْهُ إِنْ كُنْتُمْ مُؤْمِنِينَ",
      "verseStringB": "Will you not fight a people who violated their oaths, and intended to expel the Messenger, and initiated hostilities against you? Do you fear them? It is Allah you should fear—if you are believers."
    },
    {
      "verseNumber": 14,
      "verseString": "قَاتِلُوهُمْ يُعَذِّبْهُمُ اللَّهُ بِأَيْدِيكُمْ وَيُخْزِهِمْ وَيَنْصُرْكُمْ عَلَيْهِمْ وَيَشْفِ صُدُورَ قَوْمٍ مُؤْمِنِينَ",
      "verseStringB": "Fight them. Allah will punish them at your hands, and humiliate them, and He will help you against them, and will heal the hearts of a believing people."
    },
    {
      "verseNumber": 15,
      "verseString": "وَيُذْهِبْ غَيْظَ قُلُوبِهِمْ ۗ وَيَتُوبُ اللَّهُ عَلَىٰ مَنْ يَشَاءُ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "verseStringB": "And He will remove the rage of their hearts. Allah relents towards whomever He wills. Allah is Knowledgeable and Wise."
    },
    {
      "verseNumber": 16,
      "verseString": "أَمْ حَسِبْتُمْ أَنْ تُتْرَكُوا وَلَمَّا يَعْلَمِ اللَّهُ الَّذِينَ جَاهَدُوا مِنْكُمْ وَلَمْ يَتَّخِذُوا مِنْ دُونِ اللَّهِ وَلَا رَسُولِهِ وَلَا الْمُؤْمِنِينَ وَلِيجَةً ۚ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ",
      "verseStringB": "Or did you suppose that you would be left alone, while Allah has not yet identified those among you who strive and take no friend apart from Allah, His Messenger, and the believers? Allah is Expert at what you do."
    },
    {
      "verseNumber": 17,
      "verseString": "مَا كَانَ لِلْمُشْرِكِينَ أَنْ يَعْمُرُوا مَسَاجِدَ اللَّهِ شَاهِدِينَ عَلَىٰ أَنْفُسِهِمْ بِالْكُفْرِ ۚ أُولَٰئِكَ حَبِطَتْ أَعْمَالُهُمْ وَفِي النَّارِ هُمْ خَالِدُونَ",
      "verseStringB": "It is not for the associators to attend Allah’s mosques while professing their disbelief against themselves. These—their deeds are void; and in the Fire, they will abide."
    },
    {
      "verseNumber": 18,
      "verseString": "إِنَّمَا يَعْمُرُ مَسَاجِدَ اللَّهِ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَأَقَامَ الصَّلَاةَ وَآتَى الزَّكَاةَ وَلَمْ يَخْشَ إِلَّا اللَّهَ ۖ فَعَسَىٰ أُولَٰئِكَ أَنْ يَكُونُوا مِنَ الْمُهْتَدِينَ",
      "verseStringB": "The only people to attend Allah’s mosques are those who believe in Allah and the Last Day, and pray regularly, and practice regular charity, and fear none except Allah. These are most likely to be guided."
    },
    {
      "verseNumber": 19,
      "verseString": "أَجَعَلْتُمْ سِقَايَةَ الْحَاجِّ وَعِمَارَةَ الْمَسْجِدِ الْحَرَامِ كَمَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَجَاهَدَ فِي سَبِيلِ اللَّهِ ۚ لَا يَسْتَوُونَ عِنْدَ اللَّهِ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "verseStringB": "Or do you consider giving drink to the pilgrims and maintaining the Sacred House equal to those who believe in Allah and the Last Day and strive in Allah’s way? They are not equal in the sight of Allah. Allah does not guide the unjust people."
    },
    {
      "verseNumber": 20,
      "verseString": "الَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ أَعْظَمُ دَرَجَةً عِنْدَ اللَّهِ ۚ وَأُولَٰئِكَ هُمُ الْفَائِزُونَ",
      "verseStringB": "Those who believe, and migrate, and strive in Allah’s path with their wealth and their lives, are of higher rank with Allah. These are the winners."
    },
    {
      "verseNumber": 21,
      "verseString": "يُبَشِّرُهُمْ رَبُّهُمْ بِرَحْمَةٍ مِنْهُ وَرِضْوَانٍ وَجَنَّاتٍ لَهُمْ فِيهَا نَعِيمٌ مُقِيمٌ",
      "verseStringB": "Their Lord gives them the good news of mercy from Him, and acceptance, and Gardens where they will have lasting bliss."
    },
    {
      "verseNumber": 22,
      "verseString": "خَالِدِينَ فِيهَا أَبَدًا ۚ إِنَّ اللَّهَ عِنْدَهُ أَجْرٌ عَظِيمٌ",
      "verseStringB": "To stay there forever. With Allah is a great reward."
    },
    {
      "verseNumber": 23,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا آبَاءَكُمْ وَإِخْوَانَكُمْ أَوْلِيَاءَ إِنِ اسْتَحَبُّوا الْكُفْرَ عَلَى الْإِيمَانِ ۚ وَمَنْ يَتَوَلَّهُمْ مِنْكُمْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ",
      "verseStringB": "O you who believe! Do not take your parents and your siblings for allies, if they prefer disbelief to belief. Whoever of you allies himself with them—these are the wrongdoers."
    },
    {
      "verseNumber": 24,
      "verseString": "قُلْ إِنْ كَانَ آبَاؤُكُمْ وَأَبْنَاؤُكُمْ وَإِخْوَانُكُمْ وَأَزْوَاجُكُمْ وَعَشِيرَتُكُمْ وَأَمْوَالٌ اقْتَرَفْتُمُوهَا وَتِجَارَةٌ تَخْشَوْنَ كَسَادَهَا وَمَسَاكِنُ تَرْضَوْنَهَا أَحَبَّ إِلَيْكُمْ مِنَ اللَّهِ وَرَسُولِهِ وَجِهَادٍ فِي سَبِيلِهِ فَتَرَبَّصُوا حَتَّىٰ يَأْتِيَ اللَّهُ بِأَمْرِهِ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ",
      "verseStringB": "Say, “If your parents, your children, your siblings, your spouses, your relatives, the wealth you have acquired, business you worry about, and homes you love, are dearer to you than Allah, and His Messenger, and striving in His way, then wait until Allah brings about His judgment.” Allah does not guide the rebellious people."
    },
    {
      "verseNumber": 25,
      "verseString": "لَقَدْ نَصَرَكُمُ اللَّهُ فِي مَوَاطِنَ كَثِيرَةٍ ۙ وَيَوْمَ حُنَيْنٍ ۙ إِذْ أَعْجَبَتْكُمْ كَثْرَتُكُمْ فَلَمْ تُغْنِ عَنْكُمْ شَيْئًا وَضَاقَتْ عَلَيْكُمُ الْأَرْضُ بِمَا رَحُبَتْ ثُمَّ وَلَّيْتُمْ مُدْبِرِينَ",
      "verseStringB": "Allah has given you victory in many regions; but on the day of Hunayn, your great number impressed you, but it availed you nothing; and the land, as spacious as it was, closed in on you; and you turned back in retreat."
    },
    {
      "verseNumber": 26,
      "verseString": "ثُمَّ أَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَىٰ رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَنْزَلَ جُنُودًا لَمْ تَرَوْهَا وَعَذَّبَ الَّذِينَ كَفَرُوا ۚ وَذَٰلِكَ جَزَاءُ الْكَافِرِينَ",
      "verseStringB": "Then Allah sent down His Tranquility upon His Messenger, and upon the believers. And He sent down forces you could not see, and He punished those who disbelieved. That is the payback of the disbelievers."
    },
    {
      "verseNumber": 27,
      "verseString": "ثُمَّ يَتُوبُ اللَّهُ مِنْ بَعْدِ ذَٰلِكَ عَلَىٰ مَنْ يَشَاءُ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "verseStringB": "Then, after that, Allah relents towards whomever He wills. Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 28,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْمُشْرِكُونَ نَجَسٌ فَلَا يَقْرَبُوا الْمَسْجِدَ الْحَرَامَ بَعْدَ عَامِهِمْ هَٰذَا ۚ وَإِنْ خِفْتُمْ عَيْلَةً فَسَوْفَ يُغْنِيكُمُ اللَّهُ مِنْ فَضْلِهِ إِنْ شَاءَ ۚ إِنَّ اللَّهَ عَلِيمٌ حَكِيمٌ",
      "verseStringB": "O you who believe! The associators are polluted, so let them not come near the Sacred House after this year of theirs. And if you fear poverty, Allah will enrich you from His bounty, if He wills. Allah is Aware and Wise."
    },
    {
      "verseNumber": 29,
      "verseString": "قَاتِلُوا الَّذِينَ لَا يُؤْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْآخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ اللَّهُ وَرَسُولُهُ وَلَا يَدِينُونَ دِينَ الْحَقِّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ حَتَّىٰ يُعْطُوا الْجِزْيَةَ عَنْ يَدٍ وَهُمْ صَاغِرُونَ",
      "verseStringB": "Fight those who do not believe in Allah and in the Last Day, and who do not forbid what Allah and His Messenger have forbidden, and who do not follow the Religion of Truth among those who were given the Scripture, until they pay the due tax with a willing hand, being compliant."
    },
    {
      "verseNumber": 30,
      "verseString": "وَقَالَتِ الْيَهُودُ عُزَيْرٌ ابْنُ اللَّهِ وَقَالَتِ النَّصَارَى الْمَسِيحُ ابْنُ اللَّهِ ۖ ذَٰلِكَ قَوْلُهُمْ بِأَفْوَاهِهِمْ ۖ يُضَاهِئُونَ قَوْلَ الَّذِينَ كَفَرُوا مِنْ قَبْلُ ۚ قَاتَلَهُمُ اللَّهُ ۚ أَنَّىٰ يُؤْفَكُونَ",
      "verseStringB": "The Jews said, “Ezra is the son of Allah,” and the Christians said, “The Messiah is the son of Allah.” These are their statements out of their mouths. They emulate the statements of those who disbelieved before. May Allah fight them! How deluded they are!"
    },
    {
      "verseNumber": 31,
      "verseString": "اتَّخَذُوا أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَابًا مِنْ دُونِ اللَّهِ وَالْمَسِيحَ ابْنَ مَرْيَمَ وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا إِلَٰهًا وَاحِدًا ۖ لَا إِلَٰهَ إِلَّا هُوَ ۚ سُبْحَانَهُ عَمَّا يُشْرِكُونَ",
      "verseStringB": "They have taken their scholars and their priests as lords instead of Allah, and the Christ son of Mary. Although they were only commanded to worship one God. There is no god except He! Glory be to Him, above the partners they ascribe."
    },
    {
      "verseNumber": 32,
      "verseString": "يُرِيدُونَ أَنْ يُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَيَأْبَى اللَّهُ إِلَّا أَنْ يُتِمَّ نُورَهُ وَلَوْ كَرِهَ الْكَافِرُونَ",
      "verseStringB": "They want to extinguish Allah’s light with their mouths, but Allah refuses except to complete His light, even though the unbelievers hate it."
    },
    {
      "verseNumber": 33,
      "verseString": "هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ",
      "verseStringB": "It is He Who sent His Messenger with the guidance and the religion of truth, to make it prevail over all religions, even though the associators hate it."
    },
    {
      "verseNumber": 34,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ كَثِيرًا مِنَ الْأَحْبَارِ وَالرُّهْبَانِ لَيَأْكُلُونَ أَمْوَالَ النَّاسِ بِالْبَاطِلِ وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ ۗ وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ وَلَا يُنْفِقُونَهَا فِي سَبِيلِ اللَّهِ فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ",
      "verseStringB": "O you who believe! Many of the pastors and priests consume people's wealth illicitly and hinder from Allah’s path. Those who hoard gold and silver, and do not spend it in Allah’s way, inform them of a painful punishment."
    },
    {
      "verseNumber": 35,
      "verseString": "يَوْمَ يُحْمَىٰ عَلَيْهَا فِي نَارِ جَهَنَّمَ فَتُكْوَىٰ بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ ۖ هَٰذَا مَا كَنَزْتُمْ لِأَنْفُسِكُمْ فَذُوقُوا مَا كُنْتُمْ تَكْنِزُونَ",
      "verseStringB": "On the Day when they will be heated in the Fire of Hell, then their foreheads, their sides, and their backs will be branded with it: “This is what you hoarded for yourselves; so taste what you used to hoard.”"
    },
    {
      "verseNumber": 36,
      "verseString": "إِنَّ عِدَّةَ الشُّهُورِ عِنْدَ اللَّهِ اثْنَا عَشَرَ شَهْرًا فِي كِتَابِ اللَّهِ يَوْمَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ مِنْهَا أَرْبَعَةٌ حُرُمٌ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ ۚ فَلَا تَظْلِمُوا فِيهِنَّ أَنْفُسَكُمْ ۚ وَقَاتِلُوا الْمُشْرِكِينَ كَافَّةً كَمَا يُقَاتِلُونَكُمْ كَافَّةً ۚ وَاعْلَمُوا أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ",
      "verseStringB": "The number of months, according to Allah, is twelve months—in the decree of Allah—the Day He created the heavens and the earth, of which four are sacred. This is the upright religion. So do not wrong yourselves during them. And fight the polytheists collectively, as they fight you collectively, and know that Allah is with the righteous."
    },
    {
      "verseNumber": 37,
      "verseString": "إِنَّمَا النَّسِيءُ زِيَادَةٌ فِي الْكُفْرِ ۖ يُضَلُّ بِهِ الَّذِينَ كَفَرُوا يُحِلُّونَهُ عَامًا وَيُحَرِّمُونَهُ عَامًا لِيُوَاطِئُوا عِدَّةَ مَا حَرَّمَ اللَّهُ فَيُحِلُّوا مَا حَرَّمَ اللَّهُ ۚ زُيِّنَ لَهُمْ سُوءُ أَعْمَالِهِمْ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْكَافِرِينَ",
      "verseStringB": "The postponement is an increase in disbelief—by which the unbelievers are misled. They allow it one year, and forbid it another year, in order to conform to the number made sacred by Allah, thus permitting what Allah has forbidden. The bad of their deeds was beautified for them. Allah does not guide the disbelieving people."
    },
    {
      "verseNumber": 38,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا مَا لَكُمْ إِذَا قِيلَ لَكُمُ انْفِرُوا فِي سَبِيلِ اللَّهِ اثَّاقَلْتُمْ إِلَى الْأَرْضِ ۚ أَرَضِيتُمْ بِالْحَيَاةِ الدُّنْيَا مِنَ الْآخِرَةِ ۚ فَمَا مَتَاعُ الْحَيَاةِ الدُّنْيَا فِي الْآخِرَةِ إِلَّا قَلِيلٌ",
      "verseStringB": "O you who believe! What is the matter with you, when it is said to you, “Mobilize in the way of Allah,” you cling heavily to the earth? Do you prefer the present life over the Hereafter? The enjoyment of the present life, compared to the Hereafter, is only a little."
    },
    {
      "verseNumber": 39,
      "verseString": "إِلَّا تَنْفِرُوا يُعَذِّبْكُمْ عَذَابًا أَلِيمًا وَيَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ وَلَا تَضُرُّوهُ شَيْئًا ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "Unless you mobilize, He will punish you most painfully, and He will replace you with another people; and you will not harm Him at all. Allah is capable of everything."
    },
    {
      "verseNumber": 40,
      "verseString": "إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ",
      "verseStringB": "If you do not support him, Allah has already supported him, when those who disbelieved expelled him, and he was the second of two in the cave. He said to his friend, “Do not be sad, Allah is with us.” Then Allah made His tranquility descend on him, and He supported him with forces you did not see, and He made the word of those who disbelieve the lowest, while Allah’s Word is the Highest. Allah is Mighty and Wise."
    },
    {
      "verseNumber": 41,
      "verseString": "انْفِرُوا خِفَافًا وَثِقَالًا وَجَاهِدُوا بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ فِي سَبِيلِ اللَّهِ ۚ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ",
      "verseStringB": "Mobilize, light or heavy, and strive with your wealth and your lives in Allah’s way. That is best for you—if you only knew."
    },
    {
      "verseNumber": 42,
      "verseString": "لَوْ كَانَ عَرَضًا قَرِيبًا وَسَفَرًا قَاصِدًا لَاتَّبَعُوكَ وَلَٰكِنْ بَعُدَتْ عَلَيْهِمُ الشُّقَّةُ ۚ وَسَيَحْلِفُونَ بِاللَّهِ لَوِ اسْتَطَعْنَا لَخَرَجْنَا مَعَكُمْ يُهْلِكُونَ أَنْفُسَهُمْ وَاللَّهُ يَعْلَمُ إِنَّهُمْ لَكَاذِبُونَ",
      "verseStringB": "Had the gain been immediate, and the journey shorter, they would have followed you. But the far distance was hard for them. Still, they swear by Allah: “Had we been able, we would have marched out with you.” They damn their own souls, and Allah knows that they are lying."
    },
    {
      "verseNumber": 43,
      "verseString": "عَفَا اللَّهُ عَنْكَ لِمَ أَذِنْتَ لَهُمْ حَتَّىٰ يَتَبَيَّنَ لَكَ الَّذِينَ صَدَقُوا وَتَعْلَمَ الْكَاذِبِينَ",
      "verseStringB": "Allah pardon you! Why did you give them permission before it became clear to you who are the truthful ones, and who are the liars?"
    },
    {
      "verseNumber": 44,
      "verseString": "لَا يَسْتَأْذِنُكَ الَّذِينَ يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يُجَاهِدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ ۗ وَاللَّهُ عَلِيمٌ بِالْمُتَّقِينَ",
      "verseStringB": "Those who believe in Allah and the Last Day do not ask you for exemption from striving with their wealth and their lives. Allah is fully aware of the righteous."
    },
    {
      "verseNumber": 45,
      "verseString": "إِنَّمَا يَسْتَأْذِنُكَ الَّذِينَ لَا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَارْتَابَتْ قُلُوبُهُمْ فَهُمْ فِي رَيْبِهِمْ يَتَرَدَّدُونَ",
      "verseStringB": "Only those who do not believe in Allah and the Last Day ask you for exemption. Their hearts are full of doubt, so they waver in their doubt."
    },
    {
      "verseNumber": 46,
      "verseString": "وَلَوْ أَرَادُوا الْخُرُوجَ لَأَعَدُّوا لَهُ عُدَّةً وَلَٰكِنْ كَرِهَ اللَّهُ انْبِعَاثَهُمْ فَثَبَّطَهُمْ وَقِيلَ اقْعُدُوا مَعَ الْقَاعِدِينَ",
      "verseStringB": "Had they wanted to mobilize, they would have made preparations for it; but Allah disliked their participation, so He held them back, and it was said, “Stay with those who stay behind.”"
    },
    {
      "verseNumber": 47,
      "verseString": "لَوْ خَرَجُوا فِيكُمْ مَا زَادُوكُمْ إِلَّا خَبَالًا وَلَأَوْضَعُوا خِلَالَكُمْ يَبْغُونَكُمُ الْفِتْنَةَ وَفِيكُمْ سَمَّاعُونَ لَهُمْ ۗ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ",
      "verseStringB": "Had they mobilized with you, they would have added only to your difficulties, and they would have spread rumors in your midst, trying to sow discord among you. Some of you are avid listeners to them. Allah knows the wrongdoers."
    },
    {
      "verseNumber": 48,
      "verseString": "لَقَدِ ابْتَغَوُا الْفِتْنَةَ مِنْ قَبْلُ وَقَلَّبُوا لَكَ الْأُمُورَ حَتَّىٰ جَاءَ الْحَقُّ وَظَهَرَ أَمْرُ اللَّهِ وَهُمْ كَارِهُونَ",
      "verseStringB": "They tried to create conflict before, and they turned the issues for you; until the truth prevailed, and Allah’s command became evident—despite their dislike."
    },
    {
      "verseNumber": 49,
      "verseString": "وَمِنْهُمْ مَنْ يَقُولُ ائْذَنْ لِي وَلَا تَفْتِنِّي ۚ أَلَا فِي الْفِتْنَةِ سَقَطُوا ۗ وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌ بِالْكَافِرِينَ",
      "verseStringB": "And among them is he who says, “Excuse me, and do not trouble me.” In fact, they have sunk into trouble. In fact, Hell will engulf the disbelievers."
    },
    {
      "verseNumber": 50,
      "verseString": "إِنْ تُصِبْكَ حَسَنَةٌ تَسُؤْهُمْ ۖ وَإِنْ تُصِبْكَ مُصِيبَةٌ يَقُولُوا قَدْ أَخَذْنَا أَمْرَنَا مِنْ قَبْلُ وَيَتَوَلَّوْا وَهُمْ فَرِحُونَ",
      "verseStringB": "If something good happens to you, it upsets them; and if a misfortune befalls you, they say, “We took our precautions in advance,” and they depart, happy."
    },
    {
      "verseNumber": 51,
      "verseString": "قُلْ لَنْ يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
      "verseStringB": "Say, “Nothing will happen to us, except what Allah has destined for us. He is our Protector. So in Allah, let the believers trust.”"
    },
    {
      "verseNumber": 52,
      "verseString": "قُلْ هَلْ تَرَبَّصُونَ بِنَا إِلَّا إِحْدَى الْحُسْنَيَيْنِ ۖ وَنَحْنُ نَتَرَبَّصُ بِكُمْ أَنْ يُصِيبَكُمُ اللَّهُ بِعَذَابٍ مِنْ عِنْدِهِ أَوْ بِأَيْدِينَا ۖ فَتَرَبَّصُوا إِنَّا مَعَكُمْ مُتَرَبِّصُونَ",
      "verseStringB": "Say, “Are you expecting for us anything other than one of the two excellences? As for us: we are expecting that Allah will afflict you with a punishment from Him, or at our hands. So wait, we are waiting with you.”"
    },
    {
      "verseNumber": 53,
      "verseString": "قُلْ أَنْفِقُوا طَوْعًا أَوْ كَرْهًا لَنْ يُتَقَبَّلَ مِنْكُمْ ۖ إِنَّكُمْ كُنْتُمْ قَوْمًا فَاسِقِينَ",
      "verseStringB": "Say, “Donate, willingly or unwillingly, it will not be accepted from you. You are disobedient people.”"
    },
    {
      "verseNumber": 54,
      "verseString": "وَمَا مَنَعَهُمْ أَنْ تُقْبَلَ مِنْهُمْ نَفَقَاتُهُمْ إِلَّا أَنَّهُمْ كَفَرُوا بِاللَّهِ وَبِرَسُولِهِ وَلَا يَأْتُونَ الصَّلَاةَ إِلَّا وَهُمْ كُسَالَىٰ وَلَا يُنْفِقُونَ إِلَّا وَهُمْ كَارِهُونَ",
      "verseStringB": "What prevents the acceptance of their contributions is nothing but the fact that they disbelieved in Allah and His Messenger, and that they do not approach the prayer except lazily, and that they do not donate except resentfully."
    },
    {
      "verseNumber": 55,
      "verseString": "فَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَلَا أَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ لِيُعَذِّبَهُمْ بِهَا فِي الْحَيَاةِ الدُّنْيَا وَتَزْهَقَ أَنْفُسُهُمْ وَهُمْ كَافِرُونَ",
      "verseStringB": "Let neither their possessions nor their children impress you. Allah intends to torment them through them in this worldly life, then their souls depart while they are disbelievers."
    },
    {
      "verseNumber": 56,
      "verseString": "وَيَحْلِفُونَ بِاللَّهِ إِنَّهُمْ لَمِنْكُمْ وَمَا هُمْ مِنْكُمْ وَلَٰكِنَّهُمْ قَوْمٌ يَفْرَقُونَ",
      "verseStringB": "And they swear by Allah, that they are of you. But they are not of you. They are a people in fear."
    },
    {
      "verseNumber": 57,
      "verseString": "لَوْ يَجِدُونَ مَلْجَأً أَوْ مَغَارَاتٍ أَوْ مُدَّخَلًا لَوَلَّوْا إِلَيْهِ وَهُمْ يَجْمَحُونَ",
      "verseStringB": "Were they to find a shelter, or a cave, or a hideout, they would rush towards it defiantly."
    },
    {
      "verseNumber": 58,
      "verseString": "وَمِنْهُمْ مَنْ يَلْمِزُكَ فِي الصَّدَقَاتِ فَإِنْ أُعْطُوا مِنْهَا رَضُوا وَإِنْ لَمْ يُعْطَوْا مِنْهَا إِذَا هُمْ يَسْخَطُونَ",
      "verseStringB": "And among them are those who criticize you regarding charities. If they are given some of it, they become pleased; but if they are not given any, they grow resentful."
    },
    {
      "verseNumber": 59,
      "verseString": "وَلَوْ أَنَّهُمْ رَضُوا مَا آتَاهُمُ اللَّهُ وَرَسُولُهُ وَقَالُوا حَسْبُنَا اللَّهُ سَيُؤْتِينَا اللَّهُ مِنْ فَضْلِهِ وَرَسُولُهُ إِنَّا إِلَى اللَّهِ رَاغِبُونَ",
      "verseStringB": "If only they were content with what Allah and His Messenger have given them, and said, “Allah is sufficient for us. Allah will give us from His bounty, as will His Messenger. Our desire is for Allah.”"
    },
    {
      "verseNumber": 60,
      "verseString": "إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ وَالْمَسَاكِينِ وَالْعَامِلِينَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِي الرِّقَابِ وَالْغَارِمِينَ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ ۖ فَرِيضَةً مِنَ اللَّهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "verseStringB": "Charities are for the poor, and the destitute, and those who administer them, and for reconciling hearts, and for freeing slaves, and for those in debt, and in the path of Allah, and for the homeless—an mandate from Allah. Allah is All-Knowing, Most Wise."
    },
    {
      "verseNumber": 61,
      "verseString": "وَمِنْهُمُ الَّذِينَ يُؤْذُونَ النَّبِيَّ وَيَقُولُونَ هُوَ أُذُنٌ ۚ قُلْ أُذُنُ خَيْرٍ لَكُمْ يُؤْمِنُ بِاللَّهِ وَيُؤْمِنُ لِلْمُؤْمِنِينَ وَرَحْمَةٌ لِلَّذِينَ آمَنُوا مِنْكُمْ ۚ وَالَّذِينَ يُؤْذُونَ رَسُولَ اللَّهِ لَهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "And among them are those who harass the Prophet, and say, “He is all ears.” Say, “He listens for your own good. He believes in Allah, he trusts the believers, and he is a mercy for those among you who believe.” Those who insult Allah’s Messenger will have a painful punishment."
    },
    {
      "verseNumber": 62,
      "verseString": "يَحْلِفُونَ بِاللَّهِ لَكُمْ لِيُرْضُوكُمْ وَاللَّهُ وَرَسُولُهُ أَحَقُّ أَنْ يُرْضُوهُ إِنْ كَانُوا مُؤْمِنِينَ",
      "verseStringB": "They swear by Allah to you, to please you. But Allah and His Messenger are worthier of being pleased by them: if they are believers."
    },
    {
      "verseNumber": 63,
      "verseString": "أَلَمْ يَعْلَمُوا أَنَّهُ مَنْ يُحَادِدِ اللَّهَ وَرَسُولَهُ فَأَنَّ لَهُ نَارَ جَهَنَّمَ خَالِدًا فِيهَا ۚ ذَٰلِكَ الْخِزْيُ الْعَظِيمُ",
      "verseStringB": "Do they not know that whoever opposes Allah and His Messenger, will have the Fire of Hell, remaining in it forever? That is the ultimate disgrace."
    },
    {
      "verseNumber": 64,
      "verseString": "يَحْذَرُ الْمُنَافِقُونَ أَنْ تُنَزَّلَ عَلَيْهِمْ سُورَةٌ تُنَبِّئُهُمْ بِمَا فِي قُلُوبِهِمْ ۚ قُلِ اسْتَهْزِئُوا إِنَّ اللَّهَ مُخْرِجٌ مَا تَحْذَرُونَ",
      "verseStringB": "The hypocrites dread lest a chapter is revealed against them, informing them of what is in their hearts. Say, “Go on mocking; Allah will bring out what you dread.”"
    },
    {
      "verseNumber": 65,
      "verseString": "وَلَئِنْ سَأَلْتَهُمْ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلْعَبُ ۚ قُلْ أَبِاللَّهِ وَآيَاتِهِ وَرَسُولِهِ كُنْتُمْ تَسْتَهْزِئُونَ",
      "verseStringB": "And if you question them, they will say, “We were just joking and playing.” Say, “Was it Allah, His revelations, and His Messenger that you ridiculed?”"
    },
    {
      "verseNumber": 66,
      "verseString": "لَا تَعْتَذِرُوا قَدْ كَفَرْتُمْ بَعْدَ إِيمَانِكُمْ ۚ إِنْ نَعْفُ عَنْ طَائِفَةٍ مِنْكُمْ نُعَذِّبْ طَائِفَةً بِأَنَّهُمْ كَانُوا مُجْرِمِينَ",
      "verseStringB": "Do not make excuses. You disbelieved after having believed. If We pardon some of you, We will punish others, because they are guilty."
    },
    {
      "verseNumber": 67,
      "verseString": "الْمُنَافِقُونَ وَالْمُنَافِقَاتُ بَعْضُهُمْ مِنْ بَعْضٍ ۚ يَأْمُرُونَ بِالْمُنْكَرِ وَيَنْهَوْنَ عَنِ الْمَعْرُوفِ وَيَقْبِضُونَ أَيْدِيَهُمْ ۚ نَسُوا اللَّهَ فَنَسِيَهُمْ ۗ إِنَّ الْمُنَافِقِينَ هُمُ الْفَاسِقُونَ",
      "verseStringB": "The hypocrite men and hypocrite women are of one another. They advocate evil, and prohibit righteousness, and withhold their hands. They forgot Allah, so He neglected them. The hypocrites are the sinners."
    },
    {
      "verseNumber": 68,
      "verseString": "وَعَدَ اللَّهُ الْمُنَافِقِينَ وَالْمُنَافِقَاتِ وَالْكُفَّارَ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ هِيَ حَسْبُهُمْ ۚ وَلَعَنَهُمُ اللَّهُ ۖ وَلَهُمْ عَذَابٌ مُقِيمٌ",
      "verseStringB": "Allah has promised the hypocrite men and hypocrite women, and the disbelievers, the Fire of Hell, remaining in it forever. It is their due. And Allah has cursed them, and they will have a lasting punishment."
    },
    {
      "verseNumber": 69,
      "verseString": "كَالَّذِينَ مِنْ قَبْلِكُمْ كَانُوا أَشَدَّ مِنْكُمْ قُوَّةً وَأَكْثَرَ أَمْوَالًا وَأَوْلَادًا فَاسْتَمْتَعُوا بِخَلَاقِهِمْ فَاسْتَمْتَعْتُمْ بِخَلَاقِكُمْ كَمَا اسْتَمْتَعَ الَّذِينَ مِنْ قَبْلِكُمْ بِخَلَاقِهِمْ وَخُضْتُمْ كَالَّذِي خَاضُوا ۚ أُولَٰئِكَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ ۖ وَأُولَٰئِكَ هُمُ الْخَاسِرُونَ",
      "verseStringB": "Like those before you. They were superior to you in might, and more abundant in wealth and children. So they enjoyed their share, and you enjoyed your share, just as those before you enjoyed their share. And you indulged, as they indulged. It is they whose works will fail in this world and in the Hereafter. It is they who are the losers."
    },
    {
      "verseNumber": 70,
      "verseString": "أَلَمْ يَأْتِهِمْ نَبَأُ الَّذِينَ مِنْ قَبْلِهِمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَقَوْمِ إِبْرَاهِيمَ وَأَصْحَابِ مَدْيَنَ وَالْمُؤْتَفِكَاتِ ۚ أَتَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ ۖ فَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَٰكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ",
      "verseStringB": "Did not the story of those before them reach them? The people of Noah, Aad, and Thamood, and the people of Abraham, the inhabitants of Median, and the Overturned Cities? Their messengers came to them with clear proofs. Allah never wronged them, but they used to wrong their own selves."
    },
    {
      "verseNumber": 71,
      "verseString": "وَالْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ يَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنْكَرِ وَيُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَيُطِيعُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَٰئِكَ سَيَرْحَمُهُمُ اللَّهُ ۗ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ",
      "verseStringB": "The believing men and believing women are friends of one another. They advocate virtue, forbid evil, perform the prayers, practice charity, and obey Allah and His Messenger. These—Allah will have mercy on them. Allah is Mighty and Wise."
    },
    {
      "verseNumber": 72,
      "verseString": "وَعَدَ اللَّهُ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ۚ وَرِضْوَانٌ مِنَ اللَّهِ أَكْبَرُ ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
      "verseStringB": "Allah has promised the believers, men and women, Gardens beneath which rivers flow, to stay there forever, and splendid homes in the Gardens of Eden. But approval from Allah is even greater. That is the supreme achievement."
    },
    {
      "verseNumber": 73,
      "verseString": "يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ",
      "verseStringB": "O Prophet! Strive against the unbelievers and the hypocrites, and be stern with them. Their home is Hell—a miserable destination."
    },
    {
      "verseNumber": 74,
      "verseString": "يَحْلِفُونَ بِاللَّهِ مَا قَالُوا وَلَقَدْ قَالُوا كَلِمَةَ الْكُفْرِ وَكَفَرُوا بَعْدَ إِسْلَامِهِمْ وَهَمُّوا بِمَا لَمْ يَنَالُوا ۚ وَمَا نَقَمُوا إِلَّا أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِنْ فَضْلِهِ ۚ فَإِنْ يَتُوبُوا يَكُ خَيْرًا لَهُمْ ۖ وَإِنْ يَتَوَلَّوْا يُعَذِّبْهُمُ اللَّهُ عَذَابًا أَلِيمًا فِي الدُّنْيَا وَالْآخِرَةِ ۚ وَمَا لَهُمْ فِي الْأَرْضِ مِنْ وَلِيٍّ وَلَا نَصِيرٍ",
      "verseStringB": "They swear by Allah that they said nothing, but they did utter the word of blasphemy, and they renounced faith after their submission. And they had ambitions they could not achieve. They were resentful only because Allah and His Messenger have enriched them out of His grace. If they repent, it will be better for them. But if they turn away, Allah will afflict them with a painful punishment—in this life and in the Hereafter—and on earth, they will have no protector and no helper."
    },
    {
      "verseNumber": 75,
      "verseString": "وَمِنْهُمْ مَنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِنْ فَضْلِهِ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ الصَّالِحِينَ",
      "verseStringB": "And among them are those who pledge to Allah: “If He gives us from His grace, we will donate, and be of the upright.”"
    },
    {
      "verseNumber": 76,
      "verseString": "فَلَمَّا آتَاهُمْ مِنْ فَضْلِهِ بَخِلُوا بِهِ وَتَوَلَّوْا وَهُمْ مُعْرِضُونَ",
      "verseStringB": "But when He gave them from His grace, they withheld it, and they turned away indifferently."
    },
    {
      "verseNumber": 77,
      "verseString": "فَأَعْقَبَهُمْ نِفَاقًا فِي قُلُوبِهِمْ إِلَىٰ يَوْمِ يَلْقَوْنَهُ بِمَا أَخْلَفُوا اللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُوا يَكْذِبُونَ",
      "verseStringB": "So He penalized them with hypocrisy in their hearts—until the Day they face Him—because they violated their pledge to Allah, and because they used to lie."
    },
    {
      "verseNumber": 78,
      "verseString": "أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ سِرَّهُمْ وَنَجْوَاهُمْ وَأَنَّ اللَّهَ عَلَّامُ الْغُيُوبِ",
      "verseStringB": "Do they not know that Allah knows their secrets and their conspiracies? And that Allah is the Knower of the unseen?"
    },
    {
      "verseNumber": 79,
      "verseString": "الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لَا يَجِدُونَ إِلَّا جُهْدَهُمْ فَيَسْخَرُونَ مِنْهُمْ ۙ سَخِرَ اللَّهُ مِنْهُمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "Those who criticize the believers for donating voluntarily, and ridicule those who find nothing to offer except their own efforts—Allah ridicules them—they will have a painful punishment."
    },
    {
      "verseNumber": 80,
      "verseString": "اسْتَغْفِرْ لَهُمْ أَوْ لَا تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ ۚ ذَٰلِكَ بِأَنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ",
      "verseStringB": "Whether you ask forgiveness for them, or do not ask forgiveness for them. Even if you ask forgiveness for them seventy times, Allah will not forgive them. That is because they rejected Allah and His Messenger. Allah does not guide the immoral people."
    },
    {
      "verseNumber": 81,
      "verseString": "فَرِحَ الْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلَافَ رَسُولِ اللَّهِ وَكَرِهُوا أَنْ يُجَاهِدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ وَقَالُوا لَا تَنْفِرُوا فِي الْحَرِّ ۗ قُلْ نَارُ جَهَنَّمَ أَشَدُّ حَرًّا ۚ لَوْ كَانُوا يَفْقَهُونَ",
      "verseStringB": "Those who stayed behind rejoiced at their staying behind Allah’s Messenger. And they hated to strive with their wealth and their lives in Allah’s way. And they said, “Do not venture out in the heat.” Say, “The Fire of Gehenna is much hotter—if they only understood.”"
    },
    {
      "verseNumber": 82,
      "verseString": "فَلْيَضْحَكُوا قَلِيلًا وَلْيَبْكُوا كَثِيرًا جَزَاءً بِمَا كَانُوا يَكْسِبُونَ",
      "verseStringB": "So let them laugh a little, and weep much—in return for what they used to earn."
    },
    {
      "verseNumber": 83,
      "verseString": "فَإِنْ رَجَعَكَ اللَّهُ إِلَىٰ طَائِفَةٍ مِنْهُمْ فَاسْتَأْذَنُوكَ لِلْخُرُوجِ فَقُلْ لَنْ تَخْرُجُوا مَعِيَ أَبَدًا وَلَنْ تُقَاتِلُوا مَعِيَ عَدُوًّا ۖ إِنَّكُمْ رَضِيتُمْ بِالْقُعُودِ أَوَّلَ مَرَّةٍ فَاقْعُدُوا مَعَ الْخَالِفِينَ",
      "verseStringB": "If Allah returns you to a group of them, and they ask your permission to go out, say, “You will not go out with me, ever, nor will you ever fight an enemy with me. You were content to sit back the first time, so sit back with those who stay behind.”"
    },
    {
      "verseNumber": 84,
      "verseString": "وَلَا تُصَلِّ عَلَىٰ أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلَا تَقُمْ عَلَىٰ قَبْرِهِ ۖ إِنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَمَاتُوا وَهُمْ فَاسِقُونَ",
      "verseStringB": "You are never to pray over any of them who dies, nor are you to stand at his graveside. They have rejected Allah and His Messenger, and they died while they were sinners."
    },
    {
      "verseNumber": 85,
      "verseString": "وَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَأَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ أَنْ يُعَذِّبَهُمْ بِهَا فِي الدُّنْيَا وَتَزْهَقَ أَنْفُسُهُمْ وَهُمْ كَافِرُونَ",
      "verseStringB": "Do not let their wealth and their children impress you. Allah intends to torment them through them in this world, and their souls expire while they are unbelievers."
    },
    {
      "verseNumber": 86,
      "verseString": "وَإِذَا أُنْزِلَتْ سُورَةٌ أَنْ آمِنُوا بِاللَّهِ وَجَاهِدُوا مَعَ رَسُولِهِ اسْتَأْذَنَكَ أُولُو الطَّوْلِ مِنْهُمْ وَقَالُوا ذَرْنَا نَكُنْ مَعَ الْقَاعِدِينَ",
      "verseStringB": "And when a chapter is revealed: “Believe in Allah and strive with His Messenger,” the prominent among them ask you for exemption. They say, “Leave us to stay with those who stay behind.”"
    },
    {
      "verseNumber": 87,
      "verseString": "رَضُوا بِأَنْ يَكُونُوا مَعَ الْخَوَالِفِ وَطُبِعَ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ",
      "verseStringB": "They prefer to be with those who stay behind. Their hearts were sealed, so they do not understand."
    },
    {
      "verseNumber": 88,
      "verseString": "لَٰكِنِ الرَّسُولُ وَالَّذِينَ آمَنُوا مَعَهُ جَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ ۚ وَأُولَٰئِكَ لَهُمُ الْخَيْرَاتُ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
      "verseStringB": "But the Messenger and those who believe with him strive with their possessions and their lives. It is they who will have the good things, and it is they who will prosper."
    },
    {
      "verseNumber": 89,
      "verseString": "أَعَدَّ اللَّهُ لَهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ",
      "verseStringB": "Allah has prepared for them Gardens beneath which rivers flow, to stay there forever. That is the ultimate victory."
    },
    {
      "verseNumber": 90,
      "verseString": "وَجَاءَ الْمُعَذِّرُونَ مِنَ الْأَعْرَابِ لِيُؤْذَنَ لَهُمْ وَقَعَدَ الَّذِينَ كَذَبُوا اللَّهَ وَرَسُولَهُ ۚ سَيُصِيبُ الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "Some Nomadic-Arabs came with excuses, seeking an exemption. While those who were untrue to Allah and His Messenger remained behind. A painful punishment will afflict those among them who disbelieved."
    },
    {
      "verseNumber": 91,
      "verseString": "لَيْسَ عَلَى الضُّعَفَاءِ وَلَا عَلَى الْمَرْضَىٰ وَلَا عَلَى الَّذِينَ لَا يَجِدُونَ مَا يُنْفِقُونَ حَرَجٌ إِذَا نَصَحُوا لِلَّهِ وَرَسُولِهِ ۚ مَا عَلَى الْمُحْسِنِينَ مِنْ سَبِيلٍ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "verseStringB": "There is no blame on the weak, nor on the sick, nor on those who have nothing to contribute, provided they are true to Allah and His Messenger. In no way can the righteous be blamed. Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 92,
      "verseString": "وَلَا عَلَى الَّذِينَ إِذَا مَا أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لَا أَجِدُ مَا أَحْمِلُكُمْ عَلَيْهِ تَوَلَّوْا وَأَعْيُنُهُمْ تَفِيضُ مِنَ الدَّمْعِ حَزَنًا أَلَّا يَجِدُوا مَا يُنْفِقُونَ",
      "verseStringB": "Nor on those who approach you, wishing to ride with you, and you said, “I have nothing to carry you on.” So they turned away, with their eyes overflowing with tears, sorrowing for not finding the means to contribute."
    },
    {
      "verseNumber": 93,
      "verseString": "إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَسْتَأْذِنُونَكَ وَهُمْ أَغْنِيَاءُ ۚ رَضُوا بِأَنْ يَكُونُوا مَعَ الْخَوَالِفِ وَطَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "Blame lies on those who seek exemption from you, although they have the means. They are content to stay with those who stay behind. Allah has sealed their hearts, and they do not realize."
    },
    {
      "verseNumber": 94,
      "verseString": "يَعْتَذِرُونَ إِلَيْكُمْ إِذَا رَجَعْتُمْ إِلَيْهِمْ ۚ قُلْ لَا تَعْتَذِرُوا لَنْ نُؤْمِنَ لَكُمْ قَدْ نَبَّأَنَا اللَّهُ مِنْ أَخْبَارِكُمْ ۚ وَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ ثُمَّ تُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "They will offer you excuses when you return to them. Say, “Make no excuses; we do not believe you; Allah has informed us about you. And Allah will be watching your actions, and so will His Messenger. Then you will be returned to the Knower of the Known and the Unknown, and He will inform you of what you used to do.”"
    },
    {
      "verseNumber": 95,
      "verseString": "سَيَحْلِفُونَ بِاللَّهِ لَكُمْ إِذَا انْقَلَبْتُمْ إِلَيْهِمْ لِتُعْرِضُوا عَنْهُمْ ۖ فَأَعْرِضُوا عَنْهُمْ ۖ إِنَّهُمْ رِجْسٌ ۖ وَمَأْوَاهُمْ جَهَنَّمُ جَزَاءً بِمَا كَانُوا يَكْسِبُونَ",
      "verseStringB": "They will swear by Allah to you, when you return to them, that you may leave them alone. So leave them alone. They are despicable, and their destiny is Hell; a payback for what they used to do."
    },
    {
      "verseNumber": 96,
      "verseString": "يَحْلِفُونَ لَكُمْ لِتَرْضَوْا عَنْهُمْ ۖ فَإِنْ تَرْضَوْا عَنْهُمْ فَإِنَّ اللَّهَ لَا يَرْضَىٰ عَنِ الْقَوْمِ الْفَاسِقِينَ",
      "verseStringB": "They swear to you, so that you may accept them. But even if you accept them, Allah does not accept the wicked people."
    },
    {
      "verseNumber": 97,
      "verseString": "الْأَعْرَابُ أَشَدُّ كُفْرًا وَنِفَاقًا وَأَجْدَرُ أَلَّا يَعْلَمُوا حُدُودَ مَا أَنْزَلَ اللَّهُ عَلَىٰ رَسُولِهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "verseStringB": "The Desert-Arabs are the most steeped in disbelief and hypocrisy, and the most likely to ignore the limits that Allah has revealed to His Messenger. Allah is Knowing and Wise."
    },
    {
      "verseNumber": 98,
      "verseString": "وَمِنَ الْأَعْرَابِ مَنْ يَتَّخِذُ مَا يُنْفِقُ مَغْرَمًا وَيَتَرَبَّصُ بِكُمُ الدَّوَائِرَ ۚ عَلَيْهِمْ دَائِرَةُ السَّوْءِ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ",
      "verseStringB": "And among the Desert-Arabs are those who consider their contribution to be a penalty. And they wait for a reversal of your fortunes. Upon them will fall the cycle of misfortune. Allah is Hearing and Knowing."
    },
    {
      "verseNumber": 99,
      "verseString": "وَمِنَ الْأَعْرَابِ مَنْ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَتَّخِذُ مَا يُنْفِقُ قُرُبَاتٍ عِنْدَ اللَّهِ وَصَلَوَاتِ الرَّسُولِ ۚ أَلَا إِنَّهَا قُرْبَةٌ لَهُمْ ۚ سَيُدْخِلُهُمُ اللَّهُ فِي رَحْمَتِهِ ۗ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "verseStringB": "Yet among the Desert-Arabs are those who believe in Allah and the Last Day, and consider their contribution to be means towards Allah, and the prayers of the Messenger. It will surely draw them closer, and Allah will admit them into His mercy. Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 100,
      "verseString": "وَالسَّابِقُونَ الْأَوَّلُونَ مِنَ الْمُهَاجِرِينَ وَالْأَنْصَارِ وَالَّذِينَ اتَّبَعُوهُمْ بِإِحْسَانٍ رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ وَأَعَدَّ لَهُمْ جَنَّاتٍ تَجْرِي تَحْتَهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ",
      "verseStringB": "The Pioneers—the first of the Migrants and the Supporters, and those who followed them in righteousness. Allah is pleased with them, and they are pleased with Him. He has prepared for them Gardens beneath which rivers flow, where they will abide forever. That is the ultimate triumph."
    },
    {
      "verseNumber": 101,
      "verseString": "وَمِمَّنْ حَوْلَكُمْ مِنَ الْأَعْرَابِ مُنَافِقُونَ ۖ وَمِنْ أَهْلِ الْمَدِينَةِ ۖ مَرَدُوا عَلَى النِّفَاقِ لَا تَعْلَمُهُمْ ۖ نَحْنُ نَعْلَمُهُمْ ۚ سَنُعَذِّبُهُمْ مَرَّتَيْنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٍ",
      "verseStringB": "And among the Desert-Arabs around you, some are hypocrites, and also among the inhabitants of Medina. They have become adamant in hypocrisy. You do not know them, but We know them. We will punish them twice; then they will be returned to severe suffering."
    },
    {
      "verseNumber": 102,
      "verseString": "وَآخَرُونَ اعْتَرَفُوا بِذُنُوبِهِمْ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "verseStringB": "And others have confessed their sins, having mixed righteous deeds with bad deeds. Perhaps Allah will accept their repentance. Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 103,
      "verseString": "خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِمْ بِهَا وَصَلِّ عَلَيْهِمْ ۖ إِنَّ صَلَاتَكَ سَكَنٌ لَهُمْ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ",
      "verseStringB": "Accept contributions from their wealth, to purify them and sanctify them with it—and bless them. Your prayer is a comfort for them. Allah is Hearing and Knowing."
    },
    {
      "verseNumber": 104,
      "verseString": "أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَأْخُذُ الصَّدَقَاتِ وَأَنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ",
      "verseStringB": "Do they not know that Allah accepts the repentance of His worshipers, and that He receives the contributions, and that Allah is the Acceptor of Repentance, the Merciful?"
    },
    {
      "verseNumber": 105,
      "verseString": "وَقُلِ اعْمَلُوا فَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ وَالْمُؤْمِنُونَ ۖ وَسَتُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "Say, “Act. Allah will see your actions, as will His Messenger and the believers. Then you will be returned to the Knower of secrets and declarations, and He will inform you of what you used to do.”"
    },
    {
      "verseNumber": 106,
      "verseString": "وَآخَرُونَ مُرْجَوْنَ لِأَمْرِ اللَّهِ إِمَّا يُعَذِّبُهُمْ وَإِمَّا يَتُوبُ عَلَيْهِمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "verseStringB": "And others are held in suspense, awaiting the command of Allah, as to whether He will punish them, or relent towards them. Allah is Knowing and Wise."
    },
    {
      "verseNumber": 107,
      "verseString": "وَالَّذِينَ اتَّخَذُوا مَسْجِدًا ضِرَارًا وَكُفْرًا وَتَفْرِيقًا بَيْنَ الْمُؤْمِنِينَ وَإِرْصَادًا لِمَنْ حَارَبَ اللَّهَ وَرَسُولَهُ مِنْ قَبْلُ ۚ وَلَيَحْلِفُنَّ إِنْ أَرَدْنَا إِلَّا الْحُسْنَىٰ ۖ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ",
      "verseStringB": "Then there are those who establish a mosque to create trouble, and disbelief, and disunity among the believers, and as an outpost for those who fight Allah and His Messenger. And they swear: “Our intentions are nothing but good.” But Allah testifies that they are liars."
    },
    {
      "verseNumber": 108,
      "verseString": "لَا تَقُمْ فِيهِ أَبَدًا ۚ لَمَسْجِدٌ أُسِّسَ عَلَى التَّقْوَىٰ مِنْ أَوَّلِ يَوْمٍ أَحَقُّ أَنْ تَقُومَ فِيهِ ۚ فِيهِ رِجَالٌ يُحِبُّونَ أَنْ يَتَطَهَّرُوا ۚ وَاللَّهُ يُحِبُّ الْمُطَّهِّرِينَ",
      "verseStringB": "Do not stand in it, ever. A mosque founded upon piety from the first day is worthier of your prayers. In it are men who love to be purified. Allah loves those who purify themselves."
    },
    {
      "verseNumber": 109,
      "verseString": "أَفَمَنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ تَقْوَىٰ مِنَ اللَّهِ وَرِضْوَانٍ خَيْرٌ أَمْ مَنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ شَفَا جُرُفٍ هَارٍ فَانْهَارَ بِهِ فِي نَارِ جَهَنَّمَ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "verseStringB": "Is he who establishes his structure upon piety and acceptance from Allah better, or he who establishes his structure on the brink of a cliff that is about to tumble, and so it tumbles with him into the Fire of Hell? Allah does not guide the wrongdoing people."
    },
    {
      "verseNumber": 110,
      "verseString": "لَا يَزَالُ بُنْيَانُهُمُ الَّذِي بَنَوْا رِيبَةً فِي قُلُوبِهِمْ إِلَّا أَنْ تَقَطَّعَ قُلُوبُهُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "verseStringB": "The structure which they built will remain questionable in their hearts—until their hearts are stopped. Allah is Knowing and Wise."
    },
    {
      "verseNumber": 111,
      "verseString": "إِنَّ اللَّهَ اشْتَرَىٰ مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَأَمْوَالَهُمْ بِأَنَّ لَهُمُ الْجَنَّةَ ۚ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ ۖ وَعْدًا عَلَيْهِ حَقًّا فِي التَّوْرَاةِ وَالْإِنْجِيلِ وَالْقُرْآنِ ۚ وَمَنْ أَوْفَىٰ بِعَهْدِهِ مِنَ اللَّهِ ۚ فَاسْتَبْشِرُوا بِبَيْعِكُمُ الَّذِي بَايَعْتُمْ بِهِ ۚ وَذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
      "verseStringB": "Allah has purchased from the believers their lives and their wealth in exchange for Paradise. They fight in Allah’s way, so they kill and get killed. It is a promise binding on Him in the Torah, and the Gospel, and the Quran. And who is more faithful to his promise than Allah? So rejoice in making such an exchange—that is the supreme triumph."
    },
    {
      "verseNumber": 112,
      "verseString": "التَّائِبُونَ الْعَابِدُونَ الْحَامِدُونَ السَّائِحُونَ الرَّاكِعُونَ السَّاجِدُونَ الْآمِرُونَ بِالْمَعْرُوفِ وَالنَّاهُونَ عَنِ الْمُنْكَرِ وَالْحَافِظُونَ لِحُدُودِ اللَّهِ ۗ وَبَشِّرِ الْمُؤْمِنِينَ",
      "verseStringB": "Those who repent, those who worship, those who praise, those who journey, those who kneel, those who bow down, those who advocate righteousness and forbid evil, and those who observe the limits of Allah; and give good news to the believers."
    },
    {
      "verseNumber": 113,
      "verseString": "مَا كَانَ لِلنَّبِيِّ وَالَّذِينَ آمَنُوا أَنْ يَسْتَغْفِرُوا لِلْمُشْرِكِينَ وَلَوْ كَانُوا أُولِي قُرْبَىٰ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحَابُ الْجَحِيمِ",
      "verseStringB": "It is not for the Prophet and those who believe to ask forgiveness for the associators, even if they were close relatives—after it has become clear to them that they are the inhabitants of the Blaze."
    },
    {
      "verseNumber": 114,
      "verseString": "وَمَا كَانَ اسْتِغْفَارُ إِبْرَاهِيمَ لِأَبِيهِ إِلَّا عَنْ مَوْعِدَةٍ وَعَدَهَا إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ ۚ إِنَّ إِبْرَاهِيمَ لَأَوَّاهٌ حَلِيمٌ",
      "verseStringB": "Abraham asked forgiveness for his father only because of a promise he had made to him. But when it became clear to him that he was an enemy of Allah, he disowned him. Abraham was caring and patient."
    },
    {
      "verseNumber": 115,
      "verseString": "وَمَا كَانَ اللَّهُ لِيُضِلَّ قَوْمًا بَعْدَ إِذْ هَدَاهُمْ حَتَّىٰ يُبَيِّنَ لَهُمْ مَا يَتَّقُونَ ۚ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "verseStringB": "It is not for Allah to lead a people astray after having guided them—until He clarifies for them what they should guard against. Allah is Knower of all things."
    },
    {
      "verseNumber": 116,
      "verseString": "إِنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ يُحْيِي وَيُمِيتُ ۚ وَمَا لَكُمْ مِنْ دُونِ اللَّهِ مِنْ وَلِيٍّ وَلَا نَصِيرٍ",
      "verseStringB": "To Allah belongs the sovereignty of the heavens and the earth. He gives life, and He causes death. And besides Allah, you have neither protector nor helper."
    },
    {
      "verseNumber": 117,
      "verseString": "لَقَدْ تَابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ وَالْأَنْصَارِ الَّذِينَ اتَّبَعُوهُ فِي سَاعَةِ الْعُسْرَةِ مِنْ بَعْدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٍ مِنْهُمْ ثُمَّ تَابَ عَلَيْهِمْ ۚ إِنَّهُ بِهِمْ رَءُوفٌ رَحِيمٌ",
      "verseStringB": "Allah has redeemed the Prophet, and the Emigrants, and the Supporters—those who followed him in the hour of difficulty—after the hearts of some of them almost swerved. Then He accepted their repentance. He is Kind towards them, Compassionate."
    },
    {
      "verseNumber": 118,
      "verseString": "وَعَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا حَتَّىٰ إِذَا ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ وَظَنُّوا أَنْ لَا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا ۚ إِنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ",
      "verseStringB": "Also towards the three who were left behind. Then, when the earth, as vast as it is, closed in on them, and their souls closed in on them, and they realized that there was no refuge from Allah, except in Him, and He relented towards them, so that they may repent. Allah is the Acceptor of Repentance, the Most Merciful."
    },
    {
      "verseNumber": 119,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ",
      "verseStringB": "O you who believe! Be mindful of Allah, and be among the truthful."
    },
    {
      "verseNumber": 120,
      "verseString": "مَا كَانَ لِأَهْلِ الْمَدِينَةِ وَمَنْ حَوْلَهُمْ مِنَ الْأَعْرَابِ أَنْ يَتَخَلَّفُوا عَنْ رَسُولِ اللَّهِ وَلَا يَرْغَبُوا بِأَنْفُسِهِمْ عَنْ نَفْسِهِ ۚ ذَٰلِكَ بِأَنَّهُمْ لَا يُصِيبُهُمْ ظَمَأٌ وَلَا نَصَبٌ وَلَا مَخْمَصَةٌ فِي سَبِيلِ اللَّهِ وَلَا يَطَئُونَ مَوْطِئًا يَغِيظُ الْكُفَّارَ وَلَا يَنَالُونَ مِنْ عَدُوٍّ نَيْلًا إِلَّا كُتِبَ لَهُمْ بِهِ عَمَلٌ صَالِحٌ ۚ إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ",
      "verseStringB": "It is not for the inhabitants of Medina and the Nomadic-Arabs around them to stay behind Allah’s Messenger, nor to prefer themselves to him. That is because they suffer no thirst, nor fatigue, nor hunger in the way of Allah, nor do they take one step that enrages the disbelievers, nor do they receive anything from an enemy, but it is recorded to their credit as a righteous deed. Allah does not waste the reward of the good-doers."
    },
    {
      "verseNumber": 121,
      "verseString": "وَلَا يُنْفِقُونَ نَفَقَةً صَغِيرَةً وَلَا كَبِيرَةً وَلَا يَقْطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمْ لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "Nor do they spend an expenditure, small or large, nor do they cross any valley, but it is recorded for them. So that Allah may reward them in accordance with the best of their deeds."
    },
    {
      "verseNumber": 122,
      "verseString": "وَمَا كَانَ الْمُؤْمِنُونَ لِيَنْفِرُوا كَافَّةً ۚ فَلَوْلَا نَفَرَ مِنْ كُلِّ فِرْقَةٍ مِنْهُمْ طَائِفَةٌ لِيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنْذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ",
      "verseStringB": "It is not advisable for the believers to march out altogether. Of every division that marches out, let a group remain behind, to gain understanding in religion, and to notify their people when they have returned to them, so they may beware."
    },
    {
      "verseNumber": 123,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا قَاتِلُوا الَّذِينَ يَلُونَكُمْ مِنَ الْكُفَّارِ وَلْيَجِدُوا فِيكُمْ غِلْظَةً ۚ وَاعْلَمُوا أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ",
      "verseStringB": "O you who believe! Fight those of the disbelievers who attack you, and let them find severity in you. And know that Allah is with the reverent."
    },
    {
      "verseNumber": 124,
      "verseString": "وَإِذَا مَا أُنْزِلَتْ سُورَةٌ فَمِنْهُمْ مَنْ يَقُولُ أَيُّكُمْ زَادَتْهُ هَٰذِهِ إِيمَانًا ۚ فَأَمَّا الَّذِينَ آمَنُوا فَزَادَتْهُمْ إِيمَانًا وَهُمْ يَسْتَبْشِرُونَ",
      "verseStringB": "And whenever a chapter is revealed, some of them say, “Which of you has this increased in faith?” As for those who believe: it increases them in faith, and they rejoice."
    },
    {
      "verseNumber": 125,
      "verseString": "وَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ فَزَادَتْهُمْ رِجْسًا إِلَىٰ رِجْسِهِمْ وَمَاتُوا وَهُمْ كَافِرُونَ",
      "verseStringB": "But as for those in whose hearts is sickness: it adds disgrace to their disgrace, and they die while they are unbelievers."
    },
    {
      "verseNumber": 126,
      "verseString": "أَوَلَا يَرَوْنَ أَنَّهُمْ يُفْتَنُونَ فِي كُلِّ عَامٍ مَرَّةً أَوْ مَرَّتَيْنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمْ يَذَّكَّرُونَ",
      "verseStringB": "Do they not realize that they are tested every year, once or twice? But they do not repent, nor do they learn."
    },
    {
      "verseNumber": 127,
      "verseString": "وَإِذَا مَا أُنْزِلَتْ سُورَةٌ نَظَرَ بَعْضُهُمْ إِلَىٰ بَعْضٍ هَلْ يَرَاكُمْ مِنْ أَحَدٍ ثُمَّ انْصَرَفُوا ۚ صَرَفَ اللَّهُ قُلُوبَهُمْ بِأَنَّهُمْ قَوْمٌ لَا يَفْقَهُونَ",
      "verseStringB": "And whenever a chapter is revealed, they look at one another, “Does anyone see you?” Then they slip away. Allah has diverted their hearts, because they are a people who do not understand."
    },
    {
      "verseNumber": 128,
      "verseString": "لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُمْ بِالْمُؤْمِنِينَ رَءُوفٌ رَحِيمٌ",
      "verseStringB": "There has come to you a messenger from among yourselves, concerned over your suffering, anxious over your well-being. Kind and merciful towards the believers."
    },
    {
      "verseNumber": 129,
      "verseString": "فَإِنْ تَوَلَّوْا فَقُلْ حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
      "verseStringB": "If they turn away, say, “Allah is enough for me. There is no god except He. In Him I trust. And He is the Lord of the Magnificent Throne.”"
    }
  ],
  "nameEnglish": "Repentance",
  "nameTrans": "at-Tawbah",
  "nameArabic": "التوبة",
  "chapterNumber": 9,
  "nVerses": 129
}