{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "المر ۚ تِلْكَ آيَاتُ الْكِتَابِ ۗ وَالَّذِي أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ الْحَقُّ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ",
      "verseStringB": "Alif. Lam. Meem. Ra. These are the signs of the Book. What is revealed to you from your Lord is the truth, but most people do not believe."
    },
    {
      "verseNumber": 2,
      "verseString": "اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُسَمًّى ۚ يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ لَعَلَّكُمْ بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ",
      "verseStringB": "Allah is He who raised the heavens without pillars that you see, then settled on the Throne. He regulated the sun and the moon, each orbiting until an appointed time. He governs the affair, and He explains the messages, so that you may be certain of the meeting with your Lord."
    },
    {
      "verseNumber": 3,
      "verseString": "وَهُوَ الَّذِي مَدَّ الْأَرْضَ وَجَعَلَ فِيهَا رَوَاسِيَ وَأَنْهَارًا ۖ وَمِنْ كُلِّ الثَّمَرَاتِ جَعَلَ فِيهَا زَوْجَيْنِ اثْنَيْنِ ۖ يُغْشِي اللَّيْلَ النَّهَارَ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ",
      "verseStringB": "And it is He who spread the earth, and placed mountains and rivers upon it. And of every kind of fruit, He placed in it two kinds. He makes the night overlap the day. In this are signs for people who think."
    },
    {
      "verseNumber": 4,
      "verseString": "وَفِي الْأَرْضِ قِطَعٌ مُتَجَاوِرَاتٌ وَجَنَّاتٌ مِنْ أَعْنَابٍ وَزَرْعٌ وَنَخِيلٌ صِنْوَانٌ وَغَيْرُ صِنْوَانٍ يُسْقَىٰ بِمَاءٍ وَاحِدٍ وَنُفَضِّلُ بَعْضَهَا عَلَىٰ بَعْضٍ فِي الْأُكُلِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ",
      "verseStringB": "And on earth are adjacent terrains, and gardens of grapes, and crops, and date-palms, from a shared root or from distinct roots, irrigated with the same water. And We make some better tasting than others. In this are proofs for people who reason."
    },
    {
      "verseNumber": 5,
      "verseString": "وَإِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ أَإِذَا كُنَّا تُرَابًا أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ ۗ أُولَٰئِكَ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ وَأُولَٰئِكَ الْأَغْلَالُ فِي أَعْنَاقِهِمْ ۖ وَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ",
      "verseStringB": "Should you wonder—wondrous is their saying: “When we have become dust, will we be in a new creation?” It is they who disbelieved in their Lord; it is they who will have shackles around their necks; it is they who are the inhabitants of the Fire, where they will remain forever."
    },
    {
      "verseNumber": 6,
      "verseString": "وَيَسْتَعْجِلُونَكَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ وَقَدْ خَلَتْ مِنْ قَبْلِهِمُ الْمَثُلَاتُ ۗ وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِلنَّاسِ عَلَىٰ ظُلْمِهِمْ ۖ وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ",
      "verseStringB": "And they challenge you to hasten evil before good, although examples have passed before them. Your Lord is full of forgiveness towards people for their wrongdoing, yet your Lord is severe in retribution."
    },
    {
      "verseNumber": 7,
      "verseString": "وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ ۗ إِنَّمَا أَنْتَ مُنْذِرٌ ۖ وَلِكُلِّ قَوْمٍ هَادٍ",
      "verseStringB": "Those who disbelieve say, “If only a miracle could be sent down to him from his Lord.” You are only a warner; and for every community, there is a guide."
    },
    {
      "verseNumber": 8,
      "verseString": "اللَّهُ يَعْلَمُ مَا تَحْمِلُ كُلُّ أُنْثَىٰ وَمَا تَغِيضُ الْأَرْحَامُ وَمَا تَزْدَادُ ۖ وَكُلُّ شَيْءٍ عِنْدَهُ بِمِقْدَارٍ",
      "verseStringB": "Allah knows what every female carries, and what increases and decreases in the wombs. Everything with Him is according to a measure."
    },
    {
      "verseNumber": 9,
      "verseString": "عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْكَبِيرُ الْمُتَعَالِ",
      "verseStringB": "The Knower of the Invisible and the Visible—the Grand, the Exalted."
    },
    {
      "verseNumber": 10,
      "verseString": "سَوَاءٌ مِنْكُمْ مَنْ أَسَرَّ الْقَوْلَ وَمَنْ جَهَرَ بِهِ وَمَنْ هُوَ مُسْتَخْفٍ بِاللَّيْلِ وَسَارِبٌ بِالنَّهَارِ",
      "verseStringB": "It is the same; whether one of you conceals his speech, or declares it; whether he goes into hiding by night, or goes out by day."
    },
    {
      "verseNumber": 11,
      "verseString": "لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ ۗ إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنْفُسِهِمْ ۗ وَإِذَا أَرَادَ اللَّهُ بِقَوْمٍ سُوءًا فَلَا مَرَدَّ لَهُ ۚ وَمَا لَهُمْ مِنْ دُونِهِ مِنْ وَالٍ",
      "verseStringB": "He has a succession—in front of him, and behind him—protecting him by Allah’s command. Allah does not change the condition of a people until they change what is within themselves. And if Allah wills any hardship for a people, there is no repelling it. And apart from Him, they have no protector."
    },
    {
      "verseNumber": 12,
      "verseString": "هُوَ الَّذِي يُرِيكُمُ الْبَرْقَ خَوْفًا وَطَمَعًا وَيُنْشِئُ السَّحَابَ الثِّقَالَ",
      "verseStringB": "It is He who shows you the lightning, causing fear and hope. And He produces the heavy clouds."
    },
    {
      "verseNumber": 13,
      "verseString": "وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ وَيُرْسِلُ الصَّوَاعِقَ فَيُصِيبُ بِهَا مَنْ يَشَاءُ وَهُمْ يُجَادِلُونَ فِي اللَّهِ وَهُوَ شَدِيدُ الْمِحَالِ",
      "verseStringB": "The thunder praises His glory, as do the angels in awe of Him. And He sends thunderbolts, striking with them whom He wills. Yet they argue about Allah, while He is Tremendous in might."
    },
    {
      "verseNumber": 14,
      "verseString": "لَهُ دَعْوَةُ الْحَقِّ ۖ وَالَّذِينَ يَدْعُونَ مِنْ دُونِهِ لَا يَسْتَجِيبُونَ لَهُمْ بِشَيْءٍ إِلَّا كَبَاسِطِ كَفَّيْهِ إِلَى الْمَاءِ لِيَبْلُغَ فَاهُ وَمَا هُوَ بِبَالِغِهِ ۚ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ",
      "verseStringB": "To Him is the call of truth. Those they call upon below Him never respond to them with anything—except as someone who stretches his hands towards the water, so it may reach his mouth, but it does not reach it. The prayers of the unbelievers are only in vain."
    },
    {
      "verseNumber": 15,
      "verseString": "وَلِلَّهِ يَسْجُدُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُمْ بِالْغُدُوِّ وَالْآصَالِ ۩",
      "verseStringB": "To Allah prostrates everyone in the heavens and the earth, willingly or unwillingly, as do their shadows, in the mornings and the evenings."
    },
    {
      "verseNumber": 16,
      "verseString": "قُلْ مَنْ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ قُلِ اللَّهُ ۚ قُلْ أَفَاتَّخَذْتُمْ مِنْ دُونِهِ أَوْلِيَاءَ لَا يَمْلِكُونَ لِأَنْفُسِهِمْ نَفْعًا وَلَا ضَرًّا ۚ قُلْ هَلْ يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ أَمْ هَلْ تَسْتَوِي الظُّلُمَاتُ وَالنُّورُ ۗ أَمْ جَعَلُوا لِلَّهِ شُرَكَاءَ خَلَقُوا كَخَلْقِهِ فَتَشَابَهَ الْخَلْقُ عَلَيْهِمْ ۚ قُلِ اللَّهُ خَالِقُ كُلِّ شَيْءٍ وَهُوَ الْوَاحِدُ الْقَهَّارُ",
      "verseStringB": "Say, “Who is Lord of the heavens and the earth?” Say, “Allah.” Say, “Have you taken besides Him lords who can neither benefit nor harm themselves?” Say, “Are the blind and the seeing equal? Or are darkness and light equal? Or do they assign to Allah associates, who created the likes of His creation, so that creations seem alike to them?” Say, “Allah is the Creator of all things, and He is The One, the Irresistible.”"
    },
    {
      "verseNumber": 17,
      "verseString": "أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا فَاحْتَمَلَ السَّيْلُ زَبَدًا رَابِيًا ۚ وَمِمَّا يُوقِدُونَ عَلَيْهِ فِي النَّارِ ابْتِغَاءَ حِلْيَةٍ أَوْ مَتَاعٍ زَبَدٌ مِثْلُهُ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْحَقَّ وَالْبَاطِلَ ۚ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً ۖ وَأَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ",
      "verseStringB": "He sends down water from the sky, and riverbeds flow according to their capacity. The current carries swelling foam. And from what they heat in the fire of ornaments or tools comes a similar foam. Thus Allah exemplifies truth and falsehood. As for the foam, it is swept away, but what benefits people remains in the ground. Thus Allah presents the analogies."
    },
    {
      "verseNumber": 18,
      "verseString": "لِلَّذِينَ اسْتَجَابُوا لِرَبِّهِمُ الْحُسْنَىٰ ۚ وَالَّذِينَ لَمْ يَسْتَجِيبُوا لَهُ لَوْ أَنَّ لَهُمْ مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ ۚ أُولَٰئِكَ لَهُمْ سُوءُ الْحِسَابِ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمِهَادُ",
      "verseStringB": "For those who respond to their Lord, is the best. But as for those who do not respond to Him, even if they possessed everything on earth, and twice as much, they could not redeem themselves with it. These will have the worst reckoning, and their housing is Hell—a miserable place."
    },
    {
      "verseNumber": 19,
      "verseString": "أَفَمَنْ يَعْلَمُ أَنَّمَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ الْحَقُّ كَمَنْ هُوَ أَعْمَىٰ ۚ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ",
      "verseStringB": "Is someone who knows that what was revealed to you from your Lord is the truth, like someone who is blind? Only those who possess intellect reflect."
    },
    {
      "verseNumber": 20,
      "verseString": "الَّذِينَ يُوفُونَ بِعَهْدِ اللَّهِ وَلَا يَنْقُضُونَ الْمِيثَاقَ",
      "verseStringB": "Those who fulfill the promise to Allah, and do not violate the agreement."
    },
    {
      "verseNumber": 21,
      "verseString": "وَالَّذِينَ يَصِلُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوءَ الْحِسَابِ",
      "verseStringB": "And those who join what Allah has commanded to be joined, and fear their Lord, and dread the dire reckoning."
    },
    {
      "verseNumber": 22,
      "verseString": "وَالَّذِينَ صَبَرُوا ابْتِغَاءَ وَجْهِ رَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَنْفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ أُولَٰئِكَ لَهُمْ عُقْبَى الدَّارِ",
      "verseStringB": "And those who patiently seek their Lord’s attention, and pray regularly, and donate from what We have provided for them—secretly and openly—and repel evil with good. For them, there is the Ultimate Home."
    },
    {
      "verseNumber": 23,
      "verseString": "جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا وَمَنْ صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ ۖ وَالْمَلَائِكَةُ يَدْخُلُونَ عَلَيْهِمْ مِنْ كُلِّ بَابٍ",
      "verseStringB": "Everlasting Gardens, which they will enter, along with the righteous from among their parents, and their spouses, and their descendants. And the angels will enter upon them from every gate."
    },
    {
      "verseNumber": 24,
      "verseString": "سَلَامٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ ۚ فَنِعْمَ عُقْبَى الدَّارِ",
      "verseStringB": "“Peace be upon you—because you were patient. How excellent is the Final Home.”"
    },
    {
      "verseNumber": 25,
      "verseString": "وَالَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ ۙ أُولَٰئِكَ لَهُمُ اللَّعْنَةُ وَلَهُمْ سُوءُ الدَّارِ",
      "verseStringB": "As for those who violate the promise to Allah, after pledging to keep it, and sever what Allah has commanded to be joined, and work corruption on earth: it is they who will have the curse, and theirs is the Worst Home."
    },
    {
      "verseNumber": 26,
      "verseString": "اللَّهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ وَفَرِحُوا بِالْحَيَاةِ الدُّنْيَا وَمَا الْحَيَاةُ الدُّنْيَا فِي الْآخِرَةِ إِلَّا مَتَاعٌ",
      "verseStringB": "Allah dispenses the sustenance to whomever He wills—and restricts. And they delight in the worldly life. Yet the worldly life, compared to the Hereafter, is nothing but enjoyment."
    },
    {
      "verseNumber": 27,
      "verseString": "وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ ۗ قُلْ إِنَّ اللَّهَ يُضِلُّ مَنْ يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ أَنَابَ",
      "verseStringB": "Those who disbelieve say, “Why a miracle was not sent down to him from his Lord.” Say, “Allah leads astray whom He wills, and He guides to Himself whoever turns in repentance.”"
    },
    {
      "verseNumber": 28,
      "verseString": "الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
      "verseStringB": "Those who believe, and whose hearts find comfort in the remembrance of Allah. Surely, it is in Allah’s remembrance that hearts find comfort.”"
    },
    {
      "verseNumber": 29,
      "verseString": "الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ طُوبَىٰ لَهُمْ وَحُسْنُ مَآبٍ",
      "verseStringB": "For those who believe and do good works: for them is happiness and a beautiful return."
    },
    {
      "verseNumber": 30,
      "verseString": "كَذَٰلِكَ أَرْسَلْنَاكَ فِي أُمَّةٍ قَدْ خَلَتْ مِنْ قَبْلِهَا أُمَمٌ لِتَتْلُوَ عَلَيْهِمُ الَّذِي أَوْحَيْنَا إِلَيْكَ وَهُمْ يَكْفُرُونَ بِالرَّحْمَٰنِ ۚ قُلْ هُوَ رَبِّي لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ مَتَابِ",
      "verseStringB": "Thus We sent you into a community before whom other communities have passed away, so that you may relate to them what We revealed to you. Yet they deny the Benevolent. Say, “He is my Lord; there is no god except He; in Him I trust, and to Him is my repentance.”"
    },
    {
      "verseNumber": 31,
      "verseString": "وَلَوْ أَنَّ قُرْآنًا سُيِّرَتْ بِهِ الْجِبَالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ أَوْ كُلِّمَ بِهِ الْمَوْتَىٰ ۗ بَلْ لِلَّهِ الْأَمْرُ جَمِيعًا ۗ أَفَلَمْ يَيْأَسِ الَّذِينَ آمَنُوا أَنْ لَوْ يَشَاءُ اللَّهُ لَهَدَى النَّاسَ جَمِيعًا ۗ وَلَا يَزَالُ الَّذِينَ كَفَرُوا تُصِيبُهُمْ بِمَا صَنَعُوا قَارِعَةٌ أَوْ تَحُلُّ قَرِيبًا مِنْ دَارِهِمْ حَتَّىٰ يَأْتِيَ وَعْدُ اللَّهِ ۚ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ",
      "verseStringB": "Even if there were a Quran, by which mountains could be set in motion, or by which the earth could be shattered, or by which the dead could be made to speak. In fact, every decision rests with Allah. Did the believers not give up, and realize, that had Allah willed, He would have guided all humanity? Disasters will continue to strike those who disbelieve—because of their deeds—or they fall close to their homes: until Allah’s promise comes true. Allah never breaks a promise."
    },
    {
      "verseNumber": 32,
      "verseString": "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِنْ قَبْلِكَ فَأَمْلَيْتُ لِلَّذِينَ كَفَرُوا ثُمَّ أَخَذْتُهُمْ ۖ فَكَيْفَ كَانَ عِقَابِ",
      "verseStringB": "Messengers before you were ridiculed, but I delayed the disbelievers, and then I seized them. What a retribution it was!"
    },
    {
      "verseNumber": 33,
      "verseString": "أَفَمَنْ هُوَ قَائِمٌ عَلَىٰ كُلِّ نَفْسٍ بِمَا كَسَبَتْ ۗ وَجَعَلُوا لِلَّهِ شُرَكَاءَ قُلْ سَمُّوهُمْ ۚ أَمْ تُنَبِّئُونَهُ بِمَا لَا يَعْلَمُ فِي الْأَرْضِ أَمْ بِظَاهِرٍ مِنَ الْقَوْلِ ۗ بَلْ زُيِّنَ لِلَّذِينَ كَفَرُوا مَكْرُهُمْ وَصُدُّوا عَنِ السَّبِيلِ ۗ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ",
      "verseStringB": "What of He who is Vigilant over the deeds of every soul? Yet they ascribe associates to Allah. Say, “Name them! Or are you informing Him of something He does not know on earth? Or is it a display of words?” In fact, the scheming of those who disbelieve is made appealing to them, and they are diverted from the path. Whomever Allah misguides has no guide."
    },
    {
      "verseNumber": 34,
      "verseString": "لَهُمْ عَذَابٌ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَشَقُّ ۖ وَمَا لَهُمْ مِنَ اللَّهِ مِنْ وَاقٍ",
      "verseStringB": "For them is agony in the worldly life, but the agony of the Hereafter is harsher. And they have no defender against Allah."
    },
    {
      "verseNumber": 35,
      "verseString": "مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ أُكُلُهَا دَائِمٌ وَظِلُّهَا ۚ تِلْكَ عُقْبَى الَّذِينَ اتَّقَوْا ۖ وَعُقْبَى الْكَافِرِينَ النَّارُ",
      "verseStringB": "The parable of the Garden promised to the righteous: rivers flowing beneath it; its food is everlasting, as is its shade. That is the outcome for those who guard. But the outcome for the unbelievers is the Fire."
    },
    {
      "verseNumber": 36,
      "verseString": "وَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَفْرَحُونَ بِمَا أُنْزِلَ إِلَيْكَ ۖ وَمِنَ الْأَحْزَابِ مَنْ يُنْكِرُ بَعْضَهُ ۚ قُلْ إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ وَلَا أُشْرِكَ بِهِ ۚ إِلَيْهِ أَدْعُو وَإِلَيْهِ مَآبِ",
      "verseStringB": "Those to whom We gave the Scripture rejoice in what was revealed to you, while some factions reject parts of it. Say, “I am commanded to worship Allah, and to not ascribe partners to Him. To Him I invite, and to Him is my return.”"
    },
    {
      "verseNumber": 37,
      "verseString": "وَكَذَٰلِكَ أَنْزَلْنَاهُ حُكْمًا عَرَبِيًّا ۚ وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُمْ بَعْدَمَا جَاءَكَ مِنَ الْعِلْمِ مَا لَكَ مِنَ اللَّهِ مِنْ وَلِيٍّ وَلَا وَاقٍ",
      "verseStringB": "Thus We revealed it an Arabic code of law. Were you to follow their desires, after the knowledge that has come to you, you would have no protector against Allah, and no defender."
    },
    {
      "verseNumber": 38,
      "verseString": "وَلَقَدْ أَرْسَلْنَا رُسُلًا مِنْ قَبْلِكَ وَجَعَلْنَا لَهُمْ أَزْوَاجًا وَذُرِّيَّةً ۚ وَمَا كَانَ لِرَسُولٍ أَنْ يَأْتِيَ بِآيَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ لِكُلِّ أَجَلٍ كِتَابٌ",
      "verseStringB": "We sent messengers before you, and We assigned for them wives and offspring. No messenger could bring a sign without Allah’s permission. For every era is a scripture."
    },
    {
      "verseNumber": 39,
      "verseString": "يَمْحُو اللَّهُ مَا يَشَاءُ وَيُثْبِتُ ۖ وَعِنْدَهُ أُمُّ الْكِتَابِ",
      "verseStringB": "Allah abolishes whatever He wills, and He affirms, and with Him is the source of the Scripture."
    },
    {
      "verseNumber": 40,
      "verseString": "وَإِنْ مَا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيْكَ الْبَلَاغُ وَعَلَيْنَا الْحِسَابُ",
      "verseStringB": "Whether We show you some of what We have promised them, or We cause you to die—your duty is to inform, and judgment is Ours."
    },
    {
      "verseNumber": 41,
      "verseString": "أَوَلَمْ يَرَوْا أَنَّا نَأْتِي الْأَرْضَ نَنْقُصُهَا مِنْ أَطْرَافِهَا ۚ وَاللَّهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهِ ۚ وَهُوَ سَرِيعُ الْحِسَابِ",
      "verseStringB": "Do they not see how We deal with the earth, eroding it at its extremities? Allah decides—none can reverse His decision. And He is quick in settling accounts."
    },
    {
      "verseNumber": 42,
      "verseString": "وَقَدْ مَكَرَ الَّذِينَ مِنْ قَبْلِهِمْ فَلِلَّهِ الْمَكْرُ جَمِيعًا ۖ يَعْلَمُ مَا تَكْسِبُ كُلُّ نَفْسٍ ۗ وَسَيَعْلَمُ الْكُفَّارُ لِمَنْ عُقْبَى الدَّارِ",
      "verseStringB": "Those before them planned, but the entire plan is up to Allah. He knows what every soul commits, and the disbelievers will know to whom the Ultimate Home belongs."
    },
    {
      "verseNumber": 43,
      "verseString": "وَيَقُولُ الَّذِينَ كَفَرُوا لَسْتَ مُرْسَلًا ۚ قُلْ كَفَىٰ بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ وَمَنْ عِنْدَهُ عِلْمُ الْكِتَابِ",
      "verseStringB": "Those who disbelieve say, “You were not sent.” Say, “Allah is a sufficient witness between you and me, as is whoever possesses knowledge of the Scripture.”"
    }
  ],
  "nameEnglish": "Thunder",
  "nameTrans": "ar-Ra'd",
  "nameArabic": "الرعد",
  "chapterNumber": 13,
  "nVerses": 43
}