{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "الر ۚ كِتَابٌ أَنْزَلْنَاهُ إِلَيْكَ لِتُخْرِجَ النَّاسَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِ رَبِّهِمْ إِلَىٰ صِرَاطِ الْعَزِيزِ الْحَمِيدِ",
      "verseStringB": "Alif. Lam. Ra. A Scripture that We revealed to you, so that you may bring people out of the darkness into light—by the will of their Lord—to the path of the Mighty, the Praised."
    },
    {
      "verseNumber": 2,
      "verseString": "اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَوَيْلٌ لِلْكَافِرِينَ مِنْ عَذَابٍ شَدِيدٍ",
      "verseStringB": "Allah—to Whom belongs whatever is in the heavens and whatever is on earth. And woe to the unbelievers from a severe punishment."
    },
    {
      "verseNumber": 3,
      "verseString": "الَّذِينَ يَسْتَحِبُّونَ الْحَيَاةَ الدُّنْيَا عَلَى الْآخِرَةِ وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا ۚ أُولَٰئِكَ فِي ضَلَالٍ بَعِيدٍ",
      "verseStringB": "Those who prefer the present life over the Hereafter, and repel from Allah’s path, and seek to make it crooked—these are far astray."
    },
    {
      "verseNumber": 4,
      "verseString": "وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ ۖ فَيُضِلُّ اللَّهُ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "We sent no messenger except in the language of his people, to make things clear for them. Allah leads astray whom He wills, and He guides whom He wills. He is the Mighty, the Wise."
    },
    {
      "verseNumber": 5,
      "verseString": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا أَنْ أَخْرِجْ قَوْمَكَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ وَذَكِّرْهُمْ بِأَيَّامِ اللَّهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ",
      "verseStringB": "We sent Moses with Our signs: “Bring your people out of darkness into light, and remind them of the Days of Allah.” In this are signs for every patient, thankful person.”"
    },
    {
      "verseNumber": 6,
      "verseString": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ أَنْجَاكُمْ مِنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ وَيُذَبِّحُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ ۚ وَفِي ذَٰلِكُمْ بَلَاءٌ مِنْ رَبِّكُمْ عَظِيمٌ",
      "verseStringB": "Moses said to his people, “Remember Allah’s favors upon you, as He saved you from the people of Pharaoh, who inflicted terrible suffering on you, slaughtering your sons while sparing your women. In that was a severe trial from your Lord.”"
    },
    {
      "verseNumber": 7,
      "verseString": "وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِنْ كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ",
      "verseStringB": "And when your Lord announced: “If you give thanks, I will give you more; but if you are ungrateful, My punishment is severe.”"
    },
    {
      "verseNumber": 8,
      "verseString": "وَقَالَ مُوسَىٰ إِنْ تَكْفُرُوا أَنْتُمْ وَمَنْ فِي الْأَرْضِ جَمِيعًا فَإِنَّ اللَّهَ لَغَنِيٌّ حَمِيدٌ",
      "verseStringB": "And Moses said, “Even if you are ungrateful, together with everyone on earth—Allah is in no need, Praised.”"
    },
    {
      "verseNumber": 9,
      "verseString": "أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ مِنْ قَبْلِكُمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ ۛ وَالَّذِينَ مِنْ بَعْدِهِمْ ۛ لَا يَعْلَمُهُمْ إِلَّا اللَّهُ ۚ جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَرَدُّوا أَيْدِيَهُمْ فِي أَفْوَاهِهِمْ وَقَالُوا إِنَّا كَفَرْنَا بِمَا أُرْسِلْتُمْ بِهِ وَإِنَّا لَفِي شَكٍّ مِمَّا تَدْعُونَنَا إِلَيْهِ مُرِيبٍ",
      "verseStringB": "Has not the story reached you, of those before you: the people of Noah, and Aad, and Thamood, and those after them? None knows them except Allah. Their messengers came to them with clear proofs, but they tried to silence them, and said, “We reject what you are sent with, and we are in serious doubt about what you are calling us to.”"
    },
    {
      "verseNumber": 10,
      "verseString": "قَالَتْ رُسُلُهُمْ أَفِي اللَّهِ شَكٌّ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ ۖ يَدْعُوكُمْ لِيَغْفِرَ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرَكُمْ إِلَىٰ أَجَلٍ مُسَمًّى ۚ قَالُوا إِنْ أَنْتُمْ إِلَّا بَشَرٌ مِثْلُنَا تُرِيدُونَ أَنْ تَصُدُّونَا عَمَّا كَانَ يَعْبُدُ آبَاؤُنَا فَأْتُونَا بِسُلْطَانٍ مُبِينٍ",
      "verseStringB": "Their messengers said, “Can there be any doubt about Allah, Maker of the heavens and the earth? He invites you to forgive you of your sins, and to defer you until an appointed time.” They said, “You are only humans like us; you want to turn us away from what our forefathers served; so bring us some compelling proof.”"
    },
    {
      "verseNumber": 11,
      "verseString": "قَالَتْ لَهُمْ رُسُلُهُمْ إِنْ نَحْنُ إِلَّا بَشَرٌ مِثْلُكُمْ وَلَٰكِنَّ اللَّهَ يَمُنُّ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ ۖ وَمَا كَانَ لَنَا أَنْ نَأْتِيَكُمْ بِسُلْطَانٍ إِلَّا بِإِذْنِ اللَّهِ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
      "verseStringB": "Their messengers said to them, “We are only humans like you, but Allah favors whom He wills from among His servants. We cannot possibly bring you any proof, except with Allah’s permission. And in Allah, let the faithful put their trust.”"
    },
    {
      "verseNumber": 12,
      "verseString": "وَمَا لَنَا أَلَّا نَتَوَكَّلَ عَلَى اللَّهِ وَقَدْ هَدَانَا سُبُلَنَا ۚ وَلَنَصْبِرَنَّ عَلَىٰ مَا آذَيْتُمُونَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ",
      "verseStringB": "“And why should we not trust in Allah, when He has guided us in our ways? We will persevere in the face of your persecution. And upon Allah, the reliant should rely.”"
    },
    {
      "verseNumber": 13,
      "verseString": "وَقَالَ الَّذِينَ كَفَرُوا لِرُسُلِهِمْ لَنُخْرِجَنَّكُمْ مِنْ أَرْضِنَا أَوْ لَتَعُودُنَّ فِي مِلَّتِنَا ۖ فَأَوْحَىٰ إِلَيْهِمْ رَبُّهُمْ لَنُهْلِكَنَّ الظَّالِمِينَ",
      "verseStringB": "Those who disbelieved said to their messengers, “We will expel you from our land—unless you return to our faith.” And their Lord inspired them: “We will destroy the wrongdoers.”"
    },
    {
      "verseNumber": 14,
      "verseString": "وَلَنُسْكِنَنَّكُمُ الْأَرْضَ مِنْ بَعْدِهِمْ ۚ ذَٰلِكَ لِمَنْ خَافَ مَقَامِي وَخَافَ وَعِيدِ",
      "verseStringB": "“And We will settle you in the land after them. This is for whoever fears My Majesty and fears My warnings.”"
    },
    {
      "verseNumber": 15,
      "verseString": "وَاسْتَفْتَحُوا وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ",
      "verseStringB": "And they asked for victory, and every stubborn tyrant came to disappointment."
    },
    {
      "verseNumber": 16,
      "verseString": "مِنْ وَرَائِهِ جَهَنَّمُ وَيُسْقَىٰ مِنْ مَاءٍ صَدِيدٍ",
      "verseStringB": "Beyond him lies Hell, and he will be made to drink putrid water."
    },
    {
      "verseNumber": 17,
      "verseString": "يَتَجَرَّعُهُ وَلَا يَكَادُ يُسِيغُهُ وَيَأْتِيهِ الْمَوْتُ مِنْ كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ ۖ وَمِنْ وَرَائِهِ عَذَابٌ غَلِيظٌ",
      "verseStringB": "He will guzzle it, but he will not swallow it. And death will come at him from every direction, but he will not die. And beyond this lies intense suffering."
    },
    {
      "verseNumber": 18,
      "verseString": "مَثَلُ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ أَعْمَالُهُمْ كَرَمَادٍ اشْتَدَّتْ بِهِ الرِّيحُ فِي يَوْمٍ عَاصِفٍ ۖ لَا يَقْدِرُونَ مِمَّا كَسَبُوا عَلَىٰ شَيْءٍ ۚ ذَٰلِكَ هُوَ الضَّلَالُ الْبَعِيدُ",
      "verseStringB": "The parable of those who disbelieve in their Lord: their works are as ashes, in a fierce wind, on a stormy day. They have no control over anything they have gained. That is the utmost misguidance."
    },
    {
      "verseNumber": 19,
      "verseString": "أَلَمْ تَرَ أَنَّ اللَّهَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۚ إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ",
      "verseStringB": "Do you not see that Allah created the heavens and the earth with truth? If He wills, He can eliminate you, and produce a new creation."
    },
    {
      "verseNumber": 20,
      "verseString": "وَمَا ذَٰلِكَ عَلَى اللَّهِ بِعَزِيزٍ",
      "verseStringB": "And that is not difficult for Allah."
    },
    {
      "verseNumber": 21,
      "verseString": "وَبَرَزُوا لِلَّهِ جَمِيعًا فَقَالَ الضُّعَفَاءُ لِلَّذِينَ اسْتَكْبَرُوا إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنْتُمْ مُغْنُونَ عَنَّا مِنْ عَذَابِ اللَّهِ مِنْ شَيْءٍ ۚ قَالُوا لَوْ هَدَانَا اللَّهُ لَهَدَيْنَاكُمْ ۖ سَوَاءٌ عَلَيْنَا أَجَزِعْنَا أَمْ صَبَرْنَا مَا لَنَا مِنْ مَحِيصٍ",
      "verseStringB": "And they will emerge before Allah, all together. The weak will say to those who were proud, “We were your followers, so can you protect us from Allah’s punishment in any way?” They will say, “Had Allah guided us, we would have guided you. It is the same for us; whether we mourn, or endure patiently; for us, there is no asylum.”"
    },
    {
      "verseNumber": 22,
      "verseString": "وَقَالَ الشَّيْطَانُ لَمَّا قُضِيَ الْأَمْرُ إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدْتُكُمْ فَأَخْلَفْتُكُمْ ۖ وَمَا كَانَ لِيَ عَلَيْكُمْ مِنْ سُلْطَانٍ إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي ۖ فَلَا تَلُومُونِي وَلُومُوا أَنْفُسَكُمْ ۖ مَا أَنَا بِمُصْرِخِكُمْ وَمَا أَنْتُمْ بِمُصْرِخِيَّ ۖ إِنِّي كَفَرْتُ بِمَا أَشْرَكْتُمُونِ مِنْ قَبْلُ ۗ إِنَّ الظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "And Satan will say, when judgment is passed, “Allah has promised you the promise of truth; and I promised you, but I failed you. I had no authority over you, except that I called you, and you responded to me. So do not blame me, but blame yourselves. I cannot respond to your cries, nor can you respond to my cries. I denounce your previous association of me. The wrongdoers will have a painful punishment.”"
    },
    {
      "verseNumber": 23,
      "verseString": "وَأُدْخِلَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ ۖ تَحِيَّتُهُمْ فِيهَا سَلَامٌ",
      "verseStringB": "But those who believe and do righteous deeds will be admitted into gardens beneath which rivers flow, to remain there forever, with their Lord's permission. Their greeting there will be: “Peace.”"
    },
    {
      "verseNumber": 24,
      "verseString": "أَلَمْ تَرَ كَيْفَ ضَرَبَ اللَّهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَفَرْعُهَا فِي السَّمَاءِ",
      "verseStringB": "Do you not see how Allah presents a parable? A good word is like a good tree: its root is firm, and its branches are in the sky."
    },
    {
      "verseNumber": 25,
      "verseString": "تُؤْتِي أُكُلَهَا كُلَّ حِينٍ بِإِذْنِ رَبِّهَا ۗ وَيَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "verseStringB": "It yields its fruit every season, by the will of its Lord. Allah presents the parables to the people, so that they may reflect."
    },
    {
      "verseNumber": 26,
      "verseString": "وَمَثَلُ كَلِمَةٍ خَبِيثَةٍ كَشَجَرَةٍ خَبِيثَةٍ اجْتُثَّتْ مِنْ فَوْقِ الْأَرْضِ مَا لَهَا مِنْ قَرَارٍ",
      "verseStringB": "And the parable of a bad word is that of a bad tree: it is uprooted from the ground; it has no stability."
    },
    {
      "verseNumber": 27,
      "verseString": "يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ ۖ وَيُضِلُّ اللَّهُ الظَّالِمِينَ ۚ وَيَفْعَلُ اللَّهُ مَا يَشَاءُ",
      "verseStringB": "Allah gives firmness to those who believe, with the firm word, in this life, and in the Hereafter. And Allah leads the unjust astray. And Allah does whatever He wills."
    },
    {
      "verseNumber": 28,
      "verseString": "أَلَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا نِعْمَتَ اللَّهِ كُفْرًا وَأَحَلُّوا قَوْمَهُمْ دَارَ الْبَوَارِ",
      "verseStringB": "Have you not seen those who exchange Allah’s blessings with blasphemy, and land their people into the house of perdition?"
    },
    {
      "verseNumber": 29,
      "verseString": "جَهَنَّمَ يَصْلَوْنَهَا ۖ وَبِئْسَ الْقَرَارُ",
      "verseStringB": "Hell—they will roast in it—what a miserable settlement."
    },
    {
      "verseNumber": 30,
      "verseString": "وَجَعَلُوا لِلَّهِ أَنْدَادًا لِيُضِلُّوا عَنْ سَبِيلِهِ ۗ قُلْ تَمَتَّعُوا فَإِنَّ مَصِيرَكُمْ إِلَى النَّارِ",
      "verseStringB": "And they set up rivals to Allah, to lead away from His Way. Say, “Enjoy yourselves! Your destination is the Fire.”"
    },
    {
      "verseNumber": 31,
      "verseString": "قُلْ لِعِبَادِيَ الَّذِينَ آمَنُوا يُقِيمُوا الصَّلَاةَ وَيُنْفِقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لَا بَيْعٌ فِيهِ وَلَا خِلَالٌ",
      "verseStringB": "Tell My servants who have believed to perform the prayers, and to donate from what We have provided for them—secretly and publicly—before a Day comes in which there is neither bargaining nor friendship."
    },
    {
      "verseNumber": 32,
      "verseString": "اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَكُمْ ۖ وَسَخَّرَ لَكُمُ الْفُلْكَ لِتَجْرِيَ فِي الْبَحْرِ بِأَمْرِهِ ۖ وَسَخَّرَ لَكُمُ الْأَنْهَارَ",
      "verseStringB": "Allah is He Who created the heavens and the earth, and sent down water from the sky, causing fruits to grow for your sustenance. And He committed the ships to your service, sailing through the sea by His command, and He committed the rivers to your service."
    },
    {
      "verseNumber": 33,
      "verseString": "وَسَخَّرَ لَكُمُ الشَّمْسَ وَالْقَمَرَ دَائِبَيْنِ ۖ وَسَخَّرَ لَكُمُ اللَّيْلَ وَالنَّهَارَ",
      "verseStringB": "And He committed the sun and the moon to your service, continuously, and He committed the night and the day to your service."
    },
    {
      "verseNumber": 34,
      "verseString": "وَآتَاكُمْ مِنْ كُلِّ مَا سَأَلْتُمُوهُ ۚ وَإِنْ تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ الْإِنْسَانَ لَظَلُومٌ كَفَّارٌ",
      "verseStringB": "And He has given you something of all what you asked. And if you were to count Allah’s blessings, you could not enumerate them. The human being is unfair and ungrateful."
    },
    {
      "verseNumber": 35,
      "verseString": "وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ",
      "verseStringB": "And recall that Abraham said, “O my Lord, make this land secure, and keep me and my children from worshiping idols.”"
    },
    {
      "verseNumber": 36,
      "verseString": "رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِنَ النَّاسِ ۖ فَمَنْ تَبِعَنِي فَإِنَّهُ مِنِّي ۖ وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَحِيمٌ",
      "verseStringB": "“My Lord, they have led many people astray. Whoever follows me, he is of me. And whoever disobeys me—You are Forgiving and Merciful."
    },
    {
      "verseNumber": 37,
      "verseString": "رَبَّنَا إِنِّي أَسْكَنْتُ مِنْ ذُرِّيَّتِي بِوَادٍ غَيْرِ ذِي زَرْعٍ عِنْدَ بَيْتِكَ الْمُحَرَّمِ رَبَّنَا لِيُقِيمُوا الصَّلَاةَ فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ وَارْزُقْهُمْ مِنَ الثَّمَرَاتِ لَعَلَّهُمْ يَشْكُرُونَ",
      "verseStringB": "“Our Lord, I have settled some of my descendants in a valley of no vegetation, by Your Sacred House, our Lord, so that they may perform the prayers. So make some people's hearts incline towards them, and provide them with fruits, so that they may give thanks.”"
    },
    {
      "verseNumber": 38,
      "verseString": "رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ ۗ وَمَا يَخْفَىٰ عَلَى اللَّهِ مِنْ شَيْءٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ",
      "verseStringB": "“Our Lord, You know what we hide and what we disclose. And nothing is hidden from Allah, on earth or in the heaven.”"
    },
    {
      "verseNumber": 39,
      "verseString": "الْحَمْدُ لِلَّهِ الَّذِي وَهَبَ لِي عَلَى الْكِبَرِ إِسْمَاعِيلَ وَإِسْحَاقَ ۚ إِنَّ رَبِّي لَسَمِيعُ الدُّعَاءِ",
      "verseStringB": "“Praise be to Allah, Who has given me, in my old age, Ishmael and Isaac. My Lord is the Hearer of Prayers.”"
    },
    {
      "verseNumber": 40,
      "verseString": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
      "verseStringB": "“My Lord, make me a performer of prayer, and of my descendants. Our Lord, accept my prayers.”"
    },
    {
      "verseNumber": 41,
      "verseString": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
      "verseStringB": "“Our Lord, forgive me, and my parents, and the believers, on the Day the Reckoning takes place.”"
    },
    {
      "verseNumber": 42,
      "verseString": "وَلَا تَحْسَبَنَّ اللَّهَ غَافِلًا عَمَّا يَعْمَلُ الظَّالِمُونَ ۚ إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الْأَبْصَارُ",
      "verseStringB": "Do not ever think that Allah is unaware of what the wrongdoers do. He only postpones them until a Day when the sights stare."
    },
    {
      "verseNumber": 43,
      "verseString": "مُهْطِعِينَ مُقْنِعِي رُءُوسِهِمْ لَا يَرْتَدُّ إِلَيْهِمْ طَرْفُهُمْ ۖ وَأَفْئِدَتُهُمْ هَوَاءٌ",
      "verseStringB": "Their necks outstretched, their heads upraised, their gaze unblinking, their hearts void."
    },
    {
      "verseNumber": 44,
      "verseString": "وَأَنْذِرِ النَّاسَ يَوْمَ يَأْتِيهِمُ الْعَذَابُ فَيَقُولُ الَّذِينَ ظَلَمُوا رَبَّنَا أَخِّرْنَا إِلَىٰ أَجَلٍ قَرِيبٍ نُجِبْ دَعْوَتَكَ وَنَتَّبِعِ الرُّسُلَ ۗ أَوَلَمْ تَكُونُوا أَقْسَمْتُمْ مِنْ قَبْلُ مَا لَكُمْ مِنْ زَوَالٍ",
      "verseStringB": "And warn the people of the Day when the punishment will come upon them, and those who did wrong will say, “Our Lord, delay us for a little while, and we will answer Your call, and follow the messengers.” Did you not swear before, that there would be no end for you?"
    },
    {
      "verseNumber": 45,
      "verseString": "وَسَكَنْتُمْ فِي مَسَاكِنِ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ وَتَبَيَّنَ لَكُمْ كَيْفَ فَعَلْنَا بِهِمْ وَضَرَبْنَا لَكُمُ الْأَمْثَالَ",
      "verseStringB": "And you inhabited the homes of those who wronged themselves, and it became clear to you how We dealt with them, and We presented for you the parables."
    },
    {
      "verseNumber": 46,
      "verseString": "وَقَدْ مَكَرُوا مَكْرَهُمْ وَعِنْدَ اللَّهِ مَكْرُهُمْ وَإِنْ كَانَ مَكْرُهُمْ لِتَزُولَ مِنْهُ الْجِبَالُ",
      "verseStringB": "And they planned their plan, but their plan is with Allah, even if their plan can eliminate mountains."
    },
    {
      "verseNumber": 47,
      "verseString": "فَلَا تَحْسَبَنَّ اللَّهَ مُخْلِفَ وَعْدِهِ رُسُلَهُ ۗ إِنَّ اللَّهَ عَزِيزٌ ذُو انْتِقَامٍ",
      "verseStringB": "Never think that Allah will break His promise to His messengers. Allah is Strong, Revengeful."
    },
    {
      "verseNumber": 48,
      "verseString": "يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَالسَّمَاوَاتُ ۖ وَبَرَزُوا لِلَّهِ الْوَاحِدِ الْقَهَّارِ",
      "verseStringB": "On the Day when the earth is changed into another earth—and the heavens—and they will emerge before Allah, the One, the Irresistible."
    },
    {
      "verseNumber": 49,
      "verseString": "وَتَرَى الْمُجْرِمِينَ يَوْمَئِذٍ مُقَرَّنِينَ فِي الْأَصْفَادِ",
      "verseStringB": "On that Day, you will see the guilty bound together in chains."
    },
    {
      "verseNumber": 50,
      "verseString": "سَرَابِيلُهُمْ مِنْ قَطِرَانٍ وَتَغْشَىٰ وُجُوهَهُمُ النَّارُ",
      "verseStringB": "Their garments made of tar, and the fire covering their faces."
    },
    {
      "verseNumber": 51,
      "verseString": "لِيَجْزِيَ اللَّهُ كُلَّ نَفْسٍ مَا كَسَبَتْ ۚ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ",
      "verseStringB": "So that Allah may repay each soul for what it has committed. Allah is Swift in reckoning."
    },
    {
      "verseNumber": 52,
      "verseString": "هَٰذَا بَلَاغٌ لِلنَّاسِ وَلِيُنْذَرُوا بِهِ وَلِيَعْلَمُوا أَنَّمَا هُوَ إِلَٰهٌ وَاحِدٌ وَلِيَذَّكَّرَ أُولُو الْأَلْبَابِ",
      "verseStringB": "This is a proclamation for humanity, so that they may be warned thereby, and know that He is One God, and so that the possessors of intellect may reflect."
    }
  ],
  "nameEnglish": "Abraham",
  "nameTrans": "Ibrahim",
  "nameArabic": "إبراهيم",
  "chapterNumber": 14,
  "nVerses": 52
}