{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "طسم",
      "verseStringB": "Ta. Seen. Meem."
    },
    {
      "verseNumber": 2,
      "verseString": "تِلْكَ آيَاتُ الْكِتَابِ الْمُبِينِ",
      "verseStringB": "These are the Verses of the Clear Book."
    },
    {
      "verseNumber": 3,
      "verseString": "نَتْلُو عَلَيْكَ مِنْ نَبَإِ مُوسَىٰ وَفِرْعَوْنَ بِالْحَقِّ لِقَوْمٍ يُؤْمِنُونَ",
      "verseStringB": "We narrate to you from the history of Moses and Pharaoh—in truth—for people who believe."
    },
    {
      "verseNumber": 4,
      "verseString": "إِنَّ فِرْعَوْنَ عَلَا فِي الْأَرْضِ وَجَعَلَ أَهْلَهَا شِيَعًا يَسْتَضْعِفُ طَائِفَةً مِنْهُمْ يُذَبِّحُ أَبْنَاءَهُمْ وَيَسْتَحْيِي نِسَاءَهُمْ ۚ إِنَّهُ كَانَ مِنَ الْمُفْسِدِينَ",
      "verseStringB": "Pharaoh exalted himself in the land, and he divided its people into factions. Oppressing a group of them: slaughtering their sons, while sparing their women. He was one of the corrupters."
    },
    {
      "verseNumber": 5,
      "verseString": "وَنُرِيدُ أَنْ نَمُنَّ عَلَى الَّذِينَ اسْتُضْعِفُوا فِي الْأَرْضِ وَنَجْعَلَهُمْ أَئِمَّةً وَنَجْعَلَهُمُ الْوَارِثِينَ",
      "verseStringB": "But We intended to favor those who were oppressed in the land, and to make them leaders, and to make them the inheritors."
    },
    {
      "verseNumber": 6,
      "verseString": "وَنُمَكِّنَ لَهُمْ فِي الْأَرْضِ وَنُرِيَ فِرْعَوْنَ وَهَامَانَ وَجُنُودَهُمَا مِنْهُمْ مَا كَانُوا يَحْذَرُونَ",
      "verseStringB": "And to establish them in the land; and to show Pharaoh, Hamaan, and their soldiers, the very thing they feared."
    },
    {
      "verseNumber": 7,
      "verseString": "وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي ۖ إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ",
      "verseStringB": "And We inspired the mother of Moses: “Nurse him; but when you fear for him, put him into the river, and do not fear, nor be sad. We will return him to you, and will make him one of the messengers.”"
    },
    {
      "verseNumber": 8,
      "verseString": "فَالْتَقَطَهُ آلُ فِرْعَوْنَ لِيَكُونَ لَهُمْ عَدُوًّا وَحَزَنًا ۗ إِنَّ فِرْعَوْنَ وَهَامَانَ وَجُنُودَهُمَا كَانُوا خَاطِئِينَ",
      "verseStringB": "Pharaoh’s household picked him up, only to become their enemy and a source of grief. Pharaoh, Hamaan, and their soldiers were sinful."
    },
    {
      "verseNumber": 9,
      "verseString": "وَقَالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِي وَلَكَ ۖ لَا تَقْتُلُوهُ عَسَىٰ أَنْ يَنْفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَهُمْ لَا يَشْعُرُونَ",
      "verseStringB": "Pharaoh’s wife said, “An eye's delight for me and for you. Do not kill him; perhaps he will be useful to us, or we may adopt him as a son.” But they did not foresee."
    },
    {
      "verseNumber": 10,
      "verseString": "وَأَصْبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَارِغًا ۖ إِنْ كَادَتْ لَتُبْدِي بِهِ لَوْلَا أَنْ رَبَطْنَا عَلَىٰ قَلْبِهَا لِتَكُونَ مِنَ الْمُؤْمِنِينَ",
      "verseStringB": "The heart of Moses’ mother became empty. She was about to disclose him, had We not steadied her heart, so that she may remain a believer."
    },
    {
      "verseNumber": 11,
      "verseString": "وَقَالَتْ لِأُخْتِهِ قُصِّيهِ ۖ فَبَصُرَتْ بِهِ عَنْ جُنُبٍ وَهُمْ لَا يَشْعُرُونَ",
      "verseStringB": "She said to his sister, “Keep track of him.” So she watched him from a distance, yet they were unaware."
    },
    {
      "verseNumber": 12,
      "verseString": "وَحَرَّمْنَا عَلَيْهِ الْمَرَاضِعَ مِنْ قَبْلُ فَقَالَتْ هَلْ أَدُلُّكُمْ عَلَىٰ أَهْلِ بَيْتٍ يَكْفُلُونَهُ لَكُمْ وَهُمْ لَهُ نَاصِحُونَ",
      "verseStringB": "And We forbade him breastfeeding at first. So she said, “Shall I direct you to a family that will raise him for you, and will look after him?”"
    },
    {
      "verseNumber": 13,
      "verseString": "فَرَدَدْنَاهُ إِلَىٰ أُمِّهِ كَيْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَلِتَعْلَمَ أَنَّ وَعْدَ اللَّهِ حَقٌّ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "Thus We returned him to his mother, so that she may be comforted, and not grieve, and know that Allah’s promise is true. But most of them do not know."
    },
    {
      "verseNumber": 14,
      "verseString": "وَلَمَّا بَلَغَ أَشُدَّهُ وَاسْتَوَىٰ آتَيْنَاهُ حُكْمًا وَعِلْمًا ۚ وَكَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ",
      "verseStringB": "And when he reached full strength and maturity, We gave him wisdom and knowledge. Thus We reward the virtuous."
    },
    {
      "verseNumber": 15,
      "verseString": "وَدَخَلَ الْمَدِينَةَ عَلَىٰ حِينِ غَفْلَةٍ مِنْ أَهْلِهَا فَوَجَدَ فِيهَا رَجُلَيْنِ يَقْتَتِلَانِ هَٰذَا مِنْ شِيعَتِهِ وَهَٰذَا مِنْ عَدُوِّهِ ۖ فَاسْتَغَاثَهُ الَّذِي مِنْ شِيعَتِهِ عَلَى الَّذِي مِنْ عَدُوِّهِ فَوَكَزَهُ مُوسَىٰ فَقَضَىٰ عَلَيْهِ ۖ قَالَ هَٰذَا مِنْ عَمَلِ الشَّيْطَانِ ۖ إِنَّهُ عَدُوٌّ مُضِلٌّ مُبِينٌ",
      "verseStringB": "Once he entered the city, unnoticed by its people. There He found two men fighting. One from his own people, and the other from his enemies. The one from his people called to him for help against the one from his enemies. So Moses struck him, and put an end to him. He said, “This is from Satan's doing. He is an enemy that openly misleads.”"
    },
    {
      "verseNumber": 16,
      "verseString": "قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
      "verseStringB": "He said, “My Lord, I have wronged myself, so forgive me.” So He forgave him. He is the Forgiving, the Merciful."
    },
    {
      "verseNumber": 17,
      "verseString": "قَالَ رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيرًا لِلْمُجْرِمِينَ",
      "verseStringB": "He said, “My Lord! Because of Your favors upon me, I will never be a supporter of the guilty.”"
    },
    {
      "verseNumber": 18,
      "verseString": "فَأَصْبَحَ فِي الْمَدِينَةِ خَائِفًا يَتَرَقَّبُ فَإِذَا الَّذِي اسْتَنْصَرَهُ بِالْأَمْسِ يَسْتَصْرِخُهُ ۚ قَالَ لَهُ مُوسَىٰ إِنَّكَ لَغَوِيٌّ مُبِينٌ",
      "verseStringB": "The next morning, he went about in the city, fearful and vigilant, when the man who had sought his help the day before was shouting out to him. Moses said to him, “You are clearly a troublemaker.”"
    },
    {
      "verseNumber": 19,
      "verseString": "فَلَمَّا أَنْ أَرَادَ أَنْ يَبْطِشَ بِالَّذِي هُوَ عَدُوٌّ لَهُمَا قَالَ يَا مُوسَىٰ أَتُرِيدُ أَنْ تَقْتُلَنِي كَمَا قَتَلْتَ نَفْسًا بِالْأَمْسِ ۖ إِنْ تُرِيدُ إِلَّا أَنْ تَكُونَ جَبَّارًا فِي الْأَرْضِ وَمَا تُرِيدُ أَنْ تَكُونَ مِنَ الْمُصْلِحِينَ",
      "verseStringB": "As he was about to strike the one who was their enemy, he said, “O Moses, do you intend to kill me, as you killed someone yesterday? You only want to be a bully in the land, and you don’t want to be a peacemaker.”"
    },
    {
      "verseNumber": 20,
      "verseString": "وَجَاءَ رَجُلٌ مِنْ أَقْصَى الْمَدِينَةِ يَسْعَىٰ قَالَ يَا مُوسَىٰ إِنَّ الْمَلَأَ يَأْتَمِرُونَ بِكَ لِيَقْتُلُوكَ فَاخْرُجْ إِنِّي لَكَ مِنَ النَّاصِحِينَ",
      "verseStringB": "And there came a man, rushing from the outskirts of the city, saying, “O Moses, the authorities are conspiring against you, to kill you, so get out; I am giving you good advice.”"
    },
    {
      "verseNumber": 21,
      "verseString": "فَخَرَجَ مِنْهَا خَائِفًا يَتَرَقَّبُ ۖ قَالَ رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
      "verseStringB": "So he left, fearful and vigilant. He said, “My Lord, save me from the wrongdoing people.”"
    },
    {
      "verseNumber": 22,
      "verseString": "وَلَمَّا تَوَجَّهَ تِلْقَاءَ مَدْيَنَ قَالَ عَسَىٰ رَبِّي أَنْ يَهْدِيَنِي سَوَاءَ السَّبِيلِ",
      "verseStringB": "And as he headed towards Median, he said, “Perhaps my Lord will guide me to the right way.”"
    },
    {
      "verseNumber": 23,
      "verseString": "وَلَمَّا وَرَدَ مَاءَ مَدْيَنَ وَجَدَ عَلَيْهِ أُمَّةً مِنَ النَّاسِ يَسْقُونَ وَوَجَدَ مِنْ دُونِهِمُ امْرَأَتَيْنِ تَذُودَانِ ۖ قَالَ مَا خَطْبُكُمَا ۖ قَالَتَا لَا نَسْقِي حَتَّىٰ يُصْدِرَ الرِّعَاءُ ۖ وَأَبُونَا شَيْخٌ كَبِيرٌ",
      "verseStringB": "And when he reached Midian’s water, he found there a crowd of people drawing water, and he noticed two women waiting on the side. He said, “What is the matter with you?” They said, “We cannot draw water until the shepherds depart, and our father is a very old man.”"
    },
    {
      "verseNumber": 24,
      "verseString": "فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰ إِلَى الظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ",
      "verseStringB": "So he drew water for them. Then he withdrew to the shade, and said, “My Lord, I am in dire need of whatever good you might send down to me.”"
    },
    {
      "verseNumber": 25,
      "verseString": "فَجَاءَتْهُ إِحْدَاهُمَا تَمْشِي عَلَى اسْتِحْيَاءٍ قَالَتْ إِنَّ أَبِي يَدْعُوكَ لِيَجْزِيَكَ أَجْرَ مَا سَقَيْتَ لَنَا ۚ فَلَمَّا جَاءَهُ وَقَصَّ عَلَيْهِ الْقَصَصَ قَالَ لَا تَخَفْ ۖ نَجَوْتَ مِنَ الْقَوْمِ الظَّالِمِينَ",
      "verseStringB": "Then, one of the two women approached him, walking bashfully. She said, “My father is inviting you, to compensate you for having drawn water for us.” And when he came and told him the story, he said, “Do not fear, you have escaped from the wrongdoing people.”"
    },
    {
      "verseNumber": 26,
      "verseString": "قَالَتْ إِحْدَاهُمَا يَا أَبَتِ اسْتَأْجِرْهُ ۖ إِنَّ خَيْرَ مَنِ اسْتَأْجَرْتَ الْقَوِيُّ الْأَمِينُ",
      "verseStringB": "One of the two women said, “Father, hire him. The best employee for you is the strong and trustworthy.”"
    },
    {
      "verseNumber": 27,
      "verseString": "قَالَ إِنِّي أُرِيدُ أَنْ أُنْكِحَكَ إِحْدَى ابْنَتَيَّ هَاتَيْنِ عَلَىٰ أَنْ تَأْجُرَنِي ثَمَانِيَ حِجَجٍ ۖ فَإِنْ أَتْمَمْتَ عَشْرًا فَمِنْ عِنْدِكَ ۖ وَمَا أُرِيدُ أَنْ أَشُقَّ عَلَيْكَ ۚ سَتَجِدُنِي إِنْ شَاءَ اللَّهُ مِنَ الصَّالِحِينَ",
      "verseStringB": "He said, “I wish to marry you to one of these two daughters of mine, provided you stay in my service for eight years. But if you complete ten, it is up to you. I do not intend to be hard on you. You will find me, Allah willing, of the righteous.”"
    },
    {
      "verseNumber": 28,
      "verseString": "قَالَ ذَٰلِكَ بَيْنِي وَبَيْنَكَ ۖ أَيَّمَا الْأَجَلَيْنِ قَضَيْتُ فَلَا عُدْوَانَ عَلَيَّ ۖ وَاللَّهُ عَلَىٰ مَا نَقُولُ وَكِيلٌ",
      "verseStringB": "He said, “Let this be an agreement between you and me. Whichever of the two terms I complete, there shall be no reprisal against me. And Allah is Guardian over what we say.”"
    },
    {
      "verseNumber": 29,
      "verseString": "فَلَمَّا قَضَىٰ مُوسَى الْأَجَلَ وَسَارَ بِأَهْلِهِ آنَسَ مِنْ جَانِبِ الطُّورِ نَارًا قَالَ لِأَهْلِهِ امْكُثُوا إِنِّي آنَسْتُ نَارًا لَعَلِّي آتِيكُمْ مِنْهَا بِخَبَرٍ أَوْ جَذْوَةٍ مِنَ النَّارِ لَعَلَّكُمْ تَصْطَلُونَ",
      "verseStringB": "When Moses completed the term and departed with his family, he noticed a fire by the side of the Mount. He said to his family, “Stay here; I have glimpsed a fire. Perhaps I can bring you some information from there, or a torch from the fire, so that you may warm yourselves.”"
    },
    {
      "verseNumber": 30,
      "verseString": "فَلَمَّا أَتَاهَا نُودِيَ مِنْ شَاطِئِ الْوَادِ الْأَيْمَنِ فِي الْبُقْعَةِ الْمُبَارَكَةِ مِنَ الشَّجَرَةِ أَنْ يَا مُوسَىٰ إِنِّي أَنَا اللَّهُ رَبُّ الْعَالَمِينَ",
      "verseStringB": "And when he reached it, he was called from the right bank of the valley, at the Sacred Ground, from the bush: “O Moses, it is I, Allah, Lord of the Worlds."
    },
    {
      "verseNumber": 31,
      "verseString": "وَأَنْ أَلْقِ عَصَاكَ ۖ فَلَمَّا رَآهَا تَهْتَزُّ كَأَنَّهَا جَانٌّ وَلَّىٰ مُدْبِرًا وَلَمْ يُعَقِّبْ ۚ يَا مُوسَىٰ أَقْبِلْ وَلَا تَخَفْ ۖ إِنَّكَ مِنَ الْآمِنِينَ",
      "verseStringB": "Throw down your cane.” And when he saw it wiggling, as if it were possessed, he turned in retreat without returning. “O Moses, draw near, and do not fear, you are perfectly safe."
    },
    {
      "verseNumber": 32,
      "verseString": "اسْلُكْ يَدَكَ فِي جَيْبِكَ تَخْرُجْ بَيْضَاءَ مِنْ غَيْرِ سُوءٍ وَاضْمُمْ إِلَيْكَ جَنَاحَكَ مِنَ الرَّهْبِ ۖ فَذَانِكَ بُرْهَانَانِ مِنْ رَبِّكَ إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ ۚ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ",
      "verseStringB": "Put your hand inside your pocket, and it will come out white, without blemish. And press your arm to your side, against fear. These are two proofs from your Lord, to Pharaoh and his chiefs. They are sinful people.”"
    },
    {
      "verseNumber": 33,
      "verseString": "قَالَ رَبِّ إِنِّي قَتَلْتُ مِنْهُمْ نَفْسًا فَأَخَافُ أَنْ يَقْتُلُونِ",
      "verseStringB": "He said, “My Lord, I have killed one of them, so I fear they will kill me."
    },
    {
      "verseNumber": 34,
      "verseString": "وَأَخِي هَارُونُ هُوَ أَفْصَحُ مِنِّي لِسَانًا فَأَرْسِلْهُ مَعِيَ رِدْءًا يُصَدِّقُنِي ۖ إِنِّي أَخَافُ أَنْ يُكَذِّبُونِ",
      "verseStringB": "And my brother Aaron: he is more eloquent than me in speech, so send him with me, to help me, and to confirm my words, for I fear they will reject me.”"
    },
    {
      "verseNumber": 35,
      "verseString": "قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ وَنَجْعَلُ لَكُمَا سُلْطَانًا فَلَا يَصِلُونَ إِلَيْكُمَا ۚ بِآيَاتِنَا أَنْتُمَا وَمَنِ اتَّبَعَكُمَا الْغَالِبُونَ",
      "verseStringB": "He said, “We will strengthen you with your brother, and We will give you authority—so they cannot reach you. By virtue of Our signs, you and those who follow you will be the victors.”"
    },
    {
      "verseNumber": 36,
      "verseString": "فَلَمَّا جَاءَهُمْ مُوسَىٰ بِآيَاتِنَا بَيِّنَاتٍ قَالُوا مَا هَٰذَا إِلَّا سِحْرٌ مُفْتَرًى وَمَا سَمِعْنَا بِهَٰذَا فِي آبَائِنَا الْأَوَّلِينَ",
      "verseStringB": "But when Moses came to them with Our proofs, clear and obvious, they said, “This is nothing but fabricated magic, and We never heard of this from our ancestors of old.”"
    },
    {
      "verseNumber": 37,
      "verseString": "وَقَالَ مُوسَىٰ رَبِّي أَعْلَمُ بِمَنْ جَاءَ بِالْهُدَىٰ مِنْ عِنْدِهِ وَمَنْ تَكُونُ لَهُ عَاقِبَةُ الدَّارِ ۖ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ",
      "verseStringB": "Moses said, “My Lord knows best who brings guidance from Him, and who will have the final Home. The wrongdoers will not succeed.”"
    },
    {
      "verseNumber": 38,
      "verseString": "وَقَالَ فِرْعَوْنُ يَا أَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُمْ مِنْ إِلَٰهٍ غَيْرِي فَأَوْقِدْ لِي يَا هَامَانُ عَلَى الطِّينِ فَاجْعَلْ لِي صَرْحًا لَعَلِّي أَطَّلِعُ إِلَىٰ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُ مِنَ الْكَاذِبِينَ",
      "verseStringB": "Pharaoh said, “O nobles, I know of no god for you other than me. So fire-up the bricks for me, O Hamaan, and make me a tower, so I may look at the God of Moses, although I think he is a liar.”"
    },
    {
      "verseNumber": 39,
      "verseString": "وَاسْتَكْبَرَ هُوَ وَجُنُودُهُ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَظَنُّوا أَنَّهُمْ إِلَيْنَا لَا يُرْجَعُونَ",
      "verseStringB": "He and his soldiers acted arrogantly in the land, with no justification. They thought they would not be returned to Us."
    },
    {
      "verseNumber": 40,
      "verseString": "فَأَخَذْنَاهُ وَجُنُودَهُ فَنَبَذْنَاهُمْ فِي الْيَمِّ ۖ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الظَّالِمِينَ",
      "verseStringB": "So We seized him and his soldiers, and We threw them into the sea. Observe, therefore, what the end of the oppressors was."
    },
    {
      "verseNumber": 41,
      "verseString": "وَجَعَلْنَاهُمْ أَئِمَّةً يَدْعُونَ إِلَى النَّارِ ۖ وَيَوْمَ الْقِيَامَةِ لَا يُنْصَرُونَ",
      "verseStringB": "And We made them leaders calling to the Fire. And on Resurrection Day, they will not be helped."
    },
    {
      "verseNumber": 42,
      "verseString": "وَأَتْبَعْنَاهُمْ فِي هَٰذِهِ الدُّنْيَا لَعْنَةً ۖ وَيَوْمَ الْقِيَامَةِ هُمْ مِنَ الْمَقْبُوحِينَ",
      "verseStringB": "And We pursued them in this world with a curse. And on Resurrection Day, they will be among the uglified."
    },
    {
      "verseNumber": 43,
      "verseString": "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ مِنْ بَعْدِ مَا أَهْلَكْنَا الْقُرُونَ الْأُولَىٰ بَصَائِرَ لِلنَّاسِ وَهُدًى وَرَحْمَةً لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "verseStringB": "And We gave Moses the Scripture—after We had destroyed the previous generations—as insight for people, and guidance and mercy, so that they may reflect."
    },
    {
      "verseNumber": 44,
      "verseString": "وَمَا كُنْتَ بِجَانِبِ الْغَرْبِيِّ إِذْ قَضَيْنَا إِلَىٰ مُوسَى الْأَمْرَ وَمَا كُنْتَ مِنَ الشَّاهِدِينَ",
      "verseStringB": "You were not on the Western Side when We entrusted the Commandments to Moses, nor were you of the witnesses."
    },
    {
      "verseNumber": 45,
      "verseString": "وَلَٰكِنَّا أَنْشَأْنَا قُرُونًا فَتَطَاوَلَ عَلَيْهِمُ الْعُمُرُ ۚ وَمَا كُنْتَ ثَاوِيًا فِي أَهْلِ مَدْيَنَ تَتْلُو عَلَيْهِمْ آيَاتِنَا وَلَٰكِنَّا كُنَّا مُرْسِلِينَ",
      "verseStringB": "But We established many generations, and life grew long for them. Nor were you among the people of Median, reading Our revelations to them. But We kept sending messengers."
    },
    {
      "verseNumber": 46,
      "verseString": "وَمَا كُنْتَ بِجَانِبِ الطُّورِ إِذْ نَادَيْنَا وَلَٰكِنْ رَحْمَةً مِنْ رَبِّكَ لِتُنْذِرَ قَوْمًا مَا أَتَاهُمْ مِنْ نَذِيرٍ مِنْ قَبْلِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "verseStringB": "Nor were you by the side of the Mount when We announced. But it was a mercy from your Lord, to warn a people who received no warner before you, so they may take notice."
    },
    {
      "verseNumber": 47,
      "verseString": "وَلَوْلَا أَنْ تُصِيبَهُمْ مُصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَيَقُولُوا رَبَّنَا لَوْلَا أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ آيَاتِكَ وَنَكُونَ مِنَ الْمُؤْمِنِينَ",
      "verseStringB": "Otherwise, if a calamity befell them because of what their hands have perpetrated, they would say, “Our Lord, if only You had sent us a messenger, we would have followed Your revelations, and been among the believers.”"
    },
    {
      "verseNumber": 48,
      "verseString": "فَلَمَّا جَاءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوا لَوْلَا أُوتِيَ مِثْلَ مَا أُوتِيَ مُوسَىٰ ۚ أَوَلَمْ يَكْفُرُوا بِمَا أُوتِيَ مُوسَىٰ مِنْ قَبْلُ ۖ قَالُوا سِحْرَانِ تَظَاهَرَا وَقَالُوا إِنَّا بِكُلٍّ كَافِرُونَ",
      "verseStringB": "But when the truth came to them from Us, they said, “If only he was given the like of what was given to Moses.” Did they not deny what was given to Moses in the past? They said, “Two works of magic, backing one another.” And they said, “We are rejecting both.”"
    },
    {
      "verseNumber": 49,
      "verseString": "قُلْ فَأْتُوا بِكِتَابٍ مِنْ عِنْدِ اللَّهِ هُوَ أَهْدَىٰ مِنْهُمَا أَتَّبِعْهُ إِنْ كُنْتُمْ صَادِقِينَ",
      "verseStringB": "Say, “Then bring a scripture from Allah, more conducive to guidance than both, and I will follow it—if you are truthful.”"
    },
    {
      "verseNumber": 50,
      "verseString": "فَإِنْ لَمْ يَسْتَجِيبُوا لَكَ فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَاءَهُمْ ۚ وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ هُدًى مِنَ اللَّهِ ۚ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "verseStringB": "But if they do not respond to you, then know that they follow their fancies. And who is more lost than he who follows his fancy without guidance from Allah? Allah does not guide the unjust people."
    },
    {
      "verseNumber": 51,
      "verseString": "وَلَقَدْ وَصَّلْنَا لَهُمُ الْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "verseStringB": "We have conveyed to them the Word, so they may reflect."
    },
    {
      "verseNumber": 52,
      "verseString": "الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ مِنْ قَبْلِهِ هُمْ بِهِ يُؤْمِنُونَ",
      "verseStringB": "Those to whom We gave the Scripture before it—they are believers in it."
    },
    {
      "verseNumber": 53,
      "verseString": "وَإِذَا يُتْلَىٰ عَلَيْهِمْ قَالُوا آمَنَّا بِهِ إِنَّهُ الْحَقُّ مِنْ رَبِّنَا إِنَّا كُنَّا مِنْ قَبْلِهِ مُسْلِمِينَ",
      "verseStringB": "And when it is read to them, they say, “We believe in it; it is the truth from our Lord; we were Submitters prior to it.”"
    },
    {
      "verseNumber": 54,
      "verseString": "أُولَٰئِكَ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ بِمَا صَبَرُوا وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ",
      "verseStringB": "These will be given their reward twice—because they persevered. And they counter bad with good. And from Our provisions to them, they give."
    },
    {
      "verseNumber": 55,
      "verseString": "وَإِذَا سَمِعُوا اللَّغْوَ أَعْرَضُوا عَنْهُ وَقَالُوا لَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ سَلَامٌ عَلَيْكُمْ لَا نَبْتَغِي الْجَاهِلِينَ",
      "verseStringB": "And when they hear vain talk, they turn away from it, and say, “We have our deeds, and you have your deeds; peace be upon you; we do not desire the ignorant.”"
    },
    {
      "verseNumber": 56,
      "verseString": "إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَٰكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ ۚ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ",
      "verseStringB": "You cannot guide whom you love, but Allah guides whom He wills, and He knows best those who are guided."
    },
    {
      "verseNumber": 57,
      "verseString": "وَقَالُوا إِنْ نَتَّبِعِ الْهُدَىٰ مَعَكَ نُتَخَطَّفْ مِنْ أَرْضِنَا ۚ أَوَلَمْ نُمَكِّنْ لَهُمْ حَرَمًا آمِنًا يُجْبَىٰ إِلَيْهِ ثَمَرَاتُ كُلِّ شَيْءٍ رِزْقًا مِنْ لَدُنَّا وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "And they say, “If we follow the guidance with you, we will be snatched away from our land.” Did we not establish for them a Safe Sanctuary, to which fruits of all kinds are brought, as a provision from Us? But most of them do not know."
    },
    {
      "verseNumber": 58,
      "verseString": "وَكَمْ أَهْلَكْنَا مِنْ قَرْيَةٍ بَطِرَتْ مَعِيشَتَهَا ۖ فَتِلْكَ مَسَاكِنُهُمْ لَمْ تُسْكَنْ مِنْ بَعْدِهِمْ إِلَّا قَلِيلًا ۖ وَكُنَّا نَحْنُ الْوَارِثِينَ",
      "verseStringB": "And how many a town have We destroyed who exulted in their life of ease? Here are their dwellings, uninhabited after them, except for a few. And We are the Inheritors."
    },
    {
      "verseNumber": 59,
      "verseString": "وَمَا كَانَ رَبُّكَ مُهْلِكَ الْقُرَىٰ حَتَّىٰ يَبْعَثَ فِي أُمِّهَا رَسُولًا يَتْلُو عَلَيْهِمْ آيَاتِنَا ۚ وَمَا كُنَّا مُهْلِكِي الْقُرَىٰ إِلَّا وَأَهْلُهَا ظَالِمُونَ",
      "verseStringB": "Your Lord never destroys towns without first sending a messenger in their midst, reading to them Our revelations. And We never destroy towns, unless their people are wrongdoers."
    },
    {
      "verseNumber": 60,
      "verseString": "وَمَا أُوتِيتُمْ مِنْ شَيْءٍ فَمَتَاعُ الْحَيَاةِ الدُّنْيَا وَزِينَتُهَا ۚ وَمَا عِنْدَ اللَّهِ خَيْرٌ وَأَبْقَىٰ ۚ أَفَلَا تَعْقِلُونَ",
      "verseStringB": "Whatever you are given is only the enjoyment of this life—and its glitter. But what is with Allah is better, and longer-lasting. Do you not comprehend?"
    },
    {
      "verseNumber": 61,
      "verseString": "أَفَمَنْ وَعَدْنَاهُ وَعْدًا حَسَنًا فَهُوَ لَاقِيهِ كَمَنْ مَتَّعْنَاهُ مَتَاعَ الْحَيَاةِ الدُّنْيَا ثُمَّ هُوَ يَوْمَ الْقِيَامَةِ مِنَ الْمُحْضَرِينَ",
      "verseStringB": "Can someone to whom We promised a good promise—which he will attain—be equal to someone to whom We gave enjoyments in this world, but who will be, on Resurrection Day, among the arraigned?"
    },
    {
      "verseNumber": 62,
      "verseString": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنْتُمْ تَزْعُمُونَ",
      "verseStringB": "On the Day when He calls out to them, and He says, “Where are My partners, those whom you claimed?”"
    },
    {
      "verseNumber": 63,
      "verseString": "قَالَ الَّذِينَ حَقَّ عَلَيْهِمُ الْقَوْلُ رَبَّنَا هَٰؤُلَاءِ الَّذِينَ أَغْوَيْنَا أَغْوَيْنَاهُمْ كَمَا غَوَيْنَا ۖ تَبَرَّأْنَا إِلَيْكَ ۖ مَا كَانُوا إِيَّانَا يَعْبُدُونَ",
      "verseStringB": "Those against whom the Word is justified will say, “Our Lord, these are the ones we caused to deviate. We caused them to deviate, as we ourselves deviated. We declare our innocence to You. It was not us they worshiped.”"
    },
    {
      "verseNumber": 64,
      "verseString": "وَقِيلَ ادْعُوا شُرَكَاءَكُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيبُوا لَهُمْ وَرَأَوُا الْعَذَابَ ۚ لَوْ أَنَّهُمْ كَانُوا يَهْتَدُونَ",
      "verseStringB": "And it will be said, “Call on your partners.” And they will call on them, but they will not answer them. And they will see the suffering. If only they were guided!"
    },
    {
      "verseNumber": 65,
      "verseString": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ مَاذَا أَجَبْتُمُ الْمُرْسَلِينَ",
      "verseStringB": "On the Day when He calls out to them, and He says, “what did you answer the Messengers?”"
    },
    {
      "verseNumber": 66,
      "verseString": "فَعَمِيَتْ عَلَيْهِمُ الْأَنْبَاءُ يَوْمَئِذٍ فَهُمْ لَا يَتَسَاءَلُونَ",
      "verseStringB": "They will be blinded by the facts on that Day, and they will not ask one another."
    },
    {
      "verseNumber": 67,
      "verseString": "فَأَمَّا مَنْ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا فَعَسَىٰ أَنْ يَكُونَ مِنَ الْمُفْلِحِينَ",
      "verseStringB": "As for he who repents, believes, and works righteousness: he may well be among the winners."
    },
    {
      "verseNumber": 68,
      "verseString": "وَرَبُّكَ يَخْلُقُ مَا يَشَاءُ وَيَخْتَارُ ۗ مَا كَانَ لَهُمُ الْخِيَرَةُ ۚ سُبْحَانَ اللَّهِ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ",
      "verseStringB": "Your Lord creates whatever He wills, and He chooses. The choice is not theirs. Glory be to Allah, and exalted is He above the associations they make."
    },
    {
      "verseNumber": 69,
      "verseString": "وَرَبُّكَ يَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ وَمَا يُعْلِنُونَ",
      "verseStringB": "And your Lord knows what their hearts conceal, and what they disclose."
    },
    {
      "verseNumber": 70,
      "verseString": "وَهُوَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ لَهُ الْحَمْدُ فِي الْأُولَىٰ وَالْآخِرَةِ ۖ وَلَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "He is Allah. There is no god except He. To Him belongs all praise in this life, and in the next. All authority is His. And to Him, you will be returned."
    },
    {
      "verseNumber": 71,
      "verseString": "قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ اللَّيْلَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِضِيَاءٍ ۖ أَفَلَا تَسْمَعُونَ",
      "verseStringB": "Say, “Have you considered? If Allah were to make the night continuous over you until the Day of Resurrection, which god other than Allah could bring you light? Do you not listen?”"
    },
    {
      "verseNumber": 72,
      "verseString": "قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ النَّهَارَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيَامَةِ مَنْ إِلَٰهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِلَيْلٍ تَسْكُنُونَ فِيهِ ۖ أَفَلَا تُبْصِرُونَ",
      "verseStringB": "Say, “Have you considered? If Allah were to make the day continuous over you until the Day of Resurrection, which god other than Allah could bring you night, to rest in? Do you not see?”"
    },
    {
      "verseNumber": 73,
      "verseString": "وَمِنْ رَحْمَتِهِ جَعَلَ لَكُمُ اللَّيْلَ وَالنَّهَارَ لِتَسْكُنُوا فِيهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ",
      "verseStringB": "Out of His mercy, He made for you the night and the day, so that you may rest in it, and to seek of His bounty, so that you may give thanks."
    },
    {
      "verseNumber": 74,
      "verseString": "وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ أَيْنَ شُرَكَائِيَ الَّذِينَ كُنْتُمْ تَزْعُمُونَ",
      "verseStringB": "On the Day when He calls out to them, and He says, “Where are My associates, those whom you claimed?”"
    },
    {
      "verseNumber": 75,
      "verseString": "وَنَزَعْنَا مِنْ كُلِّ أُمَّةٍ شَهِيدًا فَقُلْنَا هَاتُوا بُرْهَانَكُمْ فَعَلِمُوا أَنَّ الْحَقَّ لِلَّهِ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ",
      "verseStringB": "And We will pull a witness from every group, then say, “Produce your evidence.” Then they will realize that the truth is Allah’s, and those they used to invent have abandoned them."
    },
    {
      "verseNumber": 76,
      "verseString": "إِنَّ قَارُونَ كَانَ مِنْ قَوْمِ مُوسَىٰ فَبَغَىٰ عَلَيْهِمْ ۖ وَآتَيْنَاهُ مِنَ الْكُنُوزِ مَا إِنَّ مَفَاتِحَهُ لَتَنُوءُ بِالْعُصْبَةِ أُولِي الْقُوَّةِ إِذْ قَالَ لَهُ قَوْمُهُ لَا تَفْرَحْ ۖ إِنَّ اللَّهَ لَا يُحِبُّ الْفَرِحِينَ",
      "verseStringB": "Korah belonged to the people of Moses, but he exploited them. We had given him treasures, the keys of which would burden a group of strong men. When his people said to him, “Do not be overjoyed; Allah does not like the exultant."
    },
    {
      "verseNumber": 77,
      "verseString": "وَابْتَغِ فِيمَا آتَاكَ اللَّهُ الدَّارَ الْآخِرَةَ ۖ وَلَا تَنْسَ نَصِيبَكَ مِنَ الدُّنْيَا ۖ وَأَحْسِنْ كَمَا أَحْسَنَ اللَّهُ إِلَيْكَ ۖ وَلَا تَبْغِ الْفَسَادَ فِي الْأَرْضِ ۖ إِنَّ اللَّهَ لَا يُحِبُّ الْمُفْسِدِينَ",
      "verseStringB": "But seek, with what Allah has given you, the Home of the Hereafter. And do not neglect your share of this world. And be charitable, as Allah is charitable to you. And do not work corruption on earth—Allah does not like the corruptors.”"
    },
    {
      "verseNumber": 78,
      "verseString": "قَالَ إِنَّمَا أُوتِيتُهُ عَلَىٰ عِلْمٍ عِنْدِي ۚ أَوَلَمْ يَعْلَمْ أَنَّ اللَّهَ قَدْ أَهْلَكَ مِنْ قَبْلِهِ مِنَ الْقُرُونِ مَنْ هُوَ أَشَدُّ مِنْهُ قُوَّةً وَأَكْثَرُ جَمْعًا ۚ وَلَا يُسْأَلُ عَنْ ذُنُوبِهِمُ الْمُجْرِمُونَ",
      "verseStringB": "He said, “I was able to obtain this because of the knowledge I have.” Did he not know that Allah has destroyed generations before him, who were stronger than him, and possessed greater riches? But the guilty will not be asked about their sins."
    },
    {
      "verseNumber": 79,
      "verseString": "فَخَرَجَ عَلَىٰ قَوْمِهِ فِي زِينَتِهِ ۖ قَالَ الَّذِينَ يُرِيدُونَ الْحَيَاةَ الدُّنْيَا يَا لَيْتَ لَنَا مِثْلَ مَا أُوتِيَ قَارُونُ إِنَّهُ لَذُو حَظٍّ عَظِيمٍ",
      "verseStringB": "And he came out before his people in his splendor. Those who desired the worldly life said, “If only we possessed the likes of what Korah was given. He is truly very fortunate.”"
    },
    {
      "verseNumber": 80,
      "verseString": "وَقَالَ الَّذِينَ أُوتُوا الْعِلْمَ وَيْلَكُمْ ثَوَابُ اللَّهِ خَيْرٌ لِمَنْ آمَنَ وَعَمِلَ صَالِحًا وَلَا يُلَقَّاهَا إِلَّا الصَّابِرُونَ",
      "verseStringB": "But those gifted with knowledge said, “Woe to you! The reward of Allah is better for those who believe and work righteousness.” Yet none attains it except the patient."
    },
    {
      "verseNumber": 81,
      "verseString": "فَخَسَفْنَا بِهِ وَبِدَارِهِ الْأَرْضَ فَمَا كَانَ لَهُ مِنْ فِئَةٍ يَنْصُرُونَهُ مِنْ دُونِ اللَّهِ وَمَا كَانَ مِنَ الْمُنْتَصِرِينَ",
      "verseStringB": "So We caused the earth to cave in on him and his mansion. He had no company to save him from Allah, nor could he defend himself."
    },
    {
      "verseNumber": 82,
      "verseString": "وَأَصْبَحَ الَّذِينَ تَمَنَّوْا مَكَانَهُ بِالْأَمْسِ يَقُولُونَ وَيْكَأَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ ۖ لَوْلَا أَنْ مَنَّ اللَّهُ عَلَيْنَا لَخَسَفَ بِنَا ۖ وَيْكَأَنَّهُ لَا يُفْلِحُ الْكَافِرُونَ",
      "verseStringB": "And those who desired his position the day before were saying, “Alas! It seems Allah gives abundantly to whom He wills of His servants, or sparingly. Had Allah not been gracious to us, He would have caved in on us. Oh, certainly, the ungrateful never prosper.”"
    },
    {
      "verseNumber": 83,
      "verseString": "تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوًّا فِي الْأَرْضِ وَلَا فَسَادًا ۚ وَالْعَاقِبَةُ لِلْمُتَّقِينَ",
      "verseStringB": "That Home of the Hereafter—We reserve it to those who seek no superiority on earth, nor corruption. And the outcome is for the cautious."
    },
    {
      "verseNumber": 84,
      "verseString": "مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِنْهَا ۖ وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى الَّذِينَ عَمِلُوا السَّيِّئَاتِ إِلَّا مَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "Whoever comes with virtue will have what is better. But whoever comes with evil—the evildoers will be punished only for what they used to do."
    },
    {
      "verseNumber": 85,
      "verseString": "إِنَّ الَّذِي فَرَضَ عَلَيْكَ الْقُرْآنَ لَرَادُّكَ إِلَىٰ مَعَادٍ ۚ قُلْ رَبِّي أَعْلَمُ مَنْ جَاءَ بِالْهُدَىٰ وَمَنْ هُوَ فِي ضَلَالٍ مُبِينٍ",
      "verseStringB": "He Who mandated the Quran to you will return you Home. Say, “My Lord knows best anyone who brought the guidance, and who is in obvious error.”"
    },
    {
      "verseNumber": 86,
      "verseString": "وَمَا كُنْتَ تَرْجُو أَنْ يُلْقَىٰ إِلَيْكَ الْكِتَابُ إِلَّا رَحْمَةً مِنْ رَبِّكَ ۖ فَلَا تَكُونَنَّ ظَهِيرًا لِلْكَافِرِينَ",
      "verseStringB": "You did not expect the Scripture to be transmitted to you, except mercy from your Lord. So do not be a supporter of the unbelievers."
    },
    {
      "verseNumber": 87,
      "verseString": "وَلَا يَصُدُّنَّكَ عَنْ آيَاتِ اللَّهِ بَعْدَ إِذْ أُنْزِلَتْ إِلَيْكَ ۖ وَادْعُ إِلَىٰ رَبِّكَ ۖ وَلَا تَكُونَنَّ مِنَ الْمُشْرِكِينَ",
      "verseStringB": "And do not let them divert you from Allah’s revelations after they have been revealed to you. And pray to your Lord, and never be of the associators."
    },
    {
      "verseNumber": 88,
      "verseString": "وَلَا تَدْعُ مَعَ اللَّهِ إِلَٰهًا آخَرَ ۘ لَا إِلَٰهَ إِلَّا هُوَ ۚ كُلُّ شَيْءٍ هَالِكٌ إِلَّا وَجْهَهُ ۚ لَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "And do not call upon another god along with Allah—there is no god but He. All things perish, except His essence. Judgment belongs to Him. And to Him, you will be returned."
    }
  ],
  "nameEnglish": "History",
  "nameTrans": "al-Qasas",
  "nameArabic": "القصص",
  "chapterNumber": 28,
  "nVerses": 88
}