{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يَا أَيُّهَا النَّبِيُّ اتَّقِ اللَّهَ وَلَا تُطِعِ الْكَافِرِينَ وَالْمُنَافِقِينَ ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا",
      "verseStringB": "O Prophet! Reverence Allah, and do not obey the unbelievers and the hypocrites. Allah is Knowing and Wise."
    },
    {
      "verseNumber": 2,
      "verseString": "وَاتَّبِعْ مَا يُوحَىٰ إِلَيْكَ مِنْ رَبِّكَ ۚ إِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
      "verseStringB": "And follow what is revealed to you from your Lord. Allah is aware of what you do."
    },
    {
      "verseNumber": 3,
      "verseString": "وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا",
      "verseStringB": "And put your trust in Allah. Allah is enough as a trustee."
    },
    {
      "verseNumber": 4,
      "verseString": "مَا جَعَلَ اللَّهُ لِرَجُلٍ مِنْ قَلْبَيْنِ فِي جَوْفِهِ ۚ وَمَا جَعَلَ أَزْوَاجَكُمُ اللَّائِي تُظَاهِرُونَ مِنْهُنَّ أُمَّهَاتِكُمْ ۚ وَمَا جَعَلَ أَدْعِيَاءَكُمْ أَبْنَاءَكُمْ ۚ ذَٰلِكُمْ قَوْلُكُمْ بِأَفْوَاهِكُمْ ۖ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ",
      "verseStringB": "Allah did not place two hearts inside any man's body. Nor did He make your wives whom you equate with your mothers, your actual mothers. Nor did He make your adopted children, your actual children. These are your words coming out of your mouths. Allah speaks the truth, and He guides upon the path."
    },
    {
      "verseNumber": 5,
      "verseString": "ادْعُوهُمْ لِآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللَّهِ ۚ فَإِنْ لَمْ تَعْلَمُوا آبَاءَهُمْ فَإِخْوَانُكُمْ فِي الدِّينِ وَمَوَالِيكُمْ ۚ وَلَيْسَ عَلَيْكُمْ جُنَاحٌ فِيمَا أَخْطَأْتُمْ بِهِ وَلَٰكِنْ مَا تَعَمَّدَتْ قُلُوبُكُمْ ۚ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "verseStringB": "Call them after their fathers; that is more equitable before Allah. But if you do not know their fathers, then your brethren in faith and your friends. There is no blame on you if you make a mistake in it, barring what your hearts intent. Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 6,
      "verseString": "النَّبِيُّ أَوْلَىٰ بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ ۖ وَأَزْوَاجُهُ أُمَّهَاتُهُمْ ۗ وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِي كِتَابِ اللَّهِ مِنَ الْمُؤْمِنِينَ وَالْمُهَاجِرِينَ إِلَّا أَنْ تَفْعَلُوا إِلَىٰ أَوْلِيَائِكُمْ مَعْرُوفًا ۚ كَانَ ذَٰلِكَ فِي الْكِتَابِ مَسْطُورًا",
      "verseStringB": "The Prophet is more caring of the believers than they are of themselves, and his wives are mothers to them. And family relations are closer to one another, according to the Book of Allah, than the believers and the emigrants. Although you should act rightly towards your friends. This is inscribed in the Book."
    },
    {
      "verseNumber": 7,
      "verseString": "وَإِذْ أَخَذْنَا مِنَ النَّبِيِّينَ مِيثَاقَهُمْ وَمِنْكَ وَمِنْ نُوحٍ وَإِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَى ابْنِ مَرْيَمَ ۖ وَأَخَذْنَا مِنْهُمْ مِيثَاقًا غَلِيظًا",
      "verseStringB": "Recall that We received a pledge from the prophets, and from you, and from Noah, and Abraham, and Moses, and Jesus son of Mary. And We received from them a firm commitment."
    },
    {
      "verseNumber": 8,
      "verseString": "لِيَسْأَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ ۚ وَأَعَدَّ لِلْكَافِرِينَ عَذَابًا أَلِيمًا",
      "verseStringB": "So that the truthful may be asked about their truthfulness. He has prepared for the disbelievers a painful punishment."
    },
    {
      "verseNumber": 9,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ جَاءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا وَجُنُودًا لَمْ تَرَوْهَا ۚ وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا",
      "verseStringB": "O you who believe! Remember Allah’s blessings upon you, when forces came against you, and We sent against them a wind and forces you could not see. Allah is Observant of what you do."
    },
    {
      "verseNumber": 10,
      "verseString": "إِذْ جَاءُوكُمْ مِنْ فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنْكُمْ وَإِذْ زَاغَتِ الْأَبْصَارُ وَبَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ وَتَظُنُّونَ بِاللَّهِ الظُّنُونَا",
      "verseStringB": "When they came at you, from above you, and from beneath you; and the eyes became dazed, and the hearts reached the throats, and you harbored doubts about Allah."
    },
    {
      "verseNumber": 11,
      "verseString": "هُنَالِكَ ابْتُلِيَ الْمُؤْمِنُونَ وَزُلْزِلُوا زِلْزَالًا شَدِيدًا",
      "verseStringB": "There and then the believers were tested, and they were shaken most severely."
    },
    {
      "verseNumber": 12,
      "verseString": "وَإِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ مَا وَعَدَنَا اللَّهُ وَرَسُولُهُ إِلَّا غُرُورًا",
      "verseStringB": "And When the hypocrites and the sick at heart said, “Allah and His Messenger promised us nothing but delusion.”"
    },
    {
      "verseNumber": 13,
      "verseString": "وَإِذْ قَالَتْ طَائِفَةٌ مِنْهُمْ يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَارْجِعُوا ۚ وَيَسْتَأْذِنُ فَرِيقٌ مِنْهُمُ النَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِيَ بِعَوْرَةٍ ۖ إِنْ يُرِيدُونَ إِلَّا فِرَارًا",
      "verseStringB": "And when a group of them said, “O people of Yathrib, you cannot make a stand, so retreat.” And a group of them asked permission from the Prophet, saying, “Our homes are unprotected,” although they were not unprotected. They only intended to flee."
    },
    {
      "verseNumber": 14,
      "verseString": "وَلَوْ دُخِلَتْ عَلَيْهِمْ مِنْ أَقْطَارِهَا ثُمَّ سُئِلُوا الْفِتْنَةَ لَآتَوْهَا وَمَا تَلَبَّثُوا بِهَا إِلَّا يَسِيرًا",
      "verseStringB": "Had it been invaded from its sides, and they were asked to dissent, they would have done so with little hesitation."
    },
    {
      "verseNumber": 15,
      "verseString": "وَلَقَدْ كَانُوا عَاهَدُوا اللَّهَ مِنْ قَبْلُ لَا يُوَلُّونَ الْأَدْبَارَ ۚ وَكَانَ عَهْدُ اللَّهِ مَسْئُولًا",
      "verseStringB": "Although they had already promised Allah not to turn their backs. A promise to Allah is a responsibility."
    },
    {
      "verseNumber": 16,
      "verseString": "قُلْ لَنْ يَنْفَعَكُمُ الْفِرَارُ إِنْ فَرَرْتُمْ مِنَ الْمَوْتِ أَوِ الْقَتْلِ وَإِذًا لَا تُمَتَّعُونَ إِلَّا قَلِيلًا",
      "verseStringB": "Say, “Fleeing will not benefit you if you flee from death or killing. Even then, you will be given only brief enjoyment.”"
    },
    {
      "verseNumber": 17,
      "verseString": "قُلْ مَنْ ذَا الَّذِي يَعْصِمُكُمْ مِنَ اللَّهِ إِنْ أَرَادَ بِكُمْ سُوءًا أَوْ أَرَادَ بِكُمْ رَحْمَةً ۚ وَلَا يَجِدُونَ لَهُمْ مِنْ دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا",
      "verseStringB": "Say, “Who is it who will shield you from Allah, if He intends adversity for you, or intends mercy for you?” Besides Allah, they will find for themselves neither friend nor helper."
    },
    {
      "verseNumber": 18,
      "verseString": "قَدْ يَعْلَمُ اللَّهُ الْمُعَوِّقِينَ مِنْكُمْ وَالْقَائِلِينَ لِإِخْوَانِهِمْ هَلُمَّ إِلَيْنَا ۖ وَلَا يَأْتُونَ الْبَأْسَ إِلَّا قَلِيلًا",
      "verseStringB": "Allah knows the hinderers among you, and those who say to their brethren, “Come and join us.” Hardly do they mobilize for battle."
    },
    {
      "verseNumber": 19,
      "verseString": "أَشِحَّةً عَلَيْكُمْ ۖ فَإِذَا جَاءَ الْخَوْفُ رَأَيْتَهُمْ يَنْظُرُونَ إِلَيْكَ تَدُورُ أَعْيُنُهُمْ كَالَّذِي يُغْشَىٰ عَلَيْهِ مِنَ الْمَوْتِ ۖ فَإِذَا ذَهَبَ الْخَوْفُ سَلَقُوكُمْ بِأَلْسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى الْخَيْرِ ۚ أُولَٰئِكَ لَمْ يُؤْمِنُوا فَأَحْبَطَ اللَّهُ أَعْمَالَهُمْ ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا",
      "verseStringB": "They do not care about you. And when fear approaches, you see them staring at you—their eyes rolling—like someone fainting at death. Then, when fear subsides, they whip you with sharp tongues, resenting you any good. These have never believed, so Allah has nullified their works—and that is easy for Allah."
    },
    {
      "verseNumber": 20,
      "verseString": "يَحْسَبُونَ الْأَحْزَابَ لَمْ يَذْهَبُوا ۖ وَإِنْ يَأْتِ الْأَحْزَابُ يَوَدُّوا لَوْ أَنَّهُمْ بَادُونَ فِي الْأَعْرَابِ يَسْأَلُونَ عَنْ أَنْبَائِكُمْ ۖ وَلَوْ كَانُوا فِيكُمْ مَا قَاتَلُوا إِلَّا قَلِيلًا",
      "verseStringB": "They assumed that the Confederates have not withdrawn. But were the Confederates to advance, they would wish they were in the desert with the Bedouins, inquiring about your news. And if they were among you, they would not fight, except a little."
    },
    {
      "verseNumber": 21,
      "verseString": "لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ لِمَنْ كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ وَذَكَرَ اللَّهَ كَثِيرًا",
      "verseStringB": "You have in the Messenger of Allah an excellent example, for those who hope for Allah and the Last Day and remember Allah much."
    },
    {
      "verseNumber": 22,
      "verseString": "وَلَمَّا رَأَى الْمُؤْمِنُونَ الْأَحْزَابَ قَالُوا هَٰذَا مَا وَعَدَنَا اللَّهُ وَرَسُولُهُ وَصَدَقَ اللَّهُ وَرَسُولُهُ ۚ وَمَا زَادَهُمْ إِلَّا إِيمَانًا وَتَسْلِيمًا",
      "verseStringB": "And when the believers saw the confederates, they said, “This is what Allah and His Messenger have promised us, and Allah and His messenger have told the truth.” And it only increased them in faith and submission."
    },
    {
      "verseNumber": 23,
      "verseString": "مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ ۖ فَمِنْهُمْ مَنْ قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَنْ يَنْتَظِرُ ۖ وَمَا بَدَّلُوا تَبْدِيلًا",
      "verseStringB": "Among the believers are men true to their pledge before Allah. Some of them have fulfilled their vows, and some are still waiting, and never wavering."
    },
    {
      "verseNumber": 24,
      "verseString": "لِيَجْزِيَ اللَّهُ الصَّادِقِينَ بِصِدْقِهِمْ وَيُعَذِّبَ الْمُنَافِقِينَ إِنْ شَاءَ أَوْ يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا",
      "verseStringB": "So that Allah may reward the truthful for their truthfulness, and punish the hypocrites, if He wills, or accept their repentance. Allah is surely Forgiving and Merciful."
    },
    {
      "verseNumber": 25,
      "verseString": "وَرَدَّ اللَّهُ الَّذِينَ كَفَرُوا بِغَيْظِهِمْ لَمْ يَنَالُوا خَيْرًا ۚ وَكَفَى اللَّهُ الْمُؤْمِنِينَ الْقِتَالَ ۚ وَكَانَ اللَّهُ قَوِيًّا عَزِيزًا",
      "verseStringB": "And Allah drove back the unbelievers in their rage, and they gained no advantage. Allah thus spared the believers combat. Allah is Strong, Mighty."
    },
    {
      "verseNumber": 26,
      "verseString": "وَأَنْزَلَ الَّذِينَ ظَاهَرُوهُمْ مِنْ أَهْلِ الْكِتَابِ مِنْ صَيَاصِيهِمْ وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ فَرِيقًا تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقًا",
      "verseStringB": "And He brought the People of the Scripture who supported them down from their strongholds, and He threw horror in their hearts. Some of them you killed, and others you took captive."
    },
    {
      "verseNumber": 27,
      "verseString": "وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضًا لَمْ تَطَئُوهَا ۚ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرًا",
      "verseStringB": "And He made you inherit their land, and their homes, and their wealth, and a region you never stepped on. And Allah is capable of everything."
    },
    {
      "verseNumber": 28,
      "verseString": "يَا أَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلًا",
      "verseStringB": "O Prophet! Say to your wives, “If you desire the worldly life and its luxury, then come: I will compensate you, and release you kindly."
    },
    {
      "verseNumber": 29,
      "verseString": "وَإِنْ كُنْتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ وَالدَّارَ الْآخِرَةَ فَإِنَّ اللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا",
      "verseStringB": "But if you desire Allah and His Messenger, and the Home of the Hereafter: then Allah has prepared for the righteous among you a magnificent compensation.”"
    },
    {
      "verseNumber": 30,
      "verseString": "يَا نِسَاءَ النَّبِيِّ مَنْ يَأْتِ مِنْكُنَّ بِفَاحِشَةٍ مُبَيِّنَةٍ يُضَاعَفْ لَهَا الْعَذَابُ ضِعْفَيْنِ ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا",
      "verseStringB": "O wives of the Prophet! Whoever among you commits a proven indecency, her punishment will be doubled, and that is easy for Allah."
    },
    {
      "verseNumber": 31,
      "verseString": "وَمَنْ يَقْنُتْ مِنْكُنَّ لِلَّهِ وَرَسُولِهِ وَتَعْمَلْ صَالِحًا نُؤْتِهَا أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقًا كَرِيمًا",
      "verseStringB": "And whoever among you is devoutly obedient to Allah and His Messenger, and acts righteously: We will give her her reward twice over, and We have prepared for her a generous provision."
    },
    {
      "verseNumber": 32,
      "verseString": "يَا نِسَاءَ النَّبِيِّ لَسْتُنَّ كَأَحَدٍ مِنَ النِّسَاءِ ۚ إِنِ اتَّقَيْتُنَّ فَلَا تَخْضَعْنَ بِالْقَوْلِ فَيَطْمَعَ الَّذِي فِي قَلْبِهِ مَرَضٌ وَقُلْنَ قَوْلًا مَعْرُوفًا",
      "verseStringB": "O wives of the Prophet! You are not like any other women: if you observe piety. So do not speak too softly, lest the sick at heart lusts after you. But speak in an appropriate manner."
    },
    {
      "verseNumber": 33,
      "verseString": "وَقَرْنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجْنَ تَبَرُّجَ الْجَاهِلِيَّةِ الْأُولَىٰ ۖ وَأَقِمْنَ الصَّلَاةَ وَآتِينَ الزَّكَاةَ وَأَطِعْنَ اللَّهَ وَرَسُولَهُ ۚ إِنَّمَا يُرِيدُ اللَّهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيرًا",
      "verseStringB": "And settle in your homes; and do not display your beauty, as in the former days of ignorance. And perform the prayer, and give charity regularly, and obey Allah and His Messenger. Allah intends to remove all impurity from you, O People of the Household, and to purify you thoroughly."
    },
    {
      "verseNumber": 34,
      "verseString": "وَاذْكُرْنَ مَا يُتْلَىٰ فِي بُيُوتِكُنَّ مِنْ آيَاتِ اللَّهِ وَالْحِكْمَةِ ۚ إِنَّ اللَّهَ كَانَ لَطِيفًا خَبِيرًا",
      "verseStringB": "And remember what is recited in your homes from Allah's revelations and wisdom. Allah is Nice and Informed."
    },
    {
      "verseNumber": 35,
      "verseString": "إِنَّ الْمُسْلِمِينَ وَالْمُسْلِمَاتِ وَالْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَالْقَانِتِينَ وَالْقَانِتَاتِ وَالصَّادِقِينَ وَالصَّادِقَاتِ وَالصَّابِرِينَ وَالصَّابِرَاتِ وَالْخَاشِعِينَ وَالْخَاشِعَاتِ وَالْمُتَصَدِّقِينَ وَالْمُتَصَدِّقَاتِ وَالصَّائِمِينَ وَالصَّائِمَاتِ وَالْحَافِظِينَ فُرُوجَهُمْ وَالْحَافِظَاتِ وَالذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ أَعَدَّ اللَّهُ لَهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا",
      "verseStringB": "Submitting men and submitting women, believing men and believing women, devout men and devout women, truthful men and truthful women, patient men and patient women, humble men and humble women, charitable men and charitable women, men who fast and women who fast, men who guard their privates and women who guard, men who remember Allah frequently and women who remember—Allah has prepared for them forgiveness and a great reward."
    },
    {
      "verseNumber": 36,
      "verseString": "وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى اللَّهُ وَرَسُولُهُ أَمْرًا أَنْ يَكُونَ لَهُمُ الْخِيَرَةُ مِنْ أَمْرِهِمْ ۗ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلَالًا مُبِينًا",
      "verseStringB": "It is not for any believer, man or woman, when Allah and His Messenger have decided on an issue, to have the liberty of choice in their decision. Whoever disobeys Allah and His Messenger has gone far astray."
    },
    {
      "verseNumber": 37,
      "verseString": "وَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَاتَّقِ اللَّهَ وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَنْ تَخْشَاهُ ۖ فَلَمَّا قَضَىٰ زَيْدٌ مِنْهَا وَطَرًا زَوَّجْنَاكَهَا لِكَيْ لَا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ فِي أَزْوَاجِ أَدْعِيَائِهِمْ إِذَا قَضَوْا مِنْهُنَّ وَطَرًا ۚ وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا",
      "verseStringB": "When you said to him, whom Allah has blessed, and you have favored, “Keep your wife to yourself, and fear Allah.” But you hid within yourself what Allah was to disclose. And you feared the people, but it was Allah you were supposed to fear. Then, when Zaid ended his relationship with her, We gave her to you in marriage, so that there may be no restriction for believers regarding the wives of their adopted sons—when their relationship has ended. The command of Allah was fulfilled."
    },
    {
      "verseNumber": 38,
      "verseString": "مَا كَانَ عَلَى النَّبِيِّ مِنْ حَرَجٍ فِيمَا فَرَضَ اللَّهُ لَهُ ۖ سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا مِنْ قَبْلُ ۚ وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا",
      "verseStringB": "There is no restriction on the Prophet regarding what Allah has mandated for him. That is Allah’s pattern among those who passed before. The command of Allah is a mandated destiny."
    },
    {
      "verseNumber": 39,
      "verseString": "الَّذِينَ يُبَلِّغُونَ رِسَالَاتِ اللَّهِ وَيَخْشَوْنَهُ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا اللَّهَ ۗ وَكَفَىٰ بِاللَّهِ حَسِيبًا",
      "verseStringB": "Those who deliver the messages of Allah, and fear Him, and fear no one except Allah. Allah suffices as a Reckoner."
    },
    {
      "verseNumber": 40,
      "verseString": "مَا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِكُمْ وَلَٰكِنْ رَسُولَ اللَّهِ وَخَاتَمَ النَّبِيِّينَ ۗ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا",
      "verseStringB": "Muhammad is not the father of any of your men, but he is Allah’s Messenger, and the Seal of the prophets. And Allah knows everything."
    },
    {
      "verseNumber": 41,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا",
      "verseStringB": "O you who believe! Remember Allah with frequent remembrance."
    },
    {
      "verseNumber": 42,
      "verseString": "وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا",
      "verseStringB": "And glorify Him morning and evening."
    },
    {
      "verseNumber": 43,
      "verseString": "هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلَائِكَتُهُ لِيُخْرِجَكُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَكَانَ بِالْمُؤْمِنِينَ رَحِيمًا",
      "verseStringB": "It is He who reaches out to you, and His angels, to bring you out of darkness into light. He is Ever-Merciful towards the believers."
    },
    {
      "verseNumber": 44,
      "verseString": "تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلَامٌ ۚ وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا",
      "verseStringB": "Their greeting on the Day they meet Him is, “Peace,” and He has prepared for them a generous reward."
    },
    {
      "verseNumber": 45,
      "verseString": "يَا أَيُّهَا النَّبِيُّ إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا",
      "verseStringB": "O prophet! We sent you as a witness, and a deliverer of good news, and a warner."
    },
    {
      "verseNumber": 46,
      "verseString": "وَدَاعِيًا إِلَى اللَّهِ بِإِذْنِهِ وَسِرَاجًا مُنِيرًا",
      "verseStringB": "And a caller towards Allah, by His permission, and an illuminating beacon."
    },
    {
      "verseNumber": 47,
      "verseString": "وَبَشِّرِ الْمُؤْمِنِينَ بِأَنَّ لَهُمْ مِنَ اللَّهِ فَضْلًا كَبِيرًا",
      "verseStringB": "And give good news to the believers that they will have from Allah a great favor."
    },
    {
      "verseNumber": 48,
      "verseString": "وَلَا تُطِعِ الْكَافِرِينَ وَالْمُنَافِقِينَ وَدَعْ أَذَاهُمْ وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا",
      "verseStringB": "And do not obey the disbelievers and the hypocrites, and ignore their annoyances, and rely on Allah. Allah is a sufficient Protector."
    },
    {
      "verseNumber": 49,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نَكَحْتُمُ الْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ مِنْ قَبْلِ أَنْ تَمَسُّوهُنَّ فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا ۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحًا جَمِيلًا",
      "verseStringB": "O you who believe! When you marry believing women, but then divorce them before you have touched them, there is no waiting period for you to observe regarding them—but compensate them, and release them in a graceful manner."
    },
    {
      "verseNumber": 50,
      "verseString": "يَا أَيُّهَا النَّبِيُّ إِنَّا أَحْلَلْنَا لَكَ أَزْوَاجَكَ اللَّاتِي آتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّا أَفَاءَ اللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالَاتِكَ اللَّاتِي هَاجَرْنَ مَعَكَ وَامْرَأَةً مُؤْمِنَةً إِنْ وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ إِنْ أَرَادَ النَّبِيُّ أَنْ يَسْتَنْكِحَهَا خَالِصَةً لَكَ مِنْ دُونِ الْمُؤْمِنِينَ ۗ قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِي أَزْوَاجِهِمْ وَمَا مَلَكَتْ أَيْمَانُهُمْ لِكَيْلَا يَكُونَ عَلَيْكَ حَرَجٌ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "verseStringB": "O Prophet! We have made lawful for you your wives to whom you have given their compensations, and those you already have, as granted to you by Allah, and the daughters of your paternal uncle, and the daughters of your paternal aunts, and the daughters of your maternal uncle, and the daughters of your maternal aunts who migrated with you, and a believing woman who offered herself to the Prophet, if the Prophet desires to marry her, exclusively for you, and not for the believers. We also know what We mandated to them regarding their wives and those their right hands possess. This is to spare you any difficulty. Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 51,
      "verseString": "تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ ۖ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَ ۚ ذَٰلِكَ أَدْنَىٰ أَنْ تَقَرَّ أَعْيُنُهُنَّ وَلَا يَحْزَنَّ وَيَرْضَيْنَ بِمَا آتَيْتَهُنَّ كُلُّهُنَّ ۚ وَاللَّهُ يَعْلَمُ مَا فِي قُلُوبِكُمْ ۚ وَكَانَ اللَّهُ عَلِيمًا حَلِيمًا",
      "verseStringB": "You may put off any of them you wish, and invite any of them you wish. There is no blame on you if you desire any of those you had set aside. This is more proper, so that they will be comforted, and not be saddened, and be content with what you have given each of them. Allah knows what is within your hearts. And Allah is Knowledgeable and Patient."
    },
    {
      "verseNumber": 52,
      "verseString": "لَا يَحِلُّ لَكَ النِّسَاءُ مِنْ بَعْدُ وَلَا أَنْ تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلَّا مَا مَلَكَتْ يَمِينُكَ ۗ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ رَقِيبًا",
      "verseStringB": "Beyond that, no other women are permissible for you, nor can you exchange them for other wives, even if you admire their beauty, except those you already have. Allah is Watchful over everything."
    },
    {
      "verseNumber": 53,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَٰكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلَا مُسْتَأْنِسِينَ لِحَدِيثٍ ۚ إِنَّ ذَٰلِكُمْ كَانَ يُؤْذِي النَّبِيَّ فَيَسْتَحْيِي مِنْكُمْ ۖ وَاللَّهُ لَا يَسْتَحْيِي مِنَ الْحَقِّ ۚ وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعًا فَاسْأَلُوهُنَّ مِنْ وَرَاءِ حِجَابٍ ۚ ذَٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ ۚ وَمَا كَانَ لَكُمْ أَنْ تُؤْذُوا رَسُولَ اللَّهِ وَلَا أَنْ تَنْكِحُوا أَزْوَاجَهُ مِنْ بَعْدِهِ أَبَدًا ۚ إِنَّ ذَٰلِكُمْ كَانَ عِنْدَ اللَّهِ عَظِيمًا",
      "verseStringB": "O you who believe! Do not enter the Prophet's homes for a meal, unless you are invited, and do not wait for its preparation. But if you are invited, then enter. And when you have eaten, then disperse, without lingering for conversation. This irritates the Prophet, and he shies away from you, but Allah does not shy away from the truth. And when you ask his wives for something, ask them from behind a screen; that is purer for your hearts and their hearts. You must never offend Allah’s Messenger, nor marry his wives after him, ever, for that would be an enormity with Allah."
    },
    {
      "verseNumber": 54,
      "verseString": "إِنْ تُبْدُوا شَيْئًا أَوْ تُخْفُوهُ فَإِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا",
      "verseStringB": "Whether you disclose a thing, or you hide it, Allah is Knower of all things."
    },
    {
      "verseNumber": 55,
      "verseString": "لَا جُنَاحَ عَلَيْهِنَّ فِي آبَائِهِنَّ وَلَا أَبْنَائِهِنَّ وَلَا إِخْوَانِهِنَّ وَلَا أَبْنَاءِ إِخْوَانِهِنَّ وَلَا أَبْنَاءِ أَخَوَاتِهِنَّ وَلَا نِسَائِهِنَّ وَلَا مَا مَلَكَتْ أَيْمَانُهُنَّ ۗ وَاتَّقِينَ اللَّهَ ۚ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدًا",
      "verseStringB": "There is no blame on them concerning their fathers, or their sons, or their brothers, or their brothers’ sons, or their sisters’ sons, or their women, or their servants. But they should remain conscious of Allah. Allah is Witness over everything."
    },
    {
      "verseNumber": 56,
      "verseString": "إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا",
      "verseStringB": "Allah and His angels send blessings to the Prophet. O you who believe, call for blessings on him, and for greetings of peace."
    },
    {
      "verseNumber": 57,
      "verseString": "إِنَّ الَّذِينَ يُؤْذُونَ اللَّهَ وَرَسُولَهُ لَعَنَهُمُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ وَأَعَدَّ لَهُمْ عَذَابًا مُهِينًا",
      "verseStringB": "Those who insult Allah and His Messenger: Allah curses them in this life and in the Hereafter, and He has prepared for them a humiliating punishment."
    },
    {
      "verseNumber": 58,
      "verseString": "وَالَّذِينَ يُؤْذُونَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ بِغَيْرِ مَا اكْتَسَبُوا فَقَدِ احْتَمَلُوا بُهْتَانًا وَإِثْمًا مُبِينًا",
      "verseStringB": "Those who harm believing men and believing women, for acts they did not commit, bear the burden of perjury and blatant sin."
    },
    {
      "verseNumber": 59,
      "verseString": "يَا أَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ وَبَنَاتِكَ وَنِسَاءِ الْمُؤْمِنِينَ يُدْنِينَ عَلَيْهِنَّ مِنْ جَلَابِيبِهِنَّ ۚ ذَٰلِكَ أَدْنَىٰ أَنْ يُعْرَفْنَ فَلَا يُؤْذَيْنَ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "verseStringB": "O Prophet! Tell your wives, and your daughters, and the believers’ women to lengthen their garments. That is more proper, so they will be recognized and not be harassed. Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 60,
      "verseString": "لَئِنْ لَمْ يَنْتَهِ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ وَالْمُرْجِفُونَ فِي الْمَدِينَةِ لَنُغْرِيَنَّكَ بِهِمْ ثُمَّ لَا يُجَاوِرُونَكَ فِيهَا إِلَّا قَلِيلًا",
      "verseStringB": "If the hypocrites, and the sick at heart, and the rumormongers in Medina, do not desist, We will incite you against them, and then they will not be your neighbors there much longer."
    },
    {
      "verseNumber": 61,
      "verseString": "مَلْعُونِينَ ۖ أَيْنَمَا ثُقِفُوا أُخِذُوا وَقُتِّلُوا تَقْتِيلًا",
      "verseStringB": "They are cursed. Wherever they are found, they should be captured and killed outright."
    },
    {
      "verseNumber": 62,
      "verseString": "سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا مِنْ قَبْلُ ۖ وَلَنْ تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلًا",
      "verseStringB": "Such has been Allah’s precedent with those who have gone before. You will find no change in Allah’s system."
    },
    {
      "verseNumber": 63,
      "verseString": "يَسْأَلُكَ النَّاسُ عَنِ السَّاعَةِ ۖ قُلْ إِنَّمَا عِلْمُهَا عِنْدَ اللَّهِ ۚ وَمَا يُدْرِيكَ لَعَلَّ السَّاعَةَ تَكُونُ قَرِيبًا",
      "verseStringB": "The people ask you about the Hour. Say, “Knowledge thereof rests with Allah. But you never know, perhaps the Hour is near.”"
    },
    {
      "verseNumber": 64,
      "verseString": "إِنَّ اللَّهَ لَعَنَ الْكَافِرِينَ وَأَعَدَّ لَهُمْ سَعِيرًا",
      "verseStringB": "Allah has cursed the unbelievers and has prepared for them a Blaze."
    },
    {
      "verseNumber": 65,
      "verseString": "خَالِدِينَ فِيهَا أَبَدًا ۖ لَا يَجِدُونَ وَلِيًّا وَلَا نَصِيرًا",
      "verseStringB": "To stay in there forever—they will find no protector or helper."
    },
    {
      "verseNumber": 66,
      "verseString": "يَوْمَ تُقَلَّبُ وُجُوهُهُمْ فِي النَّارِ يَقُولُونَ يَا لَيْتَنَا أَطَعْنَا اللَّهَ وَأَطَعْنَا الرَّسُولَا",
      "verseStringB": "On the Day when their faces are flipped in the Fire, they will say, “If only we had obeyed Allah, and obeyed the Messenger.”"
    },
    {
      "verseNumber": 67,
      "verseString": "وَقَالُوا رَبَّنَا إِنَّا أَطَعْنَا سَادَتَنَا وَكُبَرَاءَنَا فَأَضَلُّونَا السَّبِيلَا",
      "verseStringB": "And they will say, “Our Lord, we have obeyed our superiors and our dignitaries, but they led us away from the way."
    },
    {
      "verseNumber": 68,
      "verseString": "رَبَّنَا آتِهِمْ ضِعْفَيْنِ مِنَ الْعَذَابِ وَالْعَنْهُمْ لَعْنًا كَبِيرًا",
      "verseStringB": "Our Lord, give them double the punishment, and curse them with a great curse.”"
    },
    {
      "verseNumber": 69,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَكُونُوا كَالَّذِينَ آذَوْا مُوسَىٰ فَبَرَّأَهُ اللَّهُ مِمَّا قَالُوا ۚ وَكَانَ عِنْدَ اللَّهِ وَجِيهًا",
      "verseStringB": "O you who believe! Do not be like those who slandered Moses, but Allah cleared him of what they said. He was distinguished with Allah."
    },
    {
      "verseNumber": 70,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا",
      "verseStringB": "O you who believe! Be conscious of Allah, and speak in a straightforward manner."
    },
    {
      "verseNumber": 71,
      "verseString": "يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا",
      "verseStringB": "He will rectify your conduct for you, and He will forgive you your sins. Whoever obeys Allah and His Messenger has achieved great success."
    },
    {
      "verseNumber": 72,
      "verseString": "إِنَّا عَرَضْنَا الْأَمَانَةَ عَلَى السَّمَاوَاتِ وَالْأَرْضِ وَالْجِبَالِ فَأَبَيْنَ أَنْ يَحْمِلْنَهَا وَأَشْفَقْنَ مِنْهَا وَحَمَلَهَا الْإِنْسَانُ ۖ إِنَّهُ كَانَ ظَلُومًا جَهُولًا",
      "verseStringB": "We offered the Trust to the heavens and the earth and the mountains. But they refused to undertake it, and were apprehensive of it. Yet the human being undertook it. He has always been unfair and ignorant."
    },
    {
      "verseNumber": 73,
      "verseString": "لِيُعَذِّبَ اللَّهُ الْمُنَافِقِينَ وَالْمُنَافِقَاتِ وَالْمُشْرِكِينَ وَالْمُشْرِكَاتِ وَيَتُوبَ اللَّهُ عَلَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "verseStringB": "So that Allah may punish the hypocritical men and the hypocritical women, and the idolatrous men and the idolatrous women, and so that Allah may relent towards the believing men and the believing women. Allah is Ever-Forgiving, Most-Merciful."
    }
  ],
  "nameEnglish": "The Confederates",
  "nameTrans": "al-Ahzab",
  "nameArabic": "الأحزاب",
  "chapterNumber": 33,
  "nVerses": 73
}