{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "ص ۚ وَالْقُرْآنِ ذِي الذِّكْرِ",
      "verseStringB": "Saad. By the Quran, full of reminders."
    },
    {
      "verseNumber": 2,
      "verseString": "بَلِ الَّذِينَ كَفَرُوا فِي عِزَّةٍ وَشِقَاقٍ",
      "verseStringB": "Those who disbelieve are in arrogance and schism."
    },
    {
      "verseNumber": 3,
      "verseString": "كَمْ أَهْلَكْنَا مِنْ قَبْلِهِمْ مِنْ قَرْنٍ فَنَادَوْا وَلَاتَ حِينَ مَنَاصٍ",
      "verseStringB": "How many generations before them did We destroy? They cried out when it was too late to escape."
    },
    {
      "verseNumber": 4,
      "verseString": "وَعَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ ۖ وَقَالَ الْكَافِرُونَ هَٰذَا سَاحِرٌ كَذَّابٌ",
      "verseStringB": "And they marvel that a warner from among them came to them. The disbelievers said, “This is a lying sorcerer.”"
    },
    {
      "verseNumber": 5,
      "verseString": "أَجَعَلَ الْآلِهَةَ إِلَٰهًا وَاحِدًا ۖ إِنَّ هَٰذَا لَشَيْءٌ عُجَابٌ",
      "verseStringB": "“Did he make the gods one God? This is something strange.”"
    },
    {
      "verseNumber": 6,
      "verseString": "وَانْطَلَقَ الْمَلَأُ مِنْهُمْ أَنِ امْشُوا وَاصْبِرُوا عَلَىٰ آلِهَتِكُمْ ۖ إِنَّ هَٰذَا لَشَيْءٌ يُرَادُ",
      "verseStringB": "And the notables among them announced: “Go on, and hold fast to your gods, this is something planned."
    },
    {
      "verseNumber": 7,
      "verseString": "مَا سَمِعْنَا بِهَٰذَا فِي الْمِلَّةِ الْآخِرَةِ إِنْ هَٰذَا إِلَّا اخْتِلَاقٌ",
      "verseStringB": "We never heard of this in the former faith. This is nothing but an invention."
    },
    {
      "verseNumber": 8,
      "verseString": "أَأُنْزِلَ عَلَيْهِ الذِّكْرُ مِنْ بَيْنِنَا ۚ بَلْ هُمْ فِي شَكٍّ مِنْ ذِكْرِي ۖ بَلْ لَمَّا يَذُوقُوا عَذَابِ",
      "verseStringB": "Was the message sent down to him, out of all of us?” In fact, they are doubtful of My message. In fact, they have not yet tasted My punishment."
    },
    {
      "verseNumber": 9,
      "verseString": "أَمْ عِنْدَهُمْ خَزَائِنُ رَحْمَةِ رَبِّكَ الْعَزِيزِ الْوَهَّابِ",
      "verseStringB": "Or do they possess the treasuries of your Lord's mercy—the Majestic, the Giver?"
    },
    {
      "verseNumber": 10,
      "verseString": "أَمْ لَهُمْ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۖ فَلْيَرْتَقُوا فِي الْأَسْبَابِ",
      "verseStringB": "Or do they possess the sovereignty of the heavens and the earth and what is between them? Then let them ascend by some means."
    },
    {
      "verseNumber": 11,
      "verseString": "جُنْدٌ مَا هُنَالِكَ مَهْزُومٌ مِنَ الْأَحْزَابِ",
      "verseStringB": "An army of confederates will be defeated there."
    },
    {
      "verseNumber": 12,
      "verseString": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَفِرْعَوْنُ ذُو الْأَوْتَادِ",
      "verseStringB": "Before them, the people of Noah denied; as did Aad, and Pharaoh of the Stakes."
    },
    {
      "verseNumber": 13,
      "verseString": "وَثَمُودُ وَقَوْمُ لُوطٍ وَأَصْحَابُ الْأَيْكَةِ ۚ أُولَٰئِكَ الْأَحْزَابُ",
      "verseStringB": "And Thamood, and the people of Lot, and the woods-dwellers: these are the parties."
    },
    {
      "verseNumber": 14,
      "verseString": "إِنْ كُلٌّ إِلَّا كَذَّبَ الرُّسُلَ فَحَقَّ عِقَابِ",
      "verseStringB": "None of them but denied the messengers, so My punishment was justified."
    },
    {
      "verseNumber": 15,
      "verseString": "وَمَا يَنْظُرُ هَٰؤُلَاءِ إِلَّا صَيْحَةً وَاحِدَةً مَا لَهَا مِنْ فَوَاقٍ",
      "verseStringB": "These can expect but a single blast, from which there is no recovery."
    },
    {
      "verseNumber": 16,
      "verseString": "وَقَالُوا رَبَّنَا عَجِّلْ لَنَا قِطَّنَا قَبْلَ يَوْمِ الْحِسَابِ",
      "verseStringB": "And they say, “Our Lord, advance for us our share, before the Day of Account.”"
    },
    {
      "verseNumber": 17,
      "verseString": "اصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاذْكُرْ عَبْدَنَا دَاوُودَ ذَا الْأَيْدِ ۖ إِنَّهُ أَوَّابٌ",
      "verseStringB": "Be patient in the face of what they say, and mention Our servant David, the resourceful. He was obedient."
    },
    {
      "verseNumber": 18,
      "verseString": "إِنَّا سَخَّرْنَا الْجِبَالَ مَعَهُ يُسَبِّحْنَ بِالْعَشِيِّ وَالْإِشْرَاقِ",
      "verseStringB": "We committed the mountains to praise with him, in the evening and at sunrise."
    },
    {
      "verseNumber": 19,
      "verseString": "وَالطَّيْرَ مَحْشُورَةً ۖ كُلٌّ لَهُ أَوَّابٌ",
      "verseStringB": "And the birds, flocking together—all obedient to him."
    },
    {
      "verseNumber": 20,
      "verseString": "وَشَدَدْنَا مُلْكَهُ وَآتَيْنَاهُ الْحِكْمَةَ وَفَصْلَ الْخِطَابِ",
      "verseStringB": "And We strengthened his kingdom, and We gave him wisdom and decisive speech."
    },
    {
      "verseNumber": 21,
      "verseString": "وَهَلْ أَتَاكَ نَبَأُ الْخَصْمِ إِذْ تَسَوَّرُوا الْمِحْرَابَ",
      "verseStringB": "Has the story of the two disputants reached you, when they scaled the sanctuary?"
    },
    {
      "verseNumber": 22,
      "verseString": "إِذْ دَخَلُوا عَلَىٰ دَاوُودَ فَفَزِعَ مِنْهُمْ ۖ قَالُوا لَا تَخَفْ ۖ خَصْمَانِ بَغَىٰ بَعْضُنَا عَلَىٰ بَعْضٍ فَاحْكُمْ بَيْنَنَا بِالْحَقِّ وَلَا تُشْطِطْ وَاهْدِنَا إِلَىٰ سَوَاءِ الصِّرَاطِ",
      "verseStringB": "When they entered upon David, he was startled by them. They said, “Do not fear. Two disputants: one of us has wronged the other, so judge between us fairly, and do not be biased, and guide us in the right way.”"
    },
    {
      "verseNumber": 23,
      "verseString": "إِنَّ هَٰذَا أَخِي لَهُ تِسْعٌ وَتِسْعُونَ نَعْجَةً وَلِيَ نَعْجَةٌ وَاحِدَةٌ فَقَالَ أَكْفِلْنِيهَا وَعَزَّنِي فِي الْخِطَابِ",
      "verseStringB": "“This brother of mine has ninety-nine ewes, and I have one ewe. Yet he said, ‘Place it under my care,’ and he pressured me with speech.”"
    },
    {
      "verseNumber": 24,
      "verseString": "قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلَىٰ نِعَاجِهِ ۖ وَإِنَّ كَثِيرًا مِنَ الْخُلَطَاءِ لَيَبْغِي بَعْضُهُمْ عَلَىٰ بَعْضٍ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَقَلِيلٌ مَا هُمْ ۗ وَظَنَّ دَاوُودُ أَنَّمَا فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ ۩",
      "verseStringB": "He said, “He has wronged you by asking that your ewe be added to his ewes. And many partners wrong one another, except those who believe and do righteous deeds—but these are so few.” And David realized that We were testing him, so he sought forgiveness from his Lord, fell down kneeling, and repented."
    },
    {
      "verseNumber": 25,
      "verseString": "فَغَفَرْنَا لَهُ ذَٰلِكَ ۖ وَإِنَّ لَهُ عِنْدَنَا لَزُلْفَىٰ وَحُسْنَ مَآبٍ",
      "verseStringB": "So We forgave him that. And for him is nearness to Us—and a beautiful return."
    },
    {
      "verseNumber": 26,
      "verseString": "يَا دَاوُودُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَنْ سَبِيلِ اللَّهِ ۚ إِنَّ الَّذِينَ يَضِلُّونَ عَنْ سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا يَوْمَ الْحِسَابِ",
      "verseStringB": "“O David, We made you a steward over this land, so judge between the people with justice, and do not follow the desire, lest it diverts you from Allah’s path. Those who stray from Allah’s path will have a severe punishment, for having ignored the Day of Account.”"
    },
    {
      "verseNumber": 27,
      "verseString": "وَمَا خَلَقْنَا السَّمَاءَ وَالْأَرْضَ وَمَا بَيْنَهُمَا بَاطِلًا ۚ ذَٰلِكَ ظَنُّ الَّذِينَ كَفَرُوا ۚ فَوَيْلٌ لِلَّذِينَ كَفَرُوا مِنَ النَّارِ",
      "verseStringB": "We did not create the heaven and the earth and everything between them in vain. That is the assumption of those who disbelieve—so woe to those who disbelieve because of the Fire."
    },
    {
      "verseNumber": 28,
      "verseString": "أَمْ نَجْعَلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ كَالْمُفْسِدِينَ فِي الْأَرْضِ أَمْ نَجْعَلُ الْمُتَّقِينَ كَالْفُجَّارِ",
      "verseStringB": "Or shall We make those who believe and perform righteous deeds like those who work corruption on earth? Or shall We make the reverent like the shameless?"
    },
    {
      "verseNumber": 29,
      "verseString": "كِتَابٌ أَنْزَلْنَاهُ إِلَيْكَ مُبَارَكٌ لِيَدَّبَّرُوا آيَاتِهِ وَلِيَتَذَكَّرَ أُولُو الْأَلْبَابِ",
      "verseStringB": "A blessed Book that We sent down to you, so that they may ponder its Verses, and so that the people of understanding may reflect."
    },
    {
      "verseNumber": 30,
      "verseString": "وَوَهَبْنَا لِدَاوُودَ سُلَيْمَانَ ۚ نِعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ",
      "verseStringB": "And to David, We gave Solomon—what an excellent servant. He was penitent."
    },
    {
      "verseNumber": 31,
      "verseString": "إِذْ عُرِضَ عَلَيْهِ بِالْعَشِيِّ الصَّافِنَاتُ الْجِيَادُ",
      "verseStringB": "When the beautiful horses were paraded before him in the evening."
    },
    {
      "verseNumber": 32,
      "verseString": "فَقَالَ إِنِّي أَحْبَبْتُ حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّي حَتَّىٰ تَوَارَتْ بِالْحِجَابِ",
      "verseStringB": "He said, “I have preferred the love of niceties over the remembrance of my Lord—until they disappeared behind the veil."
    },
    {
      "verseNumber": 33,
      "verseString": "رُدُّوهَا عَلَيَّ ۖ فَطَفِقَ مَسْحًا بِالسُّوقِ وَالْأَعْنَاقِ",
      "verseStringB": "Bring them back to me.” And he began caressing their legs and necks."
    },
    {
      "verseNumber": 34,
      "verseString": "وَلَقَدْ فَتَنَّا سُلَيْمَانَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِ جَسَدًا ثُمَّ أَنَابَ",
      "verseStringB": "And We tested Solomon, and We placed a body on his throne. Then he repented."
    },
    {
      "verseNumber": 35,
      "verseString": "قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِي ۖ إِنَّكَ أَنْتَ الْوَهَّابُ",
      "verseStringB": "He said, “My Lord, forgive me, and grant me a kingdom never to be attained by anyone after me. You are the Giver.”"
    },
    {
      "verseNumber": 36,
      "verseString": "فَسَخَّرْنَا لَهُ الرِّيحَ تَجْرِي بِأَمْرِهِ رُخَاءً حَيْثُ أَصَابَ",
      "verseStringB": "So We placed the wind at his service, blowing gently by his command, wherever he wanted."
    },
    {
      "verseNumber": 37,
      "verseString": "وَالشَّيَاطِينَ كُلَّ بَنَّاءٍ وَغَوَّاصٍ",
      "verseStringB": "And the devils—every builder and diver."
    },
    {
      "verseNumber": 38,
      "verseString": "وَآخَرِينَ مُقَرَّنِينَ فِي الْأَصْفَادِ",
      "verseStringB": "And others shackled in chains."
    },
    {
      "verseNumber": 39,
      "verseString": "هَٰذَا عَطَاؤُنَا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ",
      "verseStringB": "“This is Our gift. So give generously, or withhold, without an account.”"
    },
    {
      "verseNumber": 40,
      "verseString": "وَإِنَّ لَهُ عِنْدَنَا لَزُلْفَىٰ وَحُسْنَ مَآبٍ",
      "verseStringB": "And for him is nearness to Us—and a beautiful resort."
    },
    {
      "verseNumber": 41,
      "verseString": "وَاذْكُرْ عَبْدَنَا أَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ",
      "verseStringB": "And mention Our servant Job, when he called upon his Lord, “Satan has touched me with distress and suffering.”"
    },
    {
      "verseNumber": 42,
      "verseString": "ارْكُضْ بِرِجْلِكَ ۖ هَٰذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ",
      "verseStringB": "“Stomp with your foot—this is cool water to wash with, and to drink.”"
    },
    {
      "verseNumber": 43,
      "verseString": "وَوَهَبْنَا لَهُ أَهْلَهُ وَمِثْلَهُمْ مَعَهُمْ رَحْمَةً مِنَّا وَذِكْرَىٰ لِأُولِي الْأَلْبَابِ",
      "verseStringB": "And We restored his family to him, and their like with them, as a mercy from Us, and a lesson for those who possess insight."
    },
    {
      "verseNumber": 44,
      "verseString": "وَخُذْ بِيَدِكَ ضِغْثًا فَاضْرِبْ بِهِ وَلَا تَحْنَثْ ۗ إِنَّا وَجَدْنَاهُ صَابِرًا ۚ نِعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ",
      "verseStringB": "“Take with your hand a bundle, and strike with it, and do not break your oath.” We found him patient. What an excellent servant! He was repentant."
    },
    {
      "verseNumber": 45,
      "verseString": "وَاذْكُرْ عِبَادَنَا إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ أُولِي الْأَيْدِي وَالْأَبْصَارِ",
      "verseStringB": "And mention Our servants Abraham, Isaac, and Jacob—endowed with ability and vision."
    },
    {
      "verseNumber": 46,
      "verseString": "إِنَّا أَخْلَصْنَاهُمْ بِخَالِصَةٍ ذِكْرَى الدَّارِ",
      "verseStringB": "We distinguished them with a distinct quality: the remembrance of the Home."
    },
    {
      "verseNumber": 47,
      "verseString": "وَإِنَّهُمْ عِنْدَنَا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيَارِ",
      "verseStringB": "To Us: they are among the chosen, the outstanding."
    },
    {
      "verseNumber": 48,
      "verseString": "وَاذْكُرْ إِسْمَاعِيلَ وَالْيَسَعَ وَذَا الْكِفْلِ ۖ وَكُلٌّ مِنَ الْأَخْيَارِ",
      "verseStringB": "And mention Ishmael, Elisha, and Ezekiel: each is among the outstanding."
    },
    {
      "verseNumber": 49,
      "verseString": "هَٰذَا ذِكْرٌ ۚ وَإِنَّ لِلْمُتَّقِينَ لَحُسْنَ مَآبٍ",
      "verseStringB": "This is a reminder. The devout will have a good place of return."
    },
    {
      "verseNumber": 50,
      "verseString": "جَنَّاتِ عَدْنٍ مُفَتَّحَةً لَهُمُ الْأَبْوَابُ",
      "verseStringB": "The Gardens of Eternity, with the doors, opened for them."
    },
    {
      "verseNumber": 51,
      "verseString": "مُتَّكِئِينَ فِيهَا يَدْعُونَ فِيهَا بِفَاكِهَةٍ كَثِيرَةٍ وَشَرَابٍ",
      "verseStringB": "Relaxing in them—and calling for abundant fruit and beverage."
    },
    {
      "verseNumber": 52,
      "verseString": "وَعِنْدَهُمْ قَاصِرَاتُ الطَّرْفِ أَتْرَابٌ",
      "verseStringB": "And with them will be attendants with a modest gaze, of equal age."
    },
    {
      "verseNumber": 53,
      "verseString": "هَٰذَا مَا تُوعَدُونَ لِيَوْمِ الْحِسَابِ",
      "verseStringB": "This is what you are promised for the Day of Account."
    },
    {
      "verseNumber": 54,
      "verseString": "إِنَّ هَٰذَا لَرِزْقُنَا مَا لَهُ مِنْ نَفَادٍ",
      "verseStringB": "This is Our bounty—inexhaustible."
    },
    {
      "verseNumber": 55,
      "verseString": "هَٰذَا ۚ وَإِنَّ لِلطَّاغِينَ لَشَرَّ مَآبٍ",
      "verseStringB": "All This. But the transgressors will have a miserable return."
    },
    {
      "verseNumber": 56,
      "verseString": "جَهَنَّمَ يَصْلَوْنَهَا فَبِئْسَ الْمِهَادُ",
      "verseStringB": "Hell—in which they will roast—what a miserable place of return."
    },
    {
      "verseNumber": 57,
      "verseString": "هَٰذَا فَلْيَذُوقُوهُ حَمِيمٌ وَغَسَّاقٌ",
      "verseStringB": "All this. Let them taste it—boiling and bitter cold."
    },
    {
      "verseNumber": 58,
      "verseString": "وَآخَرُ مِنْ شَكْلِهِ أَزْوَاجٌ",
      "verseStringB": "And similar torments of diverse kinds."
    },
    {
      "verseNumber": 59,
      "verseString": "هَٰذَا فَوْجٌ مُقْتَحِمٌ مَعَكُمْ ۖ لَا مَرْحَبًا بِهِمْ ۚ إِنَّهُمْ صَالُو النَّارِ",
      "verseStringB": "“This is a crowd rushing headlong with you.” No welcome for them. They will be scorched by the Fire."
    },
    {
      "verseNumber": 60,
      "verseString": "قَالُوا بَلْ أَنْتُمْ لَا مَرْحَبًا بِكُمْ ۖ أَنْتُمْ قَدَّمْتُمُوهُ لَنَا ۖ فَبِئْسَ الْقَرَارُ",
      "verseStringB": "They will say, “But it is you. No welcome for you. You brought it upon us. What a miserable end.”"
    },
    {
      "verseNumber": 61,
      "verseString": "قَالُوا رَبَّنَا مَنْ قَدَّمَ لَنَا هَٰذَا فَزِدْهُ عَذَابًا ضِعْفًا فِي النَّارِ",
      "verseStringB": "They will say, “Our Lord, whoever brought this upon us, give him double suffering in the Fire.”"
    },
    {
      "verseNumber": 62,
      "verseString": "وَقَالُوا مَا لَنَا لَا نَرَىٰ رِجَالًا كُنَّا نَعُدُّهُمْ مِنَ الْأَشْرَارِ",
      "verseStringB": "And they will say, “What is the matter with us, that we do not see men whom we used to count among the wicked?"
    },
    {
      "verseNumber": 63,
      "verseString": "أَتَّخَذْنَاهُمْ سِخْرِيًّا أَمْ زَاغَتْ عَنْهُمُ الْأَبْصَارُ",
      "verseStringB": "Did we take them for mockery? Or did the eyes overlook them?”"
    },
    {
      "verseNumber": 64,
      "verseString": "إِنَّ ذَٰلِكَ لَحَقٌّ تَخَاصُمُ أَهْلِ النَّارِ",
      "verseStringB": "This is certainly true—the feuding of the people of the Fire."
    },
    {
      "verseNumber": 65,
      "verseString": "قُلْ إِنَّمَا أَنَا مُنْذِرٌ ۖ وَمَا مِنْ إِلَٰهٍ إِلَّا اللَّهُ الْوَاحِدُ الْقَهَّارُ",
      "verseStringB": "Say, “I am only a warner, and there is no god except Allah—the One, the Conqueror."
    },
    {
      "verseNumber": 66,
      "verseString": "رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيزُ الْغَفَّارُ",
      "verseStringB": "The Lord of the heavens and the earth and everything between them—the Mighty, the Forgiver.”"
    },
    {
      "verseNumber": 67,
      "verseString": "قُلْ هُوَ نَبَأٌ عَظِيمٌ",
      "verseStringB": "Say, “It is a message of great importance."
    },
    {
      "verseNumber": 68,
      "verseString": "أَنْتُمْ عَنْهُ مُعْرِضُونَ",
      "verseStringB": "From which you are turning away."
    },
    {
      "verseNumber": 69,
      "verseString": "مَا كَانَ لِيَ مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلَىٰ إِذْ يَخْتَصِمُونَ",
      "verseStringB": "I have no knowledge of the Highest Assembly as they dispute."
    },
    {
      "verseNumber": 70,
      "verseString": "إِنْ يُوحَىٰ إِلَيَّ إِلَّا أَنَّمَا أَنَا نَذِيرٌ مُبِينٌ",
      "verseStringB": "It is only revealed to me that I am a clear warner.”"
    },
    {
      "verseNumber": 71,
      "verseString": "إِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي خَالِقٌ بَشَرًا مِنْ طِينٍ",
      "verseStringB": "Your Lord said to the angels, “I am creating a human being from clay."
    },
    {
      "verseNumber": 72,
      "verseString": "فَإِذَا سَوَّيْتُهُ وَنَفَخْتُ فِيهِ مِنْ رُوحِي فَقَعُوا لَهُ سَاجِدِينَ",
      "verseStringB": "When I have proportioned him, and breathed into him of My spirit, fall down in prostration to him.”"
    },
    {
      "verseNumber": 73,
      "verseString": "فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ",
      "verseStringB": "So the angels prostrated, all of them together."
    },
    {
      "verseNumber": 74,
      "verseString": "إِلَّا إِبْلِيسَ اسْتَكْبَرَ وَكَانَ مِنَ الْكَافِرِينَ",
      "verseStringB": "Except for Iblis. He was too proud, and one of the faithless."
    },
    {
      "verseNumber": 75,
      "verseString": "قَالَ يَا إِبْلِيسُ مَا مَنَعَكَ أَنْ تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ ۖ أَسْتَكْبَرْتَ أَمْ كُنْتَ مِنَ الْعَالِينَ",
      "verseStringB": "He said, “O Iblis, what prevented you from prostrating before what I created with My Hands? Are you too proud, or are you among the exalted?”"
    },
    {
      "verseNumber": 76,
      "verseString": "قَالَ أَنَا خَيْرٌ مِنْهُ ۖ خَلَقْتَنِي مِنْ نَارٍ وَخَلَقْتَهُ مِنْ طِينٍ",
      "verseStringB": "He said, “I am better than he. You created me from fire, and You created him from clay.”"
    },
    {
      "verseNumber": 77,
      "verseString": "قَالَ فَاخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ",
      "verseStringB": "He said, “Then get out of here. You are an outcast."
    },
    {
      "verseNumber": 78,
      "verseString": "وَإِنَّ عَلَيْكَ لَعْنَتِي إِلَىٰ يَوْمِ الدِّينِ",
      "verseStringB": "And My curse is upon you until Judgement Day.”"
    },
    {
      "verseNumber": 79,
      "verseString": "قَالَ رَبِّ فَأَنْظِرْنِي إِلَىٰ يَوْمِ يُبْعَثُونَ",
      "verseStringB": "He said, “My Lord, defer me until the Day they are resurrected.”"
    },
    {
      "verseNumber": 80,
      "verseString": "قَالَ فَإِنَّكَ مِنَ الْمُنْظَرِينَ",
      "verseStringB": "He said, “You will be deferred."
    },
    {
      "verseNumber": 81,
      "verseString": "إِلَىٰ يَوْمِ الْوَقْتِ الْمَعْلُومِ",
      "verseStringB": "Until the Day of the time well-known.”"
    },
    {
      "verseNumber": 82,
      "verseString": "قَالَ فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ",
      "verseStringB": "He said, “By Your Majesty, I will seduce them all."
    },
    {
      "verseNumber": 83,
      "verseString": "إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ",
      "verseStringB": "Except for your devoted servants among them.”"
    },
    {
      "verseNumber": 84,
      "verseString": "قَالَ فَالْحَقُّ وَالْحَقَّ أَقُولُ",
      "verseStringB": "He said, “The truth is, and the truth I say."
    },
    {
      "verseNumber": 85,
      "verseString": "لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ وَمِمَّنْ تَبِعَكَ مِنْهُمْ أَجْمَعِينَ",
      "verseStringB": "I will fill Hell with you and with whoever follows you from among them, all together.”"
    },
    {
      "verseNumber": 86,
      "verseString": "قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنَا مِنَ الْمُتَكَلِّفِينَ",
      "verseStringB": "Say, “I ask of you no wage for this, and I am not a pretender."
    },
    {
      "verseNumber": 87,
      "verseString": "إِنْ هُوَ إِلَّا ذِكْرٌ لِلْعَالَمِينَ",
      "verseStringB": "It is but a reminder for all people."
    },
    {
      "verseNumber": 88,
      "verseString": "وَلَتَعْلَمُنَّ نَبَأَهُ بَعْدَ حِينٍ",
      "verseStringB": "And you will know its news after a while.”"
    }
  ],
  "nameEnglish": "Saad",
  "nameTrans": "Saad",
  "nameArabic": "ص",
  "chapterNumber": 38,
  "nVerses": 88
}