{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ",
      "verseStringB": "The revelation of the Book is from Allah, the Mighty and Wise."
    },
    {
      "verseNumber": 2,
      "verseString": "إِنَّا أَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ فَاعْبُدِ اللَّهَ مُخْلِصًا لَهُ الدِّينَ",
      "verseStringB": "We sent down to you the Book with the truth: so worship Allah, devoting your religion to Him."
    },
    {
      "verseNumber": 3,
      "verseString": "أَلَا لِلَّهِ الدِّينُ الْخَالِصُ ۚ وَالَّذِينَ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَىٰ إِنَّ اللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ ۗ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ كَاذِبٌ كَفَّارٌ",
      "verseStringB": "Is not to Allah that sincere faith is due? As for those who take other lords beside Him, “We serve them only so that they may bring us closer to Allah.” Allah will judge between them regarding what they differ about. Allah does not guide the lying blasphemer."
    },
    {
      "verseNumber": 4,
      "verseString": "لَوْ أَرَادَ اللَّهُ أَنْ يَتَّخِذَ وَلَدًا لَاصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَاءُ ۚ سُبْحَانَهُ ۖ هُوَ اللَّهُ الْوَاحِدُ الْقَهَّارُ",
      "verseStringB": "If Allah wanted to have a child, He would have selected anyone He willed from what He created. Glory be to Him. He is Allah, the One, the Irresistible."
    },
    {
      "verseNumber": 5,
      "verseString": "خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۖ يُكَوِّرُ اللَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى اللَّيْلِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُسَمًّى ۗ أَلَا هُوَ الْعَزِيزُ الْغَفَّارُ",
      "verseStringB": "He created the heavens and the earth with truth. He wraps the night around the day, and He wraps the day around the night. And He regulated the sun and the moon, each running along a specific course. He is the Almighty, the Forgiver."
    },
    {
      "verseNumber": 6,
      "verseString": "خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَأَنْزَلَ لَكُمْ مِنَ الْأَنْعَامِ ثَمَانِيَةَ أَزْوَاجٍ ۚ يَخْلُقُكُمْ فِي بُطُونِ أُمَّهَاتِكُمْ خَلْقًا مِنْ بَعْدِ خَلْقٍ فِي ظُلُمَاتٍ ثَلَاثٍ ۚ ذَٰلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ ۖ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُصْرَفُونَ",
      "verseStringB": "He created you from a single soul. Then from it, He made its mate. And He brought down for you livestock—eight kinds in pairs. He creates you in your mothers’ wombs, in successive formations, in triple darknesses. That is Allah, your Lord. Sovereignty belongs to Him. There is no god but He. So what made you deviate?"
    },
    {
      "verseNumber": 7,
      "verseString": "إِنْ تَكْفُرُوا فَإِنَّ اللَّهَ غَنِيٌّ عَنْكُمْ ۖ وَلَا يَرْضَىٰ لِعِبَادِهِ الْكُفْرَ ۖ وَإِنْ تَشْكُرُوا يَرْضَهُ لَكُمْ ۗ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ ثُمَّ إِلَىٰ رَبِّكُمْ مَرْجِعُكُمْ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "verseStringB": "If you disbelieve, Allah does not need you, yet He does not approve disbelief by His servants. And if you are thankful, He will approve that in you. No bearer of burdens can bear the burdens of another. Then to your Lord is your return, and He will inform you of what you used to do. He knows what is inside the hearts."
    },
    {
      "verseNumber": 8,
      "verseString": "وَإِذَا مَسَّ الْإِنْسَانَ ضُرٌّ دَعَا رَبَّهُ مُنِيبًا إِلَيْهِ ثُمَّ إِذَا خَوَّلَهُ نِعْمَةً مِنْهُ نَسِيَ مَا كَانَ يَدْعُو إِلَيْهِ مِنْ قَبْلُ وَجَعَلَ لِلَّهِ أَنْدَادًا لِيُضِلَّ عَنْ سَبِيلِهِ ۚ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا ۖ إِنَّكَ مِنْ أَصْحَابِ النَّارِ",
      "verseStringB": "When some adversity touches the human being, he prays to his Lord, turning to Him. But then, when He gives him a favor from Himself, he forgets what he was praying for previously, and he attributes equals to Allah, to lead away from His way. Say, “Enjoy your disbelief for a little while; you are among the inmates of the Fire.”"
    },
    {
      "verseNumber": 9,
      "verseString": "أَمَّنْ هُوَ قَانِتٌ آنَاءَ اللَّيْلِ سَاجِدًا وَقَائِمًا يَحْذَرُ الْآخِرَةَ وَيَرْجُو رَحْمَةَ رَبِّهِ ۗ قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ ۗ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ",
      "verseStringB": "What of him who is devoutly obedient during the watches of the night, prostrating and standing, mindful of the Hereafter, and hoping for his Lord’s Mercy? Say, “Are those who know and those who do not know equal?” Only the people of understanding take notice."
    },
    {
      "verseNumber": 10,
      "verseString": "قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ",
      "verseStringB": "Say, “O My devotees who have believed, keep your duty to your Lord. For those who do good in this world, there is goodness; and Allah’s earth is vast.” Those who are patient will be given their reward without reckoning.”"
    },
    {
      "verseNumber": 11,
      "verseString": "قُلْ إِنِّي أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ مُخْلِصًا لَهُ الدِّينَ",
      "verseStringB": "Say, “I was commanded to worship Allah, dedicating my faith entirely to Him."
    },
    {
      "verseNumber": 12,
      "verseString": "وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ الْمُسْلِمِينَ",
      "verseStringB": "And I was commanded to be of the first of those who submit.”"
    },
    {
      "verseNumber": 13,
      "verseString": "قُلْ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ",
      "verseStringB": "Say, “I fear, should I disobey my Lord, the punishment of a tremendous day.”"
    },
    {
      "verseNumber": 14,
      "verseString": "قُلِ اللَّهَ أَعْبُدُ مُخْلِصًا لَهُ دِينِي",
      "verseStringB": "Say, “It is Allah I worship, being sincere in my devotion to Him.”"
    },
    {
      "verseNumber": 15,
      "verseString": "فَاعْبُدُوا مَا شِئْتُمْ مِنْ دُونِهِ ۗ قُلْ إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ ۗ أَلَا ذَٰلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ",
      "verseStringB": "“So worship whatever you want besides Him.” Say, “The losers are those who will lose themselves and their families on the Day of Resurrection.” That is the obvious loss."
    },
    {
      "verseNumber": 16,
      "verseString": "لَهُمْ مِنْ فَوْقِهِمْ ظُلَلٌ مِنَ النَّارِ وَمِنْ تَحْتِهِمْ ظُلَلٌ ۚ ذَٰلِكَ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ ۚ يَا عِبَادِ فَاتَّقُونِ",
      "verseStringB": "They will have layers of Fire above them, and layers beneath them. This is how Allah strikes fear into His servants. “O My servants, reverence Me.”"
    },
    {
      "verseNumber": 17,
      "verseString": "وَالَّذِينَ اجْتَنَبُوا الطَّاغُوتَ أَنْ يَعْبُدُوهَا وَأَنَابُوا إِلَى اللَّهِ لَهُمُ الْبُشْرَىٰ ۚ فَبَشِّرْ عِبَادِ",
      "verseStringB": "As for those who shun the worship of false gods, and turn to Allah—theirs is the good news. So give good news to My worshipers."
    },
    {
      "verseNumber": 18,
      "verseString": "الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ ۚ أُولَٰئِكَ الَّذِينَ هَدَاهُمُ اللَّهُ ۖ وَأُولَٰئِكَ هُمْ أُولُو الْأَلْبَابِ",
      "verseStringB": "Those who listen to the Word, and follow the best of it. It is they whom Allah has guided, and it is they who are the possessors of intellect."
    },
    {
      "verseNumber": 19,
      "verseString": "أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِ أَفَأَنْتَ تُنْقِذُ مَنْ فِي النَّارِ",
      "verseStringB": "What about someone who has deserved the sentence of punishment? Is it you who can save those in the Fire?"
    },
    {
      "verseNumber": 20,
      "verseString": "لَٰكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ مِنْ فَوْقِهَا غُرَفٌ مَبْنِيَّةٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ وَعْدَ اللَّهِ ۖ لَا يُخْلِفُ اللَّهُ الْمِيعَادَ",
      "verseStringB": "But those mindful of their Lord will have mansions upon mansions, built high, with streams flowing beneath them. The promise of Allah—Allah never breaks a promise."
    },
    {
      "verseNumber": 21,
      "verseString": "أَلَمْ تَرَ أَنَّ اللَّهَ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَلَكَهُ يَنَابِيعَ فِي الْأَرْضِ ثُمَّ يُخْرِجُ بِهِ زَرْعًا مُخْتَلِفًا أَلْوَانُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَجْعَلُهُ حُطَامًا ۚ إِنَّ فِي ذَٰلِكَ لَذِكْرَىٰ لِأُولِي الْأَلْبَابِ",
      "verseStringB": "Have you not considered that Allah sends down water from the sky, conducts it as springs in the earth, then He produces with it vegetation of various colors, which later withers, and you see it yellowing, then He turns it into debris? Surely in this is a reminder for possessors of understanding."
    },
    {
      "verseNumber": 22,
      "verseString": "أَفَمَنْ شَرَحَ اللَّهُ صَدْرَهُ لِلْإِسْلَامِ فَهُوَ عَلَىٰ نُورٍ مِنْ رَبِّهِ ۚ فَوَيْلٌ لِلْقَاسِيَةِ قُلُوبُهُمْ مِنْ ذِكْرِ اللَّهِ ۚ أُولَٰئِكَ فِي ضَلَالٍ مُبِينٍ",
      "verseStringB": "What about someone whose chest Allah has expanded for Submission, so he is enlightened by his Lord? So woe to those whose hearts are hardened against the remembrance of Allah. These are in obvious error."
    },
    {
      "verseNumber": 23,
      "verseString": "اللَّهُ نَزَّلَ أَحْسَنَ الْحَدِيثِ كِتَابًا مُتَشَابِهًا مَثَانِيَ تَقْشَعِرُّ مِنْهُ جُلُودُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ اللَّهِ ۚ ذَٰلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَنْ يَشَاءُ ۚ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ",
      "verseStringB": "Allah sent down the best of messages: A Book consistent and paired. The skins of those who fear their Lord shiver from it. Then their skins and their hearts soften up to Allah’s remembrance. That is Allah’s guidance; He guides with it whom He wills. But whomever Allah leads astray, for him there is no guide."
    },
    {
      "verseNumber": 24,
      "verseString": "أَفَمَنْ يَتَّقِي بِوَجْهِهِ سُوءَ الْعَذَابِ يَوْمَ الْقِيَامَةِ ۚ وَقِيلَ لِلظَّالِمِينَ ذُوقُوا مَا كُنْتُمْ تَكْسِبُونَ",
      "verseStringB": "What about someone who shields his face against the terrible misery of the Day of Resurrection? To the evildoers, it will be said, “Taste what you used to earn.”"
    },
    {
      "verseNumber": 25,
      "verseString": "كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ فَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ",
      "verseStringB": "Those before them denied the truth, so the torment came upon them from where they did not perceive."
    },
    {
      "verseNumber": 26,
      "verseString": "فَأَذَاقَهُمُ اللَّهُ الْخِزْيَ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا يَعْلَمُونَ",
      "verseStringB": "So Allah made them taste humiliation in the worldly life, but far worse is the punishment of the Hereafter, if they only knew."
    },
    {
      "verseNumber": 27,
      "verseString": "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِي هَٰذَا الْقُرْآنِ مِنْ كُلِّ مَثَلٍ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "verseStringB": "We have cited in this Quran for people every kind of example, so they may be mindful."
    },
    {
      "verseNumber": 28,
      "verseString": "قُرْآنًا عَرَبِيًّا غَيْرَ ذِي عِوَجٍ لَعَلَّهُمْ يَتَّقُونَ",
      "verseStringB": "A Quran in Arabic, with no distortion, so they may be righteous."
    },
    {
      "verseNumber": 29,
      "verseString": "ضَرَبَ اللَّهُ مَثَلًا رَجُلًا فِيهِ شُرَكَاءُ مُتَشَاكِسُونَ وَرَجُلًا سَلَمًا لِرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلًا ۚ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "Allah cites the example of a man shared by partners at odds, and a man belonging exclusively to one man. Are they equal in condition? Praise be to Allah, but most of them do not know."
    },
    {
      "verseNumber": 30,
      "verseString": "إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ",
      "verseStringB": "You will die, and they will die."
    },
    {
      "verseNumber": 31,
      "verseString": "ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ عِنْدَ رَبِّكُمْ تَخْتَصِمُونَ",
      "verseStringB": "Then, on the Day of Resurrection, you will quarrel before your Lord."
    },
    {
      "verseNumber": 32,
      "verseString": "فَمَنْ أَظْلَمُ مِمَّنْ كَذَبَ عَلَى اللَّهِ وَكَذَّبَ بِالصِّدْقِ إِذْ جَاءَهُ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْكَافِرِينَ",
      "verseStringB": "Who is more unjust than he who lies against Allah, and denies the truth when it has come to him? Is there not in Gehenna room for the ungrateful?"
    },
    {
      "verseNumber": 33,
      "verseString": "وَالَّذِي جَاءَ بِالصِّدْقِ وَصَدَّقَ بِهِ ۙ أُولَٰئِكَ هُمُ الْمُتَّقُونَ",
      "verseStringB": "But whoever promotes the truth and testifies to it—it is they who are the reverent."
    },
    {
      "verseNumber": 34,
      "verseString": "لَهُمْ مَا يَشَاءُونَ عِنْدَ رَبِّهِمْ ۚ ذَٰلِكَ جَزَاءُ الْمُحْسِنِينَ",
      "verseStringB": "They will have whatever they desire with their Lord. That is the reward of the good-doers."
    },
    {
      "verseNumber": 35,
      "verseString": "لِيُكَفِّرَ اللَّهُ عَنْهُمْ أَسْوَأَ الَّذِي عَمِلُوا وَيَجْزِيَهُمْ أَجْرَهُمْ بِأَحْسَنِ الَّذِي كَانُوا يَعْمَلُونَ",
      "verseStringB": "So that Allah may acquit them of the worst of their deeds, and reward them according to the best of what they used to do."
    },
    {
      "verseNumber": 36,
      "verseString": "أَلَيْسَ اللَّهُ بِكَافٍ عَبْدَهُ ۖ وَيُخَوِّفُونَكَ بِالَّذِينَ مِنْ دُونِهِ ۚ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ",
      "verseStringB": "Is Allah not enough for His servant? And they frighten you with those besides Him. Whomever Allah sends astray, for him there is no guide."
    },
    {
      "verseNumber": 37,
      "verseString": "وَمَنْ يَهْدِ اللَّهُ فَمَا لَهُ مِنْ مُضِلٍّ ۗ أَلَيْسَ اللَّهُ بِعَزِيزٍ ذِي انْتِقَامٍ",
      "verseStringB": "And whomever Allah guides, for him there is no misleader. Is Allah not Powerful, Possessor of Vengeance?"
    },
    {
      "verseNumber": 38,
      "verseString": "وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلْ أَفَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهِ إِنْ أَرَادَنِيَ اللَّهُ بِضُرٍّ هَلْ هُنَّ كَاشِفَاتُ ضُرِّهِ أَوْ أَرَادَنِي بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَاتُ رَحْمَتِهِ ۚ قُلْ حَسْبِيَ اللَّهُ ۖ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ",
      "verseStringB": "And if you asked them, “Who created the heavens and the earth?” they would say, “Allah.” Say, “Have you considered those you call upon, apart from Allah? If Allah desires some harm for me, could they remove His harm, or if He desires some mercy for me, could they withhold His Mercy?” Say, “Allah is enough for me. On Him, the reliant rely.”"
    },
    {
      "verseNumber": 39,
      "verseString": "قُلْ يَا قَوْمِ اعْمَلُوا عَلَىٰ مَكَانَتِكُمْ إِنِّي عَامِلٌ ۖ فَسَوْفَ تَعْلَمُونَ",
      "verseStringB": "Say: “O my people! Work according to your ability, and so will I. You will soon know."
    },
    {
      "verseNumber": 40,
      "verseString": "مَنْ يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُقِيمٌ",
      "verseStringB": "Upon whom comes a punishment that disgraces him, and upon whom falls lasting suffering.”"
    },
    {
      "verseNumber": 41,
      "verseString": "إِنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ لِلنَّاسِ بِالْحَقِّ ۖ فَمَنِ اهْتَدَىٰ فَلِنَفْسِهِ ۖ وَمَنْ ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ وَمَا أَنْتَ عَلَيْهِمْ بِوَكِيلٍ",
      "verseStringB": "We sent down to you the Book for humanity in truth. Whoever is guided—it is for the sake of his own soul. And whoever strays, he strays only to its detriment. And you are not a keeper over them."
    },
    {
      "verseNumber": 42,
      "verseString": "اللَّهُ يَتَوَفَّى الْأَنْفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا ۖ فَيُمْسِكُ الَّتِي قَضَىٰ عَلَيْهَا الْمَوْتَ وَيُرْسِلُ الْأُخْرَىٰ إِلَىٰ أَجَلٍ مُسَمًّى ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ",
      "verseStringB": "Allah takes the souls at the moment of their death, and those that have not died, during their sleep. Then He keeps those for whom He has ordained death, and He releases the others until a predetermined time. Surely in this are signs for people who reflect."
    },
    {
      "verseNumber": 43,
      "verseString": "أَمِ اتَّخَذُوا مِنْ دُونِ اللَّهِ شُفَعَاءَ ۚ قُلْ أَوَلَوْ كَانُوا لَا يَمْلِكُونَ شَيْئًا وَلَا يَعْقِلُونَ",
      "verseStringB": "Or have they taken intercessors apart from Allah? Say, Even though they have no power over anything, and are devoid of reason?”"
    },
    {
      "verseNumber": 44,
      "verseString": "قُلْ لِلَّهِ الشَّفَاعَةُ جَمِيعًا ۖ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ ثُمَّ إِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "Say, “All intercession belongs to Allah. To Him belongs the kingdom of the heavens and the earth. Then to Him, you will be returned.”"
    },
    {
      "verseNumber": 45,
      "verseString": "وَإِذَا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ ۖ وَإِذَا ذُكِرَ الَّذِينَ مِنْ دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ",
      "verseStringB": "And when Allah alone is mentioned: the hearts of those who do not believe in the Hereafter shrink with disgust. But when those apart from Him are mentioned: they suddenly rejoice."
    },
    {
      "verseNumber": 46,
      "verseString": "قُلِ اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِي مَا كَانُوا فِيهِ يَخْتَلِفُونَ",
      "verseStringB": "Say, “Our God, Originator of the heavens and the earth, Knower of secrets and declarations. You will judge between Your servants regarding what they differed about.”"
    },
    {
      "verseNumber": 47,
      "verseString": "وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُوا مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ مِنْ سُوءِ الْعَذَابِ يَوْمَ الْقِيَامَةِ ۚ وَبَدَا لَهُمْ مِنَ اللَّهِ مَا لَمْ يَكُونُوا يَحْتَسِبُونَ",
      "verseStringB": "If those who work evil possessed all that is on earth, and the like of it besides, they would offer it to redeem themselves from the awful suffering of the Day of Resurrection. And there will appear to them from Allah what they never expected."
    },
    {
      "verseNumber": 48,
      "verseString": "وَبَدَا لَهُمْ سَيِّئَاتُ مَا كَسَبُوا وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ",
      "verseStringB": "And the evils of their deeds will unfold before them, and they will be besieged by what they used to ridicule."
    },
    {
      "verseNumber": 49,
      "verseString": "فَإِذَا مَسَّ الْإِنْسَانَ ضُرٌّ دَعَانَا ثُمَّ إِذَا خَوَّلْنَاهُ نِعْمَةً مِنَّا قَالَ إِنَّمَا أُوتِيتُهُ عَلَىٰ عِلْمٍ ۚ بَلْ هِيَ فِتْنَةٌ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "verseStringB": "When adversity touches the human being, he calls on Us. But then, when We favor him with a blessing from Us, he says, “I have attained this because of my knowledge.” However, it is a test, but most of them do not know."
    },
    {
      "verseNumber": 50,
      "verseString": "قَدْ قَالَهَا الَّذِينَ مِنْ قَبْلِهِمْ فَمَا أَغْنَىٰ عَنْهُمْ مَا كَانُوا يَكْسِبُونَ",
      "verseStringB": "Those before them said the same, but their gains were of no benefit to them."
    },
    {
      "verseNumber": 51,
      "verseString": "فَأَصَابَهُمْ سَيِّئَاتُ مَا كَسَبُوا ۚ وَالَّذِينَ ظَلَمُوا مِنْ هَٰؤُلَاءِ سَيُصِيبُهُمْ سَيِّئَاتُ مَا كَسَبُوا وَمَا هُمْ بِمُعْجِزِينَ",
      "verseStringB": "The evils of their deeds caught up with them. And the wrongdoers among these will be overtaken by the evils of their deeds, and they cannot prevent it."
    },
    {
      "verseNumber": 52,
      "verseString": "أَوَلَمْ يَعْلَمُوا أَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ",
      "verseStringB": "Do they not know that Allah extends the provision to whomever He wills—and restricts it? Surely in this are signs for people who believe."
    },
    {
      "verseNumber": 53,
      "verseString": "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
      "verseStringB": "Say, “O My servants who have transgressed against their souls: do not despair of Allah’s mercy, for Allah forgives all sins. He is the Forgiving, the Merciful.”"
    },
    {
      "verseNumber": 54,
      "verseString": "وَأَنِيبُوا إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا لَهُ مِنْ قَبْلِ أَنْ يَأْتِيَكُمُ الْعَذَابُ ثُمَّ لَا تُنْصَرُونَ",
      "verseStringB": "And turn to your Lord in repentance, and submit to Him, before the punishment comes upon you, and you will not be helped."
    },
    {
      "verseNumber": 55,
      "verseString": "وَاتَّبِعُوا أَحْسَنَ مَا أُنْزِلَ إِلَيْكُمْ مِنْ رَبِّكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَأَنْتُمْ لَا تَشْعُرُونَ",
      "verseStringB": "And follow the best of what was revealed to you from your Lord, before the punishment comes upon you suddenly, while you are unaware."
    },
    {
      "verseNumber": 56,
      "verseString": "أَنْ تَقُولَ نَفْسٌ يَا حَسْرَتَا عَلَىٰ مَا فَرَّطْتُ فِي جَنْبِ اللَّهِ وَإِنْ كُنْتُ لَمِنَ السَّاخِرِينَ",
      "verseStringB": "So that a soul may not say, “How sorry I am, for having neglected my duty to Allah, and for having been of the scoffers.”"
    },
    {
      "verseNumber": 57,
      "verseString": "أَوْ تَقُولَ لَوْ أَنَّ اللَّهَ هَدَانِي لَكُنْتُ مِنَ الْمُتَّقِينَ",
      "verseStringB": "Or say, “Had Allah guided me, I would have been of the reverent.”"
    },
    {
      "verseNumber": 58,
      "verseString": "أَوْ تَقُولَ حِينَ تَرَى الْعَذَابَ لَوْ أَنَّ لِي كَرَّةً فَأَكُونَ مِنَ الْمُحْسِنِينَ",
      "verseStringB": "Or say, upon seeing the punishment, “If only I had a second chance, I would be of the virtuous.”"
    },
    {
      "verseNumber": 59,
      "verseString": "بَلَىٰ قَدْ جَاءَتْكَ آيَاتِي فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنْتَ مِنَ الْكَافِرِينَ",
      "verseStringB": "Yes indeed. My Verses came to you, but you called them lies, turned arrogant, and were of the faithless."
    },
    {
      "verseNumber": 60,
      "verseString": "وَيَوْمَ الْقِيَامَةِ تَرَى الَّذِينَ كَذَبُوا عَلَى اللَّهِ وُجُوهُهُمْ مُسْوَدَّةٌ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْمُتَكَبِّرِينَ",
      "verseStringB": "On the Day of Resurrection, you will see those who told lies about Allah with their faces blackened. Is Hell not the proper place for the arrogant?"
    },
    {
      "verseNumber": 61,
      "verseString": "وَيُنَجِّي اللَّهُ الَّذِينَ اتَّقَوْا بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ السُّوءُ وَلَا هُمْ يَحْزَنُونَ",
      "verseStringB": "And Allah will save those who maintained righteousness to their place of salvation. No harm will touch them, nor will they grieve."
    },
    {
      "verseNumber": 62,
      "verseString": "اللَّهُ خَالِقُ كُلِّ شَيْءٍ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ وَكِيلٌ",
      "verseStringB": "Allah is the Creator of all things, and He is the Maintainer of all things."
    },
    {
      "verseNumber": 63,
      "verseString": "لَهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَالَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ",
      "verseStringB": "To Him belong the keys of the heavens and the earth. But those who reject Allah’s Verses—it is they who are the losers."
    },
    {
      "verseNumber": 64,
      "verseString": "قُلْ أَفَغَيْرَ اللَّهِ تَأْمُرُونِّي أَعْبُدُ أَيُّهَا الْجَاهِلُونَ",
      "verseStringB": "Say, “Is it other than Allah you urge me to worship, you ignorant ones?”"
    },
    {
      "verseNumber": 65,
      "verseString": "وَلَقَدْ أُوحِيَ إِلَيْكَ وَإِلَى الَّذِينَ مِنْ قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ الْخَاسِرِينَ",
      "verseStringB": "It was revealed to you, and to those before you, that if you ascribe partners, your deeds will be in vain, and you will be among the losers."
    },
    {
      "verseNumber": 66,
      "verseString": "بَلِ اللَّهَ فَاعْبُدْ وَكُنْ مِنَ الشَّاكِرِينَ",
      "verseStringB": "Rather, worship Allah, and be of the appreciative."
    },
    {
      "verseNumber": 67,
      "verseString": "وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ",
      "verseStringB": "They have not esteemed Allah as He ought to be esteemed. The entire earth will be in His Grip on the Day of Resurrection, and the heavens will be folded in His Right. Immaculate is He, and Transcendent is He beyond the associations they make."
    },
    {
      "verseNumber": 68,
      "verseString": "وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ ۖ ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ",
      "verseStringB": "And the Trumpet will be blown, and everyone in the heavens and the earth will be stunned, except those whom Allah wills. Then it will be blown another time, and they will rise, looking on."
    },
    {
      "verseNumber": 69,
      "verseString": "وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ الْكِتَابُ وَجِيءَ بِالنَّبِيِّينَ وَالشُّهَدَاءِ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَهُمْ لَا يُظْلَمُونَ",
      "verseStringB": "And the earth will shine with the Light of its Lord, and the Record will be set in place, and the prophets and the witnesses will be brought in, and Judgment will be made between them equitably, and they will not be wronged."
    },
    {
      "verseNumber": 70,
      "verseString": "وَوُفِّيَتْ كُلُّ نَفْسٍ مَا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ",
      "verseStringB": "And every soul will be fully compensated for what it had done. He is well aware of what they do."
    },
    {
      "verseNumber": 71,
      "verseString": "وَسِيقَ الَّذِينَ كَفَرُوا إِلَىٰ جَهَنَّمَ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا فُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ رُسُلٌ مِنْكُمْ يَتْلُونَ عَلَيْكُمْ آيَاتِ رَبِّكُمْ وَيُنْذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا ۚ قَالُوا بَلَىٰ وَلَٰكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكَافِرِينَ",
      "verseStringB": "Those who disbelieved will be driven to Hell in crowds. Until, when they have reached it, and its gates are opened, its keepers will say to them, “Did messengers not come to you from among you, reciting to you the Verses of your Lord, and warning you of the meeting of this Day of yours?” They will say, “Yes, but the verdict of punishment is justified against the unbelievers.”"
    },
    {
      "verseNumber": 72,
      "verseString": "قِيلَ ادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ",
      "verseStringB": "It will be said, “Enter the gates of Hell, to stay there forever.” What an evil home for the arrogant."
    },
    {
      "verseNumber": 73,
      "verseString": "وَسِيقَ الَّذِينَ اتَّقَوْا رَبَّهُمْ إِلَى الْجَنَّةِ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا وَفُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَامٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوهَا خَالِدِينَ",
      "verseStringB": "And those who were mindful of their Lord will be led to Paradise in crowds. Until, when they have reached it, and its gates are opened, its keepers will say to them, “Peace be upon you, you have done well, so enter it, to reside in it eternally.”"
    },
    {
      "verseNumber": 74,
      "verseString": "وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي صَدَقَنَا وَعْدَهُ وَأَوْرَثَنَا الْأَرْضَ نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ ۖ فَنِعْمَ أَجْرُ الْعَامِلِينَ",
      "verseStringB": "And they will say, “Praise be to Allah, who has fulfilled His promise to us, and made us inherit the land, enjoying Paradise as we please.” How excellent is the reward of the workers!"
    },
    {
      "verseNumber": 75,
      "verseString": "وَتَرَى الْمَلَائِكَةَ حَافِّينَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ ۖ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَقِيلَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "verseStringB": "And you will see the angels hovering around the Throne, glorifying their Lord with praise. And judgment will be made between them in truth, and it will be said, “Praise be to Allah, Lord of the Worlds.”"
    }
  ],
  "nameEnglish": "The Crowds",
  "nameTrans": "az-Zumar",
  "nameArabic": "الزمر",
  "chapterNumber": 39,
  "nVerses": 75
}