{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "حم",
      "verseStringB": "Ha. Meem."
    },
    {
      "verseNumber": 2,
      "verseString": "تَنْزِيلٌ مِنَ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "A revelation from the Compassionate, the Merciful."
    },
    {
      "verseNumber": 3,
      "verseString": "كِتَابٌ فُصِّلَتْ آيَاتُهُ قُرْآنًا عَرَبِيًّا لِقَوْمٍ يَعْلَمُونَ",
      "verseStringB": "A Scripture whose Verses are detailed. A Quran in Arabic for people who know."
    },
    {
      "verseNumber": 4,
      "verseString": "بَشِيرًا وَنَذِيرًا فَأَعْرَضَ أَكْثَرُهُمْ فَهُمْ لَا يَسْمَعُونَ",
      "verseStringB": "Delivering good news and bringing warnings. But most of them turn away, so they do not listen."
    },
    {
      "verseNumber": 5,
      "verseString": "وَقَالُوا قُلُوبُنَا فِي أَكِنَّةٍ مِمَّا تَدْعُونَا إِلَيْهِ وَفِي آذَانِنَا وَقْرٌ وَمِنْ بَيْنِنَا وَبَيْنِكَ حِجَابٌ فَاعْمَلْ إِنَّنَا عَامِلُونَ",
      "verseStringB": "And they say, “Our hearts are screened from what you call us to, and there is deafness in our ears, and there is a veil between us and you. So do whatever you want, and so will we.”"
    },
    {
      "verseNumber": 6,
      "verseString": "قُلْ إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ يُوحَىٰ إِلَيَّ أَنَّمَا إِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ فَاسْتَقِيمُوا إِلَيْهِ وَاسْتَغْفِرُوهُ ۗ وَوَيْلٌ لِلْمُشْرِكِينَ",
      "verseStringB": "Say, “I am only a human being like you. It is inspired in me that your God is One God. So be upright towards Him. And seek forgiveness from Him.” And woe to the idolaters."
    },
    {
      "verseNumber": 7,
      "verseString": "الَّذِينَ لَا يُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ كَافِرُونَ",
      "verseStringB": "Those who do not give the alms; and regarding the Hereafter, they are in denial."
    },
    {
      "verseNumber": 8,
      "verseString": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ",
      "verseStringB": "As for those who believe and do righteous deeds—for them is an unending reward."
    },
    {
      "verseNumber": 9,
      "verseString": "قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ بِالَّذِي خَلَقَ الْأَرْضَ فِي يَوْمَيْنِ وَتَجْعَلُونَ لَهُ أَنْدَادًا ۚ ذَٰلِكَ رَبُّ الْعَالَمِينَ",
      "verseStringB": "Say, “Do you reject the One who created the earth in two stages? And you attribute equals to Him? That is the Lord of the Universe.”"
    },
    {
      "verseNumber": 10,
      "verseString": "وَجَعَلَ فِيهَا رَوَاسِيَ مِنْ فَوْقِهَا وَبَارَكَ فِيهَا وَقَدَّرَ فِيهَا أَقْوَاتَهَا فِي أَرْبَعَةِ أَيَّامٍ سَوَاءً لِلسَّائِلِينَ",
      "verseStringB": "He placed stabilizers over it, and He blessed it, and He assigned its foods in four stages—equally for the seekers."
    },
    {
      "verseNumber": 11,
      "verseString": "ثُمَّ اسْتَوَىٰ إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ",
      "verseStringB": "Then He turned towards the sky, and it was smoke, and He said to it and to the earth, “Come, willingly or unwillingly.” They said, “We come willingly.”"
    },
    {
      "verseNumber": 12,
      "verseString": "فَقَضَاهُنَّ سَبْعَ سَمَاوَاتٍ فِي يَوْمَيْنِ وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا ۚ وَزَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَحِفْظًا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ",
      "verseStringB": "Then He completed them seven universes, in two Days. And He assigned to each universe its law. And We decorated the lower universe with lamps, and for protection. That is the design of the Almighty, the All-Knowing."
    },
    {
      "verseNumber": 13,
      "verseString": "فَإِنْ أَعْرَضُوا فَقُلْ أَنْذَرْتُكُمْ صَاعِقَةً مِثْلَ صَاعِقَةِ عَادٍ وَثَمُودَ",
      "verseStringB": "If they turn away, say, “I have warned you of a thunderbolt, like the thunderbolt of Aad and Thamood.”"
    },
    {
      "verseNumber": 14,
      "verseString": "إِذْ جَاءَتْهُمُ الرُّسُلُ مِنْ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ ۖ قَالُوا لَوْ شَاءَ رَبُّنَا لَأَنْزَلَ مَلَائِكَةً فَإِنَّا بِمَا أُرْسِلْتُمْ بِهِ كَافِرُونَ",
      "verseStringB": "When their messengers came to them, from the front of them, and from behind them: “Worship none but Allah.” They said, “Had our Lord willed, He would have sent down angels; so we reject what you are sent with.”"
    },
    {
      "verseNumber": 15,
      "verseString": "فَأَمَّا عَادٌ فَاسْتَكْبَرُوا فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَقَالُوا مَنْ أَشَدُّ مِنَّا قُوَّةً ۖ أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً ۖ وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ",
      "verseStringB": "As for Aad, they acted arrogantly on earth, and opposed justice, and said, “Who is more powerful than us?” Have they not considered that Allah, Who created them, is more powerful than them? And they went on denying Our revelations."
    },
    {
      "verseNumber": 16,
      "verseString": "فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي أَيَّامٍ نَحِسَاتٍ لِنُذِيقَهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَخْزَىٰ ۖ وَهُمْ لَا يُنْصَرُونَ",
      "verseStringB": "So We unleashed upon them a screaming wind, for a few miserable days, to make them taste the punishment of shame in this life. But the punishment of the Hereafter is more shameful—and they will not be helped."
    },
    {
      "verseNumber": 17,
      "verseString": "وَأَمَّا ثَمُودُ فَهَدَيْنَاهُمْ فَاسْتَحَبُّوا الْعَمَىٰ عَلَى الْهُدَىٰ فَأَخَذَتْهُمْ صَاعِقَةُ الْعَذَابِ الْهُونِ بِمَا كَانُوا يَكْسِبُونَ",
      "verseStringB": "As for Thamood, We guided them, but they preferred blindness over guidance. So the thunderbolt of the humiliating punishment overtook them, because of what they used to do."
    },
    {
      "verseNumber": 18,
      "verseString": "وَنَجَّيْنَا الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ",
      "verseStringB": "And We saved those who believed and were cautious."
    },
    {
      "verseNumber": 19,
      "verseString": "وَيَوْمَ يُحْشَرُ أَعْدَاءُ اللَّهِ إِلَى النَّارِ فَهُمْ يُوزَعُونَ",
      "verseStringB": "On the Day when Allah’s enemies are herded to the Fire, forcibly."
    },
    {
      "verseNumber": 20,
      "verseString": "حَتَّىٰ إِذَا مَا جَاءُوهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَارُهُمْ وَجُلُودُهُمْ بِمَا كَانُوا يَعْمَلُونَ",
      "verseStringB": "Until, when they have reached it, their hearing, and their sight, and their skins will testify against them regarding what they used to do."
    },
    {
      "verseNumber": 21,
      "verseString": "وَقَالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنَا ۖ قَالُوا أَنْطَقَنَا اللَّهُ الَّذِي أَنْطَقَ كُلَّ شَيْءٍ وَهُوَ خَلَقَكُمْ أَوَّلَ مَرَّةٍ وَإِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "And they will say to their skins, “Why did you testify against us?” They will say, “Allah, Who made everything speak, made us speak. He who created you the first time; and to Him, you will be returned.”"
    },
    {
      "verseNumber": 22,
      "verseString": "وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ وَلَٰكِنْ ظَنَنْتُمْ أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ",
      "verseStringB": "You were unable to hide yourselves from your hearing, and your sight, and your skins, to prevent them from testifying against you. And you imagined that Allah was unaware of much of what you were doing."
    },
    {
      "verseNumber": 23,
      "verseString": "وَذَٰلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْدَاكُمْ فَأَصْبَحْتُمْ مِنَ الْخَاسِرِينَ",
      "verseStringB": "It is that thought of yours about your Lord that led you to ruin—so you became among the losers."
    },
    {
      "verseNumber": 24,
      "verseString": "فَإِنْ يَصْبِرُوا فَالنَّارُ مَثْوًى لَهُمْ ۖ وَإِنْ يَسْتَعْتِبُوا فَمَا هُمْ مِنَ الْمُعْتَبِينَ",
      "verseStringB": "If they endure patiently, the Fire is their residence. And if they make up excuses, they will not be pardoned."
    },
    {
      "verseNumber": 25,
      "verseString": "وَقَيَّضْنَا لَهُمْ قُرَنَاءَ فَزَيَّنُوا لَهُمْ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَحَقَّ عَلَيْهِمُ الْقَوْلُ فِي أُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِنَ الْجِنِّ وَالْإِنْسِ ۖ إِنَّهُمْ كَانُوا خَاسِرِينَ",
      "verseStringB": "We had assigned companions for them, who glamorized for them what was in front of them, and what was behind them. And the Word proved true against them in communities of jinn and humans that have passed away before them. They were lost."
    },
    {
      "verseNumber": 26,
      "verseString": "وَقَالَ الَّذِينَ كَفَرُوا لَا تَسْمَعُوا لِهَٰذَا الْقُرْآنِ وَالْغَوْا فِيهِ لَعَلَّكُمْ تَغْلِبُونَ",
      "verseStringB": "And those who disbelieve say, “Do not listen to this Quran, and talk over it, so that you may prevail.”"
    },
    {
      "verseNumber": 27,
      "verseString": "فَلَنُذِيقَنَّ الَّذِينَ كَفَرُوا عَذَابًا شَدِيدًا وَلَنَجْزِيَنَّهُمْ أَسْوَأَ الَّذِي كَانُوا يَعْمَلُونَ",
      "verseStringB": "We will make those who disbelieve taste an intense agony, and We will recompense them according to the worst of what they used to do."
    },
    {
      "verseNumber": 28,
      "verseString": "ذَٰلِكَ جَزَاءُ أَعْدَاءِ اللَّهِ النَّارُ ۖ لَهُمْ فِيهَا دَارُ الْخُلْدِ ۖ جَزَاءً بِمَا كَانُوا بِآيَاتِنَا يَجْحَدُونَ",
      "verseStringB": "Such is the repayment for Allah’s enemies—the Fire—they have the eternal home in it, in return for having disregarded Our revelations."
    },
    {
      "verseNumber": 29,
      "verseString": "وَقَالَ الَّذِينَ كَفَرُوا رَبَّنَا أَرِنَا اللَّذَيْنِ أَضَلَّانَا مِنَ الْجِنِّ وَالْإِنْسِ نَجْعَلْهُمَا تَحْتَ أَقْدَامِنَا لِيَكُونَا مِنَ الْأَسْفَلِينَ",
      "verseStringB": "Those who disbelieved will say, “Our Lord, show us those who misguided us—among jinn and humans—and we will trample them under our feet, so they become of the lowliest.”"
    },
    {
      "verseNumber": 30,
      "verseString": "إِنَّ الَّذِينَ قَالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقَامُوا تَتَنَزَّلُ عَلَيْهِمُ الْمَلَائِكَةُ أَلَّا تَخَافُوا وَلَا تَحْزَنُوا وَأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ",
      "verseStringB": "Those who say: “Our Lord is Allah,” and then go straight, the angels descend upon them: “Do not fear, nor grieve, and rejoice in the Garden which you were promised."
    },
    {
      "verseNumber": 31,
      "verseString": "نَحْنُ أَوْلِيَاؤُكُمْ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ ۖ وَلَكُمْ فِيهَا مَا تَشْتَهِي أَنْفُسُكُمْ وَلَكُمْ فِيهَا مَا تَدَّعُونَ",
      "verseStringB": "We are your allies in this life and in the Hereafter; where you will have whatever your souls desire, and there you will have whatever you ask for."
    },
    {
      "verseNumber": 32,
      "verseString": "نُزُلًا مِنْ غَفُورٍ رَحِيمٍ",
      "verseStringB": "Hospitality from a Merciful Forgiver.”"
    },
    {
      "verseNumber": 33,
      "verseString": "وَمَنْ أَحْسَنُ قَوْلًا مِمَّنْ دَعَا إِلَى اللَّهِ وَعَمِلَ صَالِحًا وَقَالَ إِنَّنِي مِنَ الْمُسْلِمِينَ",
      "verseStringB": "And who is better in speech than someone who invites to Allah, acts with integrity, and says, “I am of those who submit”?"
    },
    {
      "verseNumber": 34,
      "verseString": "وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ۚ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ",
      "verseStringB": "Good and evil are not equal. Repel by what is better, and the person who was your enemy will become like an intimate friend."
    },
    {
      "verseNumber": 35,
      "verseString": "وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ",
      "verseStringB": "But none will attain it except those who are patient. And none will attain it except the very fortunate."
    },
    {
      "verseNumber": 36,
      "verseString": "وَإِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ ۖ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ",
      "verseStringB": "And when a temptation from Satan provokes you, seek refuge in Allah; He is the Hearer, the Knower."
    },
    {
      "verseNumber": 37,
      "verseString": "وَمِنْ آيَاتِهِ اللَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُ ۚ لَا تَسْجُدُوا لِلشَّمْسِ وَلَا لِلْقَمَرِ وَاسْجُدُوا لِلَّهِ الَّذِي خَلَقَهُنَّ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ",
      "verseStringB": "Among His signs are the night and the day, and the sun and the moon. Do not bow down to the sun, nor to the moon, but bow down to Allah, Who created them both, if it is Him that you worship."
    },
    {
      "verseNumber": 38,
      "verseString": "فَإِنِ اسْتَكْبَرُوا فَالَّذِينَ عِنْدَ رَبِّكَ يُسَبِّحُونَ لَهُ بِاللَّيْلِ وَالنَّهَارِ وَهُمْ لَا يَسْأَمُونَ ۩",
      "verseStringB": "But if they are too proud—those in the presence of your Lord praise Him night and day, and without ever tiring."
    },
    {
      "verseNumber": 39,
      "verseString": "وَمِنْ آيَاتِهِ أَنَّكَ تَرَى الْأَرْضَ خَاشِعَةً فَإِذَا أَنْزَلْنَا عَلَيْهَا الْمَاءَ اهْتَزَّتْ وَرَبَتْ ۚ إِنَّ الَّذِي أَحْيَاهَا لَمُحْيِي الْمَوْتَىٰ ۚ إِنَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "And among His signs is that you see the land still. But when We send down water on it, it stirs and grows. He Who revived it will revive the dead. He is capable of all things."
    },
    {
      "verseNumber": 40,
      "verseString": "إِنَّ الَّذِينَ يُلْحِدُونَ فِي آيَاتِنَا لَا يَخْفَوْنَ عَلَيْنَا ۗ أَفَمَنْ يُلْقَىٰ فِي النَّارِ خَيْرٌ أَمْ مَنْ يَأْتِي آمِنًا يَوْمَ الْقِيَامَةِ ۚ اعْمَلُوا مَا شِئْتُمْ ۖ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "verseStringB": "Those who distort Our Verses are not hidden from Us. Is he who is hurled into the Fire better? Or he who arrives safely on the Day of Resurrection? Do as you will; He is Seeing of everything you do."
    },
    {
      "verseNumber": 41,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا بِالذِّكْرِ لَمَّا جَاءَهُمْ ۖ وَإِنَّهُ لَكِتَابٌ عَزِيزٌ",
      "verseStringB": "Those who reject the Reminder when it has come to them—it is an invincible Book."
    },
    {
      "verseNumber": 42,
      "verseString": "لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ ۖ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ",
      "verseStringB": "Falsehood cannot approach it—neither from its front, nor from its back. A revelation from a Wise and Praised."
    },
    {
      "verseNumber": 43,
      "verseString": "مَا يُقَالُ لَكَ إِلَّا مَا قَدْ قِيلَ لِلرُّسُلِ مِنْ قَبْلِكَ ۚ إِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ وَذُو عِقَابٍ أَلِيمٍ",
      "verseStringB": "Nothing is said to you but was said to the Messengers before you: your Lord is Possessor of Forgiveness, and Possessor of painful repayment."
    },
    {
      "verseNumber": 44,
      "verseString": "وَلَوْ جَعَلْنَاهُ قُرْآنًا أَعْجَمِيًّا لَقَالُوا لَوْلَا فُصِّلَتْ آيَاتُهُ ۖ أَأَعْجَمِيٌّ وَعَرَبِيٌّ ۗ قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ ۖ وَالَّذِينَ لَا يُؤْمِنُونَ فِي آذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى ۚ أُولَٰئِكَ يُنَادَوْنَ مِنْ مَكَانٍ بَعِيدٍ",
      "verseStringB": "Had We made it a Quran in a foreign language, they would have said, “If only its verses were made clear.” In a Foreign language, and an Arab? Say, “For those who believe, it is guidance and healing. But as for those who do not believe: there is a deafness in their ears, and it is blindness for them. These are being called from a faraway place.”"
    },
    {
      "verseNumber": 45,
      "verseString": "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ فَاخْتُلِفَ فِيهِ ۗ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ لَقُضِيَ بَيْنَهُمْ ۚ وَإِنَّهُمْ لَفِي شَكٍّ مِنْهُ مُرِيبٍ",
      "verseStringB": "We gave Moses the Book, but disputes arose concerning it. Were it not for a prior decree from your Lord, their differences would have been settled. But they are in serious doubt about it."
    },
    {
      "verseNumber": 46,
      "verseString": "مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ ۖ وَمَنْ أَسَاءَ فَعَلَيْهَا ۗ وَمَا رَبُّكَ بِظَلَّامٍ لِلْعَبِيدِ",
      "verseStringB": "Whoever acts righteously, does so for his own soul. And whoever works evil, does so to its detriment. Your Lord is not unjust to the servants."
    },
    {
      "verseNumber": 47,
      "verseString": "إِلَيْهِ يُرَدُّ عِلْمُ السَّاعَةِ ۚ وَمَا تَخْرُجُ مِنْ ثَمَرَاتٍ مِنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنْثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِ ۚ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَائِي قَالُوا آذَنَّاكَ مَا مِنَّا مِنْ شَهِيدٍ",
      "verseStringB": "To Him is referred the knowledge of the Hour. No fruit emerges from its husk, and no female conceives or delivers, except with His knowledge. And on the Day when He calls to them, “Where are My associates?” They will say, “We admit to you, none of us bears witness.”"
    },
    {
      "verseNumber": 48,
      "verseString": "وَضَلَّ عَنْهُمْ مَا كَانُوا يَدْعُونَ مِنْ قَبْلُ ۖ وَظَنُّوا مَا لَهُمْ مِنْ مَحِيصٍ",
      "verseStringB": "What they used to call on before will abandon them, and they will realize that they have no refuge."
    },
    {
      "verseNumber": 49,
      "verseString": "لَا يَسْأَمُ الْإِنْسَانُ مِنْ دُعَاءِ الْخَيْرِ وَإِنْ مَسَّهُ الشَّرُّ فَيَئُوسٌ قَنُوطٌ",
      "verseStringB": "The human being never tires of praying for good. But when adversity afflicts him, he despairs and loses hope."
    },
    {
      "verseNumber": 50,
      "verseString": "وَلَئِنْ أَذَقْنَاهُ رَحْمَةً مِنَّا مِنْ بَعْدِ ضَرَّاءَ مَسَّتْهُ لَيَقُولَنَّ هَٰذَا لِي وَمَا أَظُنُّ السَّاعَةَ قَائِمَةً وَلَئِنْ رُجِعْتُ إِلَىٰ رَبِّي إِنَّ لِي عِنْدَهُ لَلْحُسْنَىٰ ۚ فَلَنُنَبِّئَنَّ الَّذِينَ كَفَرُوا بِمَا عَمِلُوا وَلَنُذِيقَنَّهُمْ مِنْ عَذَابٍ غَلِيظٍ",
      "verseStringB": "And when We let him taste mercy from Us, after the adversity that had afflicted him, he will say, “This is mine, and I do not think the Hour is coming. And even if I am returned to my Lord, I will have the very best with Him.” We will inform those who disbelieve of what they did, and We will make them taste a harsh punishment."
    },
    {
      "verseNumber": 51,
      "verseString": "وَإِذَا أَنْعَمْنَا عَلَى الْإِنْسَانِ أَعْرَضَ وَنَأَىٰ بِجَانِبِهِ وَإِذَا مَسَّهُ الشَّرُّ فَذُو دُعَاءٍ عَرِيضٍ",
      "verseStringB": "And when We provide comfort for the human being, he withdraws and distances himself; but when adversity befalls him, he starts lengthy prayers."
    },
    {
      "verseNumber": 52,
      "verseString": "قُلْ أَرَأَيْتُمْ إِنْ كَانَ مِنْ عِنْدِ اللَّهِ ثُمَّ كَفَرْتُمْ بِهِ مَنْ أَضَلُّ مِمَّنْ هُوَ فِي شِقَاقٍ بَعِيدٍ",
      "verseStringB": "Say, “Have you considered? If it is from Allah and you reject it—who is more misguided  than he who is cut-off and alienated?”"
    },
    {
      "verseNumber": 53,
      "verseString": "سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّىٰ يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ ۗ أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ",
      "verseStringB": "We will show them Our signs on the horizons, and within themselves—until it becomes clear to them that it is the truth. Is it not enough that your Lord is a witness over everything?"
    },
    {
      "verseNumber": 54,
      "verseString": "أَلَا إِنَّهُمْ فِي مِرْيَةٍ مِنْ لِقَاءِ رَبِّهِمْ ۗ أَلَا إِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ",
      "verseStringB": "Surely, they are in doubt about the meeting with their Lord. Surely, He surrounds everything."
    }
  ],
  "nameEnglish": "Detailed",
  "nameTrans": "Fussilat",
  "nameArabic": "فصلت",
  "chapterNumber": 41,
  "nVerses": 54
}