{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "حم",
      "verseStringB": "Ha. Meem."
    },
    {
      "verseNumber": 2,
      "verseString": "وَالْكِتَابِ الْمُبِينِ",
      "verseStringB": "By the Book that makes things clear."
    },
    {
      "verseNumber": 3,
      "verseString": "إِنَّا جَعَلْنَاهُ قُرْآنًا عَرَبِيًّا لَعَلَّكُمْ تَعْقِلُونَ",
      "verseStringB": "We made it a Quran in Arabic, so that you may understand."
    },
    {
      "verseNumber": 4,
      "verseString": "وَإِنَّهُ فِي أُمِّ الْكِتَابِ لَدَيْنَا لَعَلِيٌّ حَكِيمٌ",
      "verseStringB": "And it is in the Book's Source with Us: outstanding and wise."
    },
    {
      "verseNumber": 5,
      "verseString": "أَفَنَضْرِبُ عَنْكُمُ الذِّكْرَ صَفْحًا أَنْ كُنْتُمْ قَوْمًا مُسْرِفِينَ",
      "verseStringB": "Should We withdraw the Reminder from you, since you are an excessive people?"
    },
    {
      "verseNumber": 6,
      "verseString": "وَكَمْ أَرْسَلْنَا مِنْ نَبِيٍّ فِي الْأَوَّلِينَ",
      "verseStringB": "How many a prophet did We send among the ancients?"
    },
    {
      "verseNumber": 7,
      "verseString": "وَمَا يَأْتِيهِمْ مِنْ نَبِيٍّ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ",
      "verseStringB": "No messenger came to them, but they ridiculed him."
    },
    {
      "verseNumber": 8,
      "verseString": "فَأَهْلَكْنَا أَشَدَّ مِنْهُمْ بَطْشًا وَمَضَىٰ مَثَلُ الْأَوَّلِينَ",
      "verseStringB": "We destroyed people more powerful than them, and the example of the ancients has passed away."
    },
    {
      "verseNumber": 9,
      "verseString": "وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ خَلَقَهُنَّ الْعَزِيزُ الْعَلِيمُ",
      "verseStringB": "And if you asked them, “Who created the heavens and the earth?” They would say, “The Almighty, the All-Knowing created them.”"
    },
    {
      "verseNumber": 10,
      "verseString": "الَّذِي جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا وَجَعَلَ لَكُمْ فِيهَا سُبُلًا لَعَلَّكُمْ تَهْتَدُونَ",
      "verseStringB": "He who made the earth a habitat for you, and traced pathways on it for you, so that you may be guided."
    },
    {
      "verseNumber": 11,
      "verseString": "وَالَّذِي نَزَّلَ مِنَ السَّمَاءِ مَاءً بِقَدَرٍ فَأَنْشَرْنَا بِهِ بَلْدَةً مَيْتًا ۚ كَذَٰلِكَ تُخْرَجُونَ",
      "verseStringB": "And He who sends down water from the sky in a precise measure, with which We give life to a lifeless land. Similarly, you will be brought out."
    },
    {
      "verseNumber": 12,
      "verseString": "وَالَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا وَجَعَلَ لَكُمْ مِنَ الْفُلْكِ وَالْأَنْعَامِ مَا تَرْكَبُونَ",
      "verseStringB": "And He Who created the pairs, all of them, and provided you with ships and animals on which you ride."
    },
    {
      "verseNumber": 13,
      "verseString": "لِتَسْتَوُوا عَلَىٰ ظُهُورِهِ ثُمَّ تَذْكُرُوا نِعْمَةَ رَبِّكُمْ إِذَا اسْتَوَيْتُمْ عَلَيْهِ وَتَقُولُوا سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ",
      "verseStringB": "That you may mount their backs, and remember your Lord’s blessings once you have settled on them, and say, “Glory to the One Who placed these at our service; surely, we could not have done it by ourselves."
    },
    {
      "verseNumber": 14,
      "verseString": "وَإِنَّا إِلَىٰ رَبِّنَا لَمُنْقَلِبُونَ",
      "verseStringB": "And surely, to our Lord, we will return.”"
    },
    {
      "verseNumber": 15,
      "verseString": "وَجَعَلُوا لَهُ مِنْ عِبَادِهِ جُزْءًا ۚ إِنَّ الْإِنْسَانَ لَكَفُورٌ مُبِينٌ",
      "verseStringB": "Yet they made one of His servants a part of Him. The human being is clearly ungrateful."
    },
    {
      "verseNumber": 16,
      "verseString": "أَمِ اتَّخَذَ مِمَّا يَخْلُقُ بَنَاتٍ وَأَصْفَاكُمْ بِالْبَنِينَ",
      "verseStringB": "Or did He take daughters from what He created, and He favored you with sons?"
    },
    {
      "verseNumber": 17,
      "verseString": "وَإِذَا بُشِّرَ أَحَدُهُمْ بِمَا ضَرَبَ لِلرَّحْمَٰنِ مَثَلًا ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ",
      "verseStringB": "Yet when one of them is given news of what he attributes to the Compassionate, his face darkens, and he chokes with grief."
    },
    {
      "verseNumber": 18,
      "verseString": "أَوَمَنْ يُنَشَّأُ فِي الْحِلْيَةِ وَهُوَ فِي الْخِصَامِ غَيْرُ مُبِينٍ",
      "verseStringB": "“Someone raised amid ornaments, and cannot produce a clear argument?”"
    },
    {
      "verseNumber": 19,
      "verseString": "وَجَعَلُوا الْمَلَائِكَةَ الَّذِينَ هُمْ عِبَادُ الرَّحْمَٰنِ إِنَاثًا ۚ أَشَهِدُوا خَلْقَهُمْ ۚ سَتُكْتَبُ شَهَادَتُهُمْ وَيُسْأَلُونَ",
      "verseStringB": "And they appoint the angels, who are servants to the Compassionate, as females. Did they witness their creation? Their claim will be recorded, and they will be questioned."
    },
    {
      "verseNumber": 20,
      "verseString": "وَقَالُوا لَوْ شَاءَ الرَّحْمَٰنُ مَا عَبَدْنَاهُمْ ۗ مَا لَهُمْ بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَخْرُصُونَ",
      "verseStringB": "And they say, “Had the Most Gracious willed, we would have never worshipped them.” But they have no knowledge of that. They do nothing but lie."
    },
    {
      "verseNumber": 21,
      "verseString": "أَمْ آتَيْنَاهُمْ كِتَابًا مِنْ قَبْلِهِ فَهُمْ بِهِ مُسْتَمْسِكُونَ",
      "verseStringB": "Or did We give them a book prior to this one, to which they adhere?"
    },
    {
      "verseNumber": 22,
      "verseString": "بَلْ قَالُوا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِمْ مُهْتَدُونَ",
      "verseStringB": "But they say, “We found our parents on a course, and we are guided in their footsteps.”"
    },
    {
      "verseNumber": 23,
      "verseString": "وَكَذَٰلِكَ مَا أَرْسَلْنَا مِنْ قَبْلِكَ فِي قَرْيَةٍ مِنْ نَذِيرٍ إِلَّا قَالَ مُتْرَفُوهَا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِمْ مُقْتَدُونَ",
      "verseStringB": "Likewise, We sent no warner before you to any town, but the elite among them said, “We found our forefathers on a course, and we are following in their footsteps.”"
    },
    {
      "verseNumber": 24,
      "verseString": "قَالَ أَوَلَوْ جِئْتُكُمْ بِأَهْدَىٰ مِمَّا وَجَدْتُمْ عَلَيْهِ آبَاءَكُمْ ۖ قَالُوا إِنَّا بِمَا أُرْسِلْتُمْ بِهِ كَافِرُونَ",
      "verseStringB": "He would say, “Even if I bring you better guidance than what you found your forefathers following?” They would say, “We reject what you are sent with.”"
    },
    {
      "verseNumber": 25,
      "verseString": "فَانْتَقَمْنَا مِنْهُمْ ۖ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ",
      "verseStringB": "So We wreaked vengeance on them. See, then, what the fate of the deniers was."
    },
    {
      "verseNumber": 26,
      "verseString": "وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ وَقَوْمِهِ إِنَّنِي بَرَاءٌ مِمَّا تَعْبُدُونَ",
      "verseStringB": "When Abraham said to his father and his people, “I am innocent of what you worship."
    },
    {
      "verseNumber": 27,
      "verseString": "إِلَّا الَّذِي فَطَرَنِي فَإِنَّهُ سَيَهْدِينِ",
      "verseStringB": "Except for He who originated me, and He will guide me.”"
    },
    {
      "verseNumber": 28,
      "verseString": "وَجَعَلَهَا كَلِمَةً بَاقِيَةً فِي عَقِبِهِ لَعَلَّهُمْ يَرْجِعُونَ",
      "verseStringB": "And He made it a word enduring among his descendants, so that they may return."
    },
    {
      "verseNumber": 29,
      "verseString": "بَلْ مَتَّعْتُ هَٰؤُلَاءِ وَآبَاءَهُمْ حَتَّىٰ جَاءَهُمُ الْحَقُّ وَرَسُولٌ مُبِينٌ",
      "verseStringB": "I gave these and their forefathers some enjoyment—until the truth came to them, and a messenger making things clear."
    },
    {
      "verseNumber": 30,
      "verseString": "وَلَمَّا جَاءَهُمُ الْحَقُّ قَالُوا هَٰذَا سِحْرٌ وَإِنَّا بِهِ كَافِرُونَ",
      "verseStringB": "But when the truth came to them, they said, “This is sorcery, and we refuse to believe in it.”"
    },
    {
      "verseNumber": 31,
      "verseString": "وَقَالُوا لَوْلَا نُزِّلَ هَٰذَا الْقُرْآنُ عَلَىٰ رَجُلٍ مِنَ الْقَرْيَتَيْنِ عَظِيمٍ",
      "verseStringB": "And they said, “Why was this Quran not sent down to a man of importance from the two towns?”"
    },
    {
      "verseNumber": 32,
      "verseString": "أَهُمْ يَقْسِمُونَ رَحْمَتَ رَبِّكَ ۚ نَحْنُ قَسَمْنَا بَيْنَهُمْ مَعِيشَتَهُمْ فِي الْحَيَاةِ الدُّنْيَا ۚ وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا ۗ وَرَحْمَتُ رَبِّكَ خَيْرٌ مِمَّا يَجْمَعُونَ",
      "verseStringB": "Is it they who allocate your Lord’s mercy? We have allocated for them their livelihood among them in this life, and We elevated some of them above others in rank, so that some of them may employ others in service. But your Lord’s mercy is better than what they accumulate."
    },
    {
      "verseNumber": 33,
      "verseString": "وَلَوْلَا أَنْ يَكُونَ النَّاسُ أُمَّةً وَاحِدَةً لَجَعَلْنَا لِمَنْ يَكْفُرُ بِالرَّحْمَٰنِ لِبُيُوتِهِمْ سُقُفًا مِنْ فِضَّةٍ وَمَعَارِجَ عَلَيْهَا يَظْهَرُونَ",
      "verseStringB": "Were it not that humanity would become a single community, We would have provided those who disbelieve in the Most Gracious with silver roofs to their houses—and stairways by which they ascend."
    },
    {
      "verseNumber": 34,
      "verseString": "وَلِبُيُوتِهِمْ أَبْوَابًا وَسُرُرًا عَلَيْهَا يَتَّكِئُونَ",
      "verseStringB": "And doors to their houses, and furnishings on which they recline."
    },
    {
      "verseNumber": 35,
      "verseString": "وَزُخْرُفًا ۚ وَإِنْ كُلُّ ذَٰلِكَ لَمَّا مَتَاعُ الْحَيَاةِ الدُّنْيَا ۚ وَالْآخِرَةُ عِنْدَ رَبِّكَ لِلْمُتَّقِينَ",
      "verseStringB": "And decorations. Yet all this is nothing but the possessions of this life. Yet the Hereafter, in the presence of your Lord, is for the reverent."
    },
    {
      "verseNumber": 36,
      "verseString": "وَمَنْ يَعْشُ عَنْ ذِكْرِ الرَّحْمَٰنِ نُقَيِّضْ لَهُ شَيْطَانًا فَهُوَ لَهُ قَرِينٌ",
      "verseStringB": "Whoever shuns the remembrance of the Mercy-Giver, We assign for him a devil, to be his companion."
    },
    {
      "verseNumber": 37,
      "verseString": "وَإِنَّهُمْ لَيَصُدُّونَهُمْ عَنِ السَّبِيلِ وَيَحْسَبُونَ أَنَّهُمْ مُهْتَدُونَ",
      "verseStringB": "They hinder them from the path, though they think they are guided."
    },
    {
      "verseNumber": 38,
      "verseString": "حَتَّىٰ إِذَا جَاءَنَا قَالَ يَا لَيْتَ بَيْنِي وَبَيْنَكَ بُعْدَ الْمَشْرِقَيْنِ فَبِئْسَ الْقَرِينُ",
      "verseStringB": "Until, when he comes to Us, he will say, “If only there were between me and you the distance of the two Easts! What an evil companion!”"
    },
    {
      "verseNumber": 39,
      "verseString": "وَلَنْ يَنْفَعَكُمُ الْيَوْمَ إِذْ ظَلَمْتُمْ أَنَّكُمْ فِي الْعَذَابِ مُشْتَرِكُونَ",
      "verseStringB": "Yet on that Day, it will not benefit you, since you did wrong, to share in the punishment."
    },
    {
      "verseNumber": 40,
      "verseString": "أَفَأَنْتَ تُسْمِعُ الصُّمَّ أَوْ تَهْدِي الْعُمْيَ وَمَنْ كَانَ فِي ضَلَالٍ مُبِينٍ",
      "verseStringB": "Can you make the deaf hear, or guide the blind, and him who is in obvious error?"
    },
    {
      "verseNumber": 41,
      "verseString": "فَإِمَّا نَذْهَبَنَّ بِكَ فَإِنَّا مِنْهُمْ مُنْتَقِمُونَ",
      "verseStringB": "Even if We take you away, We will wreak vengeance on them."
    },
    {
      "verseNumber": 42,
      "verseString": "أَوْ نُرِيَنَّكَ الَّذِي وَعَدْنَاهُمْ فَإِنَّا عَلَيْهِمْ مُقْتَدِرُونَ",
      "verseStringB": "Or show you what We have promised them; We have absolute power over them."
    },
    {
      "verseNumber": 43,
      "verseString": "فَاسْتَمْسِكْ بِالَّذِي أُوحِيَ إِلَيْكَ ۖ إِنَّكَ عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ",
      "verseStringB": "So adhere to what is revealed to you. You are on a straight path."
    },
    {
      "verseNumber": 44,
      "verseString": "وَإِنَّهُ لَذِكْرٌ لَكَ وَلِقَوْمِكَ ۖ وَسَوْفَ تُسْأَلُونَ",
      "verseStringB": "It is a message for you, and for your people, and you will be questioned."
    },
    {
      "verseNumber": 45,
      "verseString": "وَاسْأَلْ مَنْ أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رُسُلِنَا أَجَعَلْنَا مِنْ دُونِ الرَّحْمَٰنِ آلِهَةً يُعْبَدُونَ",
      "verseStringB": "And ask those of Our messengers whom We sent before you: “Did We appoint any gods to be served other than the Beneficent?”"
    },
    {
      "verseNumber": 46,
      "verseString": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ فَقَالَ إِنِّي رَسُولُ رَبِّ الْعَالَمِينَ",
      "verseStringB": "We sent Moses with Our revelations to Pharaoh and his dignitaries. He said, “I am the Messenger of the Lord of the Worlds.”"
    },
    {
      "verseNumber": 47,
      "verseString": "فَلَمَّا جَاءَهُمْ بِآيَاتِنَا إِذَا هُمْ مِنْهَا يَضْحَكُونَ",
      "verseStringB": "But when he brought them Our signs, they started laughing at them."
    },
    {
      "verseNumber": 48,
      "verseString": "وَمَا نُرِيهِمْ مِنْ آيَةٍ إِلَّا هِيَ أَكْبَرُ مِنْ أُخْتِهَا ۖ وَأَخَذْنَاهُمْ بِالْعَذَابِ لَعَلَّهُمْ يَرْجِعُونَ",
      "verseStringB": "Every miracle We showed them was more marvelous than its counterpart. And We afflicted them with the plagues, so that they may return."
    },
    {
      "verseNumber": 49,
      "verseString": "وَقَالُوا يَا أَيُّهَ السَّاحِرُ ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَ إِنَّنَا لَمُهْتَدُونَ",
      "verseStringB": "They said, “O magician, pray to your Lord on our behalf, by virtue of the covenant He made with you, and we will be guided.”"
    },
    {
      "verseNumber": 50,
      "verseString": "فَلَمَّا كَشَفْنَا عَنْهُمُ الْعَذَابَ إِذَا هُمْ يَنْكُثُونَ",
      "verseStringB": "Yet when We lifted the suffering from them, they immediately broke their promise."
    },
    {
      "verseNumber": 51,
      "verseString": "وَنَادَىٰ فِرْعَوْنُ فِي قَوْمِهِ قَالَ يَا قَوْمِ أَلَيْسَ لِي مُلْكُ مِصْرَ وَهَٰذِهِ الْأَنْهَارُ تَجْرِي مِنْ تَحْتِي ۖ أَفَلَا تُبْصِرُونَ",
      "verseStringB": "Then Pharaoh proclaimed among his people, saying, “O my people, do I not own the Kingdom of Egypt, and these rivers flow beneath me? Do you not see?"
    },
    {
      "verseNumber": 52,
      "verseString": "أَمْ أَنَا خَيْرٌ مِنْ هَٰذَا الَّذِي هُوَ مَهِينٌ وَلَا يَكَادُ يُبِينُ",
      "verseStringB": "Am I not better than this miserable wretch, who can barely express himself?"
    },
    {
      "verseNumber": 53,
      "verseString": "فَلَوْلَا أُلْقِيَ عَلَيْهِ أَسْوِرَةٌ مِنْ ذَهَبٍ أَوْ جَاءَ مَعَهُ الْمَلَائِكَةُ مُقْتَرِنِينَ",
      "verseStringB": "So why bracelets of gold are not dropped on him, or the angels came with him in procession?”"
    },
    {
      "verseNumber": 54,
      "verseString": "فَاسْتَخَفَّ قَوْمَهُ فَأَطَاعُوهُ ۚ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ",
      "verseStringB": "Thus he belittled his people, and they obeyed him. They were disobedient people."
    },
    {
      "verseNumber": 55,
      "verseString": "فَلَمَّا آسَفُونَا انْتَقَمْنَا مِنْهُمْ فَأَغْرَقْنَاهُمْ أَجْمَعِينَ",
      "verseStringB": "And when they provoked Our wrath, We took vengeance on them, and We drowned them all."
    },
    {
      "verseNumber": 56,
      "verseString": "فَجَعَلْنَاهُمْ سَلَفًا وَمَثَلًا لِلْآخِرِينَ",
      "verseStringB": "And We made them a precedent and an example for the later ones."
    },
    {
      "verseNumber": 57,
      "verseString": "وَلَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا إِذَا قَوْمُكَ مِنْهُ يَصِدُّونَ",
      "verseStringB": "And when the son of Mary was cited as an example, your people turned away from it."
    },
    {
      "verseNumber": 58,
      "verseString": "وَقَالُوا أَآلِهَتُنَا خَيْرٌ أَمْ هُوَ ۚ مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا ۚ بَلْ هُمْ قَوْمٌ خَصِمُونَ",
      "verseStringB": "They said, “Are our gods better, or is he?” They cited him only for argument. In fact, they are a quarrelsome people."
    },
    {
      "verseNumber": 59,
      "verseString": "إِنْ هُوَ إِلَّا عَبْدٌ أَنْعَمْنَا عَلَيْهِ وَجَعَلْنَاهُ مَثَلًا لِبَنِي إِسْرَائِيلَ",
      "verseStringB": "He was just a servant whom We favored, and We made him an example for the Children of Israel."
    },
    {
      "verseNumber": 60,
      "verseString": "وَلَوْ نَشَاءُ لَجَعَلْنَا مِنْكُمْ مَلَائِكَةً فِي الْأَرْضِ يَخْلُفُونَ",
      "verseStringB": "Had We willed, We would have appointed angels among you, succeeding one another on earth."
    },
    {
      "verseNumber": 61,
      "verseString": "وَإِنَّهُ لَعِلْمٌ لِلسَّاعَةِ فَلَا تَمْتَرُنَّ بِهَا وَاتَّبِعُونِ ۚ هَٰذَا صِرَاطٌ مُسْتَقِيمٌ",
      "verseStringB": "And he is an indication of the Hour, so have no doubt about it, and follow Me. This is a straight path."
    },
    {
      "verseNumber": 62,
      "verseString": "وَلَا يَصُدَّنَّكُمُ الشَّيْطَانُ ۖ إِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ",
      "verseStringB": "And let not Satan turn you away. He is an open enemy to you."
    },
    {
      "verseNumber": 63,
      "verseString": "وَلَمَّا جَاءَ عِيسَىٰ بِالْبَيِّنَاتِ قَالَ قَدْ جِئْتُكُمْ بِالْحِكْمَةِ وَلِأُبَيِّنَ لَكُمْ بَعْضَ الَّذِي تَخْتَلِفُونَ فِيهِ ۖ فَاتَّقُوا اللَّهَ وَأَطِيعُونِ",
      "verseStringB": "And when Jesus came with the clear proofs, he said, “I have come to you with wisdom, and to clarify for you some of what you differ about. So reverence Allah, and obey me."
    },
    {
      "verseNumber": 64,
      "verseString": "إِنَّ اللَّهَ هُوَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ ۚ هَٰذَا صِرَاطٌ مُسْتَقِيمٌ",
      "verseStringB": "Allah is my Lord and your Lord, so worship Him—this is a straight path.”"
    },
    {
      "verseNumber": 65,
      "verseString": "فَاخْتَلَفَ الْأَحْزَابُ مِنْ بَيْنِهِمْ ۖ فَوَيْلٌ لِلَّذِينَ ظَلَمُوا مِنْ عَذَابِ يَوْمٍ أَلِيمٍ",
      "verseStringB": "But the factions differed among themselves. So woe to those who do wrong from the punishment of a painful Day."
    },
    {
      "verseNumber": 66,
      "verseString": "هَلْ يَنْظُرُونَ إِلَّا السَّاعَةَ أَنْ تَأْتِيَهُمْ بَغْتَةً وَهُمْ لَا يَشْعُرُونَ",
      "verseStringB": "Are they only waiting for the Hour to come upon them suddenly? When they are not expecting it?"
    },
    {
      "verseNumber": 67,
      "verseString": "الْأَخِلَّاءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا الْمُتَّقِينَ",
      "verseStringB": "On that day, friends will be enemies of one another, except the righteous."
    },
    {
      "verseNumber": 68,
      "verseString": "يَا عِبَادِ لَا خَوْفٌ عَلَيْكُمُ الْيَوْمَ وَلَا أَنْتُمْ تَحْزَنُونَ",
      "verseStringB": "O, My worshipers! You have nothing to fear on that Day, nor will you grieve."
    },
    {
      "verseNumber": 69,
      "verseString": "الَّذِينَ آمَنُوا بِآيَاتِنَا وَكَانُوا مُسْلِمِينَ",
      "verseStringB": "Those who believed in Our revelations and were submitters."
    },
    {
      "verseNumber": 70,
      "verseString": "ادْخُلُوا الْجَنَّةَ أَنْتُمْ وَأَزْوَاجُكُمْ تُحْبَرُونَ",
      "verseStringB": "Enter Paradise, you and your spouses, made joyous."
    },
    {
      "verseNumber": 71,
      "verseString": "يُطَافُ عَلَيْهِمْ بِصِحَافٍ مِنْ ذَهَبٍ وَأَكْوَابٍ ۖ وَفِيهَا مَا تَشْتَهِيهِ الْأَنْفُسُ وَتَلَذُّ الْأَعْيُنُ ۖ وَأَنْتُمْ فِيهَا خَالِدُونَ",
      "verseStringB": "They will be served around with trays of gold, and goblets. Therein is whatever the souls desire and delights the eyes. Therein you will stay forever."
    },
    {
      "verseNumber": 72,
      "verseString": "وَتِلْكَ الْجَنَّةُ الَّتِي أُورِثْتُمُوهَا بِمَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "This is the Garden you are made to inherit, because of what you used to do."
    },
    {
      "verseNumber": 73,
      "verseString": "لَكُمْ فِيهَا فَاكِهَةٌ كَثِيرَةٌ مِنْهَا تَأْكُلُونَ",
      "verseStringB": "There you will have abundant fruit, from which you eat."
    },
    {
      "verseNumber": 74,
      "verseString": "إِنَّ الْمُجْرِمِينَ فِي عَذَابِ جَهَنَّمَ خَالِدُونَ",
      "verseStringB": "As for the guilty: they will be in the suffering of Hell, forever."
    },
    {
      "verseNumber": 75,
      "verseString": "لَا يُفَتَّرُ عَنْهُمْ وَهُمْ فِيهِ مُبْلِسُونَ",
      "verseStringB": "It will never be eased for them. In it, they will be devastated."
    },
    {
      "verseNumber": 76,
      "verseString": "وَمَا ظَلَمْنَاهُمْ وَلَٰكِنْ كَانُوا هُمُ الظَّالِمِينَ",
      "verseStringB": "We did them no injustice, but it was they who were the unjust."
    },
    {
      "verseNumber": 77,
      "verseString": "وَنَادَوْا يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ ۖ قَالَ إِنَّكُمْ مَاكِثُونَ",
      "verseStringB": "And they will cry, “O Malek, let your Lord finish us off.” He will say, “You are staying.”"
    },
    {
      "verseNumber": 78,
      "verseString": "لَقَدْ جِئْنَاكُمْ بِالْحَقِّ وَلَٰكِنَّ أَكْثَرَكُمْ لِلْحَقِّ كَارِهُونَ",
      "verseStringB": "We have given you the truth, but most of you dislike the truth."
    },
    {
      "verseNumber": 79,
      "verseString": "أَمْ أَبْرَمُوا أَمْرًا فَإِنَّا مُبْرِمُونَ",
      "verseStringB": "Or have they mastered some scheme? We are planning."
    },
    {
      "verseNumber": 80,
      "verseString": "أَمْ يَحْسَبُونَ أَنَّا لَا نَسْمَعُ سِرَّهُمْ وَنَجْوَاهُمْ ۚ بَلَىٰ وَرُسُلُنَا لَدَيْهِمْ يَكْتُبُونَ",
      "verseStringB": "Or do they think that We cannot hear their secrets and their whispers? Yes indeed; and Our envoys are with them, writing."
    },
    {
      "verseNumber": 81,
      "verseString": "قُلْ إِنْ كَانَ لِلرَّحْمَٰنِ وَلَدٌ فَأَنَا أَوَّلُ الْعَابِدِينَ",
      "verseStringB": "Say, “If the Compassionate had a child, I would be the first of the worshipers.”"
    },
    {
      "verseNumber": 82,
      "verseString": "سُبْحَانَ رَبِّ السَّمَاوَاتِ وَالْأَرْضِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ",
      "verseStringB": "Glorified is the Lord of the heavens and the earth, the Lord of the Throne, beyond what they describe."
    },
    {
      "verseNumber": 83,
      "verseString": "فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّىٰ يُلَاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ",
      "verseStringB": "So leave them to blunder and play, until they meet their Day which they are promised."
    },
    {
      "verseNumber": 84,
      "verseString": "وَهُوَ الَّذِي فِي السَّمَاءِ إِلَٰهٌ وَفِي الْأَرْضِ إِلَٰهٌ ۚ وَهُوَ الْحَكِيمُ الْعَلِيمُ",
      "verseStringB": "And it is He who is Allah in heaven, and Allah on earth. And He is the Wise, the Knower."
    },
    {
      "verseNumber": 85,
      "verseString": "وَتَبَارَكَ الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَعِنْدَهُ عِلْمُ السَّاعَةِ وَإِلَيْهِ تُرْجَعُونَ",
      "verseStringB": "And Blessed is He to Whom belongs sovereignty over the heavens and the earth and everything between them, and with Whom is knowledge of the Hour, and to Whom you will be returned."
    },
    {
      "verseNumber": 86,
      "verseString": "وَلَا يَمْلِكُ الَّذِينَ يَدْعُونَ مِنْ دُونِهِ الشَّفَاعَةَ إِلَّا مَنْ شَهِدَ بِالْحَقِّ وَهُمْ يَعْلَمُونَ",
      "verseStringB": "Those they call upon besides Him have no power of intercession; except whoever testifies with the truth, and they know."
    },
    {
      "verseNumber": 87,
      "verseString": "وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ",
      "verseStringB": "And if you asked them, “Who created them?” They would say, “Allah.” Then why do they deviate?"
    },
    {
      "verseNumber": 88,
      "verseString": "وَقِيلِهِ يَا رَبِّ إِنَّ هَٰؤُلَاءِ قَوْمٌ لَا يُؤْمِنُونَ",
      "verseStringB": "As for his statement: “O my Lord, these are a people who do not believe.”"
    },
    {
      "verseNumber": 89,
      "verseString": "فَاصْفَحْ عَنْهُمْ وَقُلْ سَلَامٌ ۚ فَسَوْفَ يَعْلَمُونَ",
      "verseStringB": "Pardon them, and say, “Peace.” They will eventually know."
    }
  ],
  "nameEnglish": "Decorations",
  "nameTrans": "az-Zukhruf",
  "nameArabic": "الزخرف",
  "chapterNumber": 43,
  "nVerses": 89
}