{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "حم",
      "verseStringB": "Ha. Meem."
    },
    {
      "verseNumber": 2,
      "verseString": "تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ",
      "verseStringB": "The revelation of the Book is from Allah—the Mighty, the Wise."
    },
    {
      "verseNumber": 3,
      "verseString": "إِنَّ فِي السَّمَاوَاتِ وَالْأَرْضِ لَآيَاتٍ لِلْمُؤْمِنِينَ",
      "verseStringB": "In the heavens and the earth are proofs for the believers."
    },
    {
      "verseNumber": 4,
      "verseString": "وَفِي خَلْقِكُمْ وَمَا يَبُثُّ مِنْ دَابَّةٍ آيَاتٌ لِقَوْمٍ يُوقِنُونَ",
      "verseStringB": "And in your own creation, and in the creatures He scattered, are signs for a people who are certain."
    },
    {
      "verseNumber": 5,
      "verseString": "وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَمَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ رِزْقٍ فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا وَتَصْرِيفِ الرِّيَاحِ آيَاتٌ لِقَوْمٍ يَعْقِلُونَ",
      "verseStringB": "And in the alternation of night and day, and in the sustenance Allah sends down from the sky, with which He revives the earth after its death, and in the shifting of the winds, are marvels for people who reason."
    },
    {
      "verseNumber": 6,
      "verseString": "تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۖ فَبِأَيِّ حَدِيثٍ بَعْدَ اللَّهِ وَآيَاتِهِ يُؤْمِنُونَ",
      "verseStringB": "These are Allah’s verses which We convey to you in truth. So what message will they believe in after Allah and His revelations?"
    },
    {
      "verseNumber": 7,
      "verseString": "وَيْلٌ لِكُلِّ أَفَّاكٍ أَثِيمٍ",
      "verseStringB": "Woe to every sinful liar."
    },
    {
      "verseNumber": 8,
      "verseString": "يَسْمَعُ آيَاتِ اللَّهِ تُتْلَىٰ عَلَيْهِ ثُمَّ يُصِرُّ مُسْتَكْبِرًا كَأَنْ لَمْ يَسْمَعْهَا ۖ فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ",
      "verseStringB": "Who hears Allah's revelations being recited to him, then persists arrogantly, as if he did not hear them. So give him news of a painful punishment."
    },
    {
      "verseNumber": 9,
      "verseString": "وَإِذَا عَلِمَ مِنْ آيَاتِنَا شَيْئًا اتَّخَذَهَا هُزُوًا ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ مُهِينٌ",
      "verseStringB": "And when he learns something of Our revelations, he takes them as a joke. For such, there is a humiliating punishment."
    },
    {
      "verseNumber": 10,
      "verseString": "مِنْ وَرَائِهِمْ جَهَنَّمُ ۖ وَلَا يُغْنِي عَنْهُمْ مَا كَسَبُوا شَيْئًا وَلَا مَا اتَّخَذُوا مِنْ دُونِ اللَّهِ أَوْلِيَاءَ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ",
      "verseStringB": "Beyond them lies Hell. And what they have earned will not benefit them at all, nor will those they adopted as lords instead of Allah. They will have a terrible punishment."
    },
    {
      "verseNumber": 11,
      "verseString": "هَٰذَا هُدًى ۖ وَالَّذِينَ كَفَرُوا بِآيَاتِ رَبِّهِمْ لَهُمْ عَذَابٌ مِنْ رِجْزٍ أَلِيمٌ",
      "verseStringB": "This is guidance. Those who disbelieve in their Lord’s signs will have a punishment of agonizing pain."
    },
    {
      "verseNumber": 12,
      "verseString": "اللَّهُ الَّذِي سَخَّرَ لَكُمُ الْبَحْرَ لِتَجْرِيَ الْفُلْكُ فِيهِ بِأَمْرِهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ",
      "verseStringB": "Allah is He who placed the sea at your service, so that ships may sail upon it by His command, and so that you may seek of His bounty, and so that you may give thanks."
    },
    {
      "verseNumber": 13,
      "verseString": "وَسَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِنْهُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ",
      "verseStringB": "And He placed at your service whatever is in the heavens and whatever is on earth—all is from Him. Surely in this are signs for a people who think."
    },
    {
      "verseNumber": 14,
      "verseString": "قُلْ لِلَّذِينَ آمَنُوا يَغْفِرُوا لِلَّذِينَ لَا يَرْجُونَ أَيَّامَ اللَّهِ لِيَجْزِيَ قَوْمًا بِمَا كَانُوا يَكْسِبُونَ",
      "verseStringB": "Tell those who believe to forgive those who do not hope for the Days of Allah, so that He will reward people for what they have earned."
    },
    {
      "verseNumber": 15,
      "verseString": "مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ ۖ وَمَنْ أَسَاءَ فَعَلَيْهَا ۖ ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ",
      "verseStringB": "Whoever works righteousness: it is for himself. And whoever commits evil: it is against himself. Then to your Lord, you will be returned."
    },
    {
      "verseNumber": 16,
      "verseString": "وَلَقَدْ آتَيْنَا بَنِي إِسْرَائِيلَ الْكِتَابَ وَالْحُكْمَ وَالنُّبُوَّةَ وَرَزَقْنَاهُمْ مِنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَى الْعَالَمِينَ",
      "verseStringB": "And We gave the Children of Israel the Book, wisdom, and prophethood. And We provided them with good things. And We gave them an advantage over all other people."
    },
    {
      "verseNumber": 17,
      "verseString": "وَآتَيْنَاهُمْ بَيِّنَاتٍ مِنَ الْأَمْرِ ۖ فَمَا اخْتَلَفُوا إِلَّا مِنْ بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۚ إِنَّ رَبَّكَ يَقْضِي بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ",
      "verseStringB": "And We gave them precise rulings. They fell into dispute only after knowledge came to them, out of envy among themselves. Your Lord will judge between them on the Day of Resurrection regarding the things they differed about."
    },
    {
      "verseNumber": 18,
      "verseString": "ثُمَّ جَعَلْنَاكَ عَلَىٰ شَرِيعَةٍ مِنَ الْأَمْرِ فَاتَّبِعْهَا وَلَا تَتَّبِعْ أَهْوَاءَ الَّذِينَ لَا يَعْلَمُونَ",
      "verseStringB": "Then We placed you upon a clear path from the Command, so follow it. So do not follow the inclinations of those who do not know."
    },
    {
      "verseNumber": 19,
      "verseString": "إِنَّهُمْ لَنْ يُغْنُوا عَنْكَ مِنَ اللَّهِ شَيْئًا ۚ وَإِنَّ الظَّالِمِينَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۖ وَاللَّهُ وَلِيُّ الْمُتَّقِينَ",
      "verseStringB": "They will not avail you against Allah in any way. The wrongdoers are protectors of one another, while Allah is the Protector of the righteous."
    },
    {
      "verseNumber": 20,
      "verseString": "هَٰذَا بَصَائِرُ لِلنَّاسِ وَهُدًى وَرَحْمَةٌ لِقَوْمٍ يُوقِنُونَ",
      "verseStringB": "These are insight for humanity, and guidance, and mercy for people who are certain."
    },
    {
      "verseNumber": 21,
      "verseString": "أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا السَّيِّئَاتِ أَنْ نَجْعَلَهُمْ كَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَوَاءً مَحْيَاهُمْ وَمَمَاتُهُمْ ۚ سَاءَ مَا يَحْكُمُونَ",
      "verseStringB": "Do those who indulge in bad deeds assume that We will regard them as equal to those who believe and do good deeds, whether in their life or their death? How wrong is their judgment!"
    },
    {
      "verseNumber": 22,
      "verseString": "وَخَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَلِتُجْزَىٰ كُلُّ نَفْسٍ بِمَا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
      "verseStringB": "Allah created the heavens and the earth for a purpose—and so that every soul is repaid for what it did. And they will not be wronged."
    },
    {
      "verseNumber": 23,
      "verseString": "أَفَرَأَيْتَ مَنِ اتَّخَذَ إِلَٰهَهُ هَوَاهُ وَأَضَلَّهُ اللَّهُ عَلَىٰ عِلْمٍ وَخَتَمَ عَلَىٰ سَمْعِهِ وَقَلْبِهِ وَجَعَلَ عَلَىٰ بَصَرِهِ غِشَاوَةً فَمَنْ يَهْدِيهِ مِنْ بَعْدِ اللَّهِ ۚ أَفَلَا تَذَكَّرُونَ",
      "verseStringB": "Have you considered him who took his desires as his god? And Allah led him astray knowingly, and He sealed his hearing and his heart, and He placed a veil over his vision. So who can guide him after Allah? Will you not reflect?"
    },
    {
      "verseNumber": 24,
      "verseString": "وَقَالُوا مَا هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ ۚ وَمَا لَهُمْ بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَظُنُّونَ",
      "verseStringB": "And they say, “There is nothing except our life in this world: we die, and we live, and only time destroys us.” But they have no knowledge of this; they only speculate."
    },
    {
      "verseNumber": 25,
      "verseString": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ مَا كَانَ حُجَّتَهُمْ إِلَّا أَنْ قَالُوا ائْتُوا بِآبَائِنَا إِنْ كُنْتُمْ صَادِقِينَ",
      "verseStringB": "And when Our clarifying Verses are recited to them, their only argument is to say, “Bring back our ancestors, if you are truthful.”"
    },
    {
      "verseNumber": 26,
      "verseString": "قُلِ اللَّهُ يُحْيِيكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يَجْمَعُكُمْ إِلَىٰ يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ",
      "verseStringB": "Say, “Allah gives you life, then He makes you die, then He gathers you for the Day of Resurrection, about which there is no doubt. But most people do not know.”"
    },
    {
      "verseNumber": 27,
      "verseString": "وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَخْسَرُ الْمُبْطِلُونَ",
      "verseStringB": "To Allah belongs the Kingdom of the heavens and the earth. On the Day when the Hour takes place. On that Day, the falsifiers will lose."
    },
    {
      "verseNumber": 28,
      "verseString": "وَتَرَىٰ كُلَّ أُمَّةٍ جَاثِيَةً ۚ كُلُّ أُمَّةٍ تُدْعَىٰ إِلَىٰ كِتَابِهَا الْيَوْمَ تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "And you will see every community on its knees. Every community will be summoned to its Book: “Today you are being repaid for what you used to do."
    },
    {
      "verseNumber": 29,
      "verseString": "هَٰذَا كِتَابُنَا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ ۚ إِنَّا كُنَّا نَسْتَنْسِخُ مَا كُنْتُمْ تَعْمَلُونَ",
      "verseStringB": "This Book of Ours speaks about you in truth. We were transcribing what you used to do.”"
    },
    {
      "verseNumber": 30,
      "verseString": "فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُدْخِلُهُمْ رَبُّهُمْ فِي رَحْمَتِهِ ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْمُبِينُ",
      "verseStringB": "As for those who believed and did righteous deeds, their Lord will admit them into His mercy. That is the clear triumph."
    },
    {
      "verseNumber": 31,
      "verseString": "وَأَمَّا الَّذِينَ كَفَرُوا أَفَلَمْ تَكُنْ آيَاتِي تُتْلَىٰ عَلَيْكُمْ فَاسْتَكْبَرْتُمْ وَكُنْتُمْ قَوْمًا مُجْرِمِينَ",
      "verseStringB": "But as for those who disbelieved: “Were My verses not read to you? But you turned arrogant and were guilty people.”"
    },
    {
      "verseNumber": 32,
      "verseString": "وَإِذَا قِيلَ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَالسَّاعَةُ لَا رَيْبَ فِيهَا قُلْتُمْ مَا نَدْرِي مَا السَّاعَةُ إِنْ نَظُنُّ إِلَّا ظَنًّا وَمَا نَحْنُ بِمُسْتَيْقِنِينَ",
      "verseStringB": "And when it was said, “The promise of Allah is true, and there is no doubt about the hour,” you said, “We do not know what the Hour is; we think it is only speculation; we are not convinced.”"
    },
    {
      "verseNumber": 33,
      "verseString": "وَبَدَا لَهُمْ سَيِّئَاتُ مَا عَمِلُوا وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ",
      "verseStringB": "The evils of what they did will become evident to them, and the very thing they ridiculed will haunt them."
    },
    {
      "verseNumber": 34,
      "verseString": "وَقِيلَ الْيَوْمَ نَنْسَاكُمْ كَمَا نَسِيتُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا وَمَأْوَاكُمُ النَّارُ وَمَا لَكُمْ مِنْ نَاصِرِينَ",
      "verseStringB": "And it will be said, “Today, We will ignore you, as you ignored the encounter of this Day of yours. And your housing is the Fire, and you have no helpers."
    },
    {
      "verseNumber": 35,
      "verseString": "ذَٰلِكُمْ بِأَنَّكُمُ اتَّخَذْتُمْ آيَاتِ اللَّهِ هُزُوًا وَغَرَّتْكُمُ الْحَيَاةُ الدُّنْيَا ۚ فَالْيَوْمَ لَا يُخْرَجُونَ مِنْهَا وَلَا هُمْ يُسْتَعْتَبُونَ",
      "verseStringB": "That is because you took Allah’s revelations for a joke, and the worldly life lured you.” So today, they will not be removed from it, and they cannot make amends."
    },
    {
      "verseNumber": 36,
      "verseString": "فَلِلَّهِ الْحَمْدُ رَبِّ السَّمَاوَاتِ وَرَبِّ الْأَرْضِ رَبِّ الْعَالَمِينَ",
      "verseStringB": "So praise belongs to Allah—Lord of the heavens, Lord of the earth, Lord of humanity."
    },
    {
      "verseNumber": 37,
      "verseString": "وَلَهُ الْكِبْرِيَاءُ فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "And His is the Grandeur in the heavens and the earth. And He is the Majestic, the Wise."
    }
  ],
  "nameEnglish": "Kneeling",
  "nameTrans": "al-Jathiyah",
  "nameArabic": "الجاثية",
  "chapterNumber": 45,
  "nVerses": 37
}