{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ أَضَلَّ أَعْمَالَهُمْ",
      "verseStringB": "Those who disbelieve and repel from Allah’s path—He nullifies their works."
    },
    {
      "verseNumber": 2,
      "verseString": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَآمَنُوا بِمَا نُزِّلَ عَلَىٰ مُحَمَّدٍ وَهُوَ الْحَقُّ مِنْ رَبِّهِمْ ۙ كَفَّرَ عَنْهُمْ سَيِّئَاتِهِمْ وَأَصْلَحَ بَالَهُمْ",
      "verseStringB": "While those who believe, and work righteousness, and believe in what was sent down to Muhammad—which is the truth from their Lord—He remits their sins, and He relieves their concerns."
    },
    {
      "verseNumber": 3,
      "verseString": "ذَٰلِكَ بِأَنَّ الَّذِينَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَأَنَّ الَّذِينَ آمَنُوا اتَّبَعُوا الْحَقَّ مِنْ رَبِّهِمْ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ لِلنَّاسِ أَمْثَالَهُمْ",
      "verseStringB": "That is because those who disbelieve follow falsehoods, while those who believe follow the truth from their Lord. Thus Allah gives the people their examples."
    },
    {
      "verseNumber": 4,
      "verseString": "فَإِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقَابِ حَتَّىٰ إِذَا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثَاقَ فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَاءً حَتَّىٰ تَضَعَ الْحَرْبُ أَوْزَارَهَا ۚ ذَٰلِكَ وَلَوْ يَشَاءُ اللَّهُ لَانْتَصَرَ مِنْهُمْ وَلَٰكِنْ لِيَبْلُوَ بَعْضَكُمْ بِبَعْضٍ ۗ وَالَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ فَلَنْ يُضِلَّ أَعْمَالَهُمْ",
      "verseStringB": "When you encounter those who disbelieve, strike at their necks. Then, when you have subdued them, tighten the bond. Then, either free them graciously, or by ransom. Until the war lays down its burdens. Had Allah willed, He would have taken vengeance upon them, but so that He tests some of you through others. As for those who are killed in Allah’s way, He will not let their deeds go to waste."
    },
    {
      "verseNumber": 5,
      "verseString": "سَيَهْدِيهِمْ وَيُصْلِحُ بَالَهُمْ",
      "verseStringB": "He will guide them and improve their condition."
    },
    {
      "verseNumber": 6,
      "verseString": "وَيُدْخِلُهُمُ الْجَنَّةَ عَرَّفَهَا لَهُمْ",
      "verseStringB": "And He will admit them to Paradise, which He has identified to them."
    },
    {
      "verseNumber": 7,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ تَنْصُرُوا اللَّهَ يَنْصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ",
      "verseStringB": "O you who believe! If you stand up for Allah, He will support you, and He will strengthen your foothold."
    },
    {
      "verseNumber": 8,
      "verseString": "وَالَّذِينَ كَفَرُوا فَتَعْسًا لَهُمْ وَأَضَلَّ أَعْمَالَهُمْ",
      "verseStringB": "As for those who disbelieve: for them is perdition, and He will waste their deeds."
    },
    {
      "verseNumber": 9,
      "verseString": "ذَٰلِكَ بِأَنَّهُمْ كَرِهُوا مَا أَنْزَلَ اللَّهُ فَأَحْبَطَ أَعْمَالَهُمْ",
      "verseStringB": "That is because they disliked what Allah revealed, so He nullified their works."
    },
    {
      "verseNumber": 10,
      "verseString": "أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ ۚ دَمَّرَ اللَّهُ عَلَيْهِمْ ۖ وَلِلْكَافِرِينَ أَمْثَالُهَا",
      "verseStringB": "Have they not traveled through the earth, and seen the fate of those before them? Allah poured destruction on them—and for the unbelievers is something comparable."
    },
    {
      "verseNumber": 11,
      "verseString": "ذَٰلِكَ بِأَنَّ اللَّهَ مَوْلَى الَّذِينَ آمَنُوا وَأَنَّ الْكَافِرِينَ لَا مَوْلَىٰ لَهُمْ",
      "verseStringB": "That is because Allah is the Master of those who believe, while the disbelievers have no master."
    },
    {
      "verseNumber": 12,
      "verseString": "إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ وَالَّذِينَ كَفَرُوا يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ الْأَنْعَامُ وَالنَّارُ مَثْوًى لَهُمْ",
      "verseStringB": "Allah will admit those who believe and do good deeds into Gardens under which rivers flow. While those who disbelieve enjoy themselves, and they eat as cattle eat; and the Fire will be a dwelling for them."
    },
    {
      "verseNumber": 13,
      "verseString": "وَكَأَيِّنْ مِنْ قَرْيَةٍ هِيَ أَشَدُّ قُوَّةً مِنْ قَرْيَتِكَ الَّتِي أَخْرَجَتْكَ أَهْلَكْنَاهُمْ فَلَا نَاصِرَ لَهُمْ",
      "verseStringB": "How many a town was more powerful than your town which evicted you? We destroyed them, and there was no helper for them."
    },
    {
      "verseNumber": 14,
      "verseString": "أَفَمَنْ كَانَ عَلَىٰ بَيِّنَةٍ مِنْ رَبِّهِ كَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ وَاتَّبَعُوا أَهْوَاءَهُمْ",
      "verseStringB": "Is he who stands upon evidence from his Lord, like someone whose bad deed is made to appear attractive to him? And they follow their own desires?"
    },
    {
      "verseNumber": 15,
      "verseString": "مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ فِيهَا أَنْهَارٌ مِنْ مَاءٍ غَيْرِ آسِنٍ وَأَنْهَارٌ مِنْ لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ وَأَنْهَارٌ مِنْ خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وَأَنْهَارٌ مِنْ عَسَلٍ مُصَفًّى ۖ وَلَهُمْ فِيهَا مِنْ كُلِّ الثَّمَرَاتِ وَمَغْفِرَةٌ مِنْ رَبِّهِمْ ۖ كَمَنْ هُوَ خَالِدٌ فِي النَّارِ وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ",
      "verseStringB": "The likeness of the Garden promised to the righteous: in it are rivers of pure water, and rivers of milk forever fresh, and rivers of wine delightful to the drinkers, and rivers of strained honey. And they will have in it of every fruit, and forgiveness from their Lord. Like someone remaining in the Fire forever, and are given to drink boiling water, that tears apart their bowels?"
    },
    {
      "verseNumber": 16,
      "verseString": "وَمِنْهُمْ مَنْ يَسْتَمِعُ إِلَيْكَ حَتَّىٰ إِذَا خَرَجُوا مِنْ عِنْدِكَ قَالُوا لِلَّذِينَ أُوتُوا الْعِلْمَ مَاذَا قَالَ آنِفًا ۚ أُولَٰئِكَ الَّذِينَ طَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَاتَّبَعُوا أَهْوَاءَهُمْ",
      "verseStringB": "And among them are those who listen to you. But when they leave your presence, they say to those given knowledge, “What did he just say?” These are they whose hearts Allah has sealed, and who follow their own desires."
    },
    {
      "verseNumber": 17,
      "verseString": "وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ",
      "verseStringB": "As for those who are guided: He increases them in guidance, and He grants them their reverence."
    },
    {
      "verseNumber": 18,
      "verseString": "فَهَلْ يَنْظُرُونَ إِلَّا السَّاعَةَ أَنْ تَأْتِيَهُمْ بَغْتَةً ۖ فَقَدْ جَاءَ أَشْرَاطُهَا ۚ فَأَنَّىٰ لَهُمْ إِذَا جَاءَتْهُمْ ذِكْرَاهُمْ",
      "verseStringB": "Are they just waiting for the Hour to take them by surprise? Its tokens have already arrived. But when it has come upon them, what will their remembrance do for them?"
    },
    {
      "verseNumber": 19,
      "verseString": "فَاعْلَمْ أَنَّهُ لَا إِلَٰهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ۗ وَاللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَاكُمْ",
      "verseStringB": "Know that there is no god but Allah, and ask forgiveness for your sin, and for the believing men and believing women. Allah knows your movements and your resting-place."
    },
    {
      "verseNumber": 20,
      "verseString": "وَيَقُولُ الَّذِينَ آمَنُوا لَوْلَا نُزِّلَتْ سُورَةٌ ۖ فَإِذَا أُنْزِلَتْ سُورَةٌ مُحْكَمَةٌ وَذُكِرَ فِيهَا الْقِتَالُ ۙ رَأَيْتَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ يَنْظُرُونَ إِلَيْكَ نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِ ۖ فَأَوْلَىٰ لَهُمْ",
      "verseStringB": "Those who believe say, “If only a chapter was sent down.” Yet when a decisive chapter is sent down, and fighting is mentioned in it, you see those in whose hearts is sickness staring at you like someone fainting at death. More suitable for them."
    },
    {
      "verseNumber": 21,
      "verseString": "طَاعَةٌ وَقَوْلٌ مَعْرُوفٌ ۚ فَإِذَا عَزَمَ الْأَمْرُ فَلَوْ صَدَقُوا اللَّهَ لَكَانَ خَيْرًا لَهُمْ",
      "verseStringB": "Obedience and upright speech. Then, when the matter is decided, being true to Allah would have been better for them."
    },
    {
      "verseNumber": 22,
      "verseString": "فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ",
      "verseStringB": "If you turn away, you are likely to make mischief on earth, and sever your family ties."
    },
    {
      "verseNumber": 23,
      "verseString": "أُولَٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ فَأَصَمَّهُمْ وَأَعْمَىٰ أَبْصَارَهُمْ",
      "verseStringB": "Those are they whom Allah has condemned. He made them deaf, and He blinded their sight."
    },
    {
      "verseNumber": 24,
      "verseString": "أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَا",
      "verseStringB": "Do they not contemplate the Quran? Or do hearts have their locks upon them?"
    },
    {
      "verseNumber": 25,
      "verseString": "إِنَّ الَّذِينَ ارْتَدُّوا عَلَىٰ أَدْبَارِهِمْ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى ۙ الشَّيْطَانُ سَوَّلَ لَهُمْ وَأَمْلَىٰ لَهُمْ",
      "verseStringB": "Those who relapsed after guidance became clear to them—Satan has enticed them, and he has given them latitude."
    },
    {
      "verseNumber": 26,
      "verseString": "ذَٰلِكَ بِأَنَّهُمْ قَالُوا لِلَّذِينَ كَرِهُوا مَا نَزَّلَ اللَّهُ سَنُطِيعُكُمْ فِي بَعْضِ الْأَمْرِ ۖ وَاللَّهُ يَعْلَمُ إِسْرَارَهُمْ",
      "verseStringB": "That is because they said to those who hated what Allah revealed, “We will obey you in some issues.” But Allah knows their secret thoughts."
    },
    {
      "verseNumber": 27,
      "verseString": "فَكَيْفَ إِذَا تَوَفَّتْهُمُ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ",
      "verseStringB": "How about when the angels take their souls, beating their faces and their backs?"
    },
    {
      "verseNumber": 28,
      "verseString": "ذَٰلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ وَكَرِهُوا رِضْوَانَهُ فَأَحْبَطَ أَعْمَالَهُمْ",
      "verseStringB": "That is because they pursued what displeases Allah, and they disliked His approval, so He nullified their works."
    },
    {
      "verseNumber": 29,
      "verseString": "أَمْ حَسِبَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ أَنْ لَنْ يُخْرِجَ اللَّهُ أَضْغَانَهُمْ",
      "verseStringB": "Or do those in whose hearts is a disease think that Allah will not expose their malice?"
    },
    {
      "verseNumber": 30,
      "verseString": "وَلَوْ نَشَاءُ لَأَرَيْنَاكَهُمْ فَلَعَرَفْتَهُمْ بِسِيمَاهُمْ ۚ وَلَتَعْرِفَنَّهُمْ فِي لَحْنِ الْقَوْلِ ۚ وَاللَّهُ يَعْلَمُ أَعْمَالَكُمْ",
      "verseStringB": "Had We willed, We would have shown them to you, and you would have recognized them by their features. And you will recognize them by their tone of speech. And Allah knows your actions."
    },
    {
      "verseNumber": 31,
      "verseString": "وَلَنَبْلُوَنَّكُمْ حَتَّىٰ نَعْلَمَ الْمُجَاهِدِينَ مِنْكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ",
      "verseStringB": "And We will test you—until We prove those among you who strive, and those who persevere—and We will test your assertions."
    },
    {
      "verseNumber": 32,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ وَشَاقُّوا الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَىٰ لَنْ يَضُرُّوا اللَّهَ شَيْئًا وَسَيُحْبِطُ أَعْمَالَهُمْ",
      "verseStringB": "Those who disbelieve, and hinder from Allah’s path, and defy the Messenger after guidance became clear to them: they will not harm Allah in the least, but He will render their deeds worthless."
    },
    {
      "verseNumber": 33,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلَا تُبْطِلُوا أَعْمَالَكُمْ",
      "verseStringB": "O you who believe! Obey Allah, and obey the Messenger, and let not your deeds go to waste."
    },
    {
      "verseNumber": 34,
      "verseString": "إِنَّ الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ ثُمَّ مَاتُوا وَهُمْ كُفَّارٌ فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ",
      "verseStringB": "Those who disbelieve, and hinder from Allah’s path, and then die as disbelievers: Allah will not forgive them."
    },
    {
      "verseNumber": 35,
      "verseString": "فَلَا تَهِنُوا وَتَدْعُوا إِلَى السَّلْمِ وَأَنْتُمُ الْأَعْلَوْنَ وَاللَّهُ مَعَكُمْ وَلَنْ يَتِرَكُمْ أَعْمَالَكُمْ",
      "verseStringB": "So do not waver and call for peace while you have the upper hand. Allah is with you, and He will not deprive you of your efforts."
    },
    {
      "verseNumber": 36,
      "verseString": "إِنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ ۚ وَإِنْ تُؤْمِنُوا وَتَتَّقُوا يُؤْتِكُمْ أُجُورَكُمْ وَلَا يَسْأَلْكُمْ أَمْوَالَكُمْ",
      "verseStringB": "The life of this world is nothing but play and pastime. But if you believe and are reverent, He will grant you your rewards, and He will not ask you for your possessions."
    },
    {
      "verseNumber": 37,
      "verseString": "إِنْ يَسْأَلْكُمُوهَا فَيُحْفِكُمْ تَبْخَلُوا وَيُخْرِجْ أَضْغَانَكُمْ",
      "verseStringB": "Were He to ask you for them, and pressure you, you would withhold, and He would expose your unwillingness."
    },
    {
      "verseNumber": 38,
      "verseString": "هَا أَنْتُمْ هَٰؤُلَاءِ تُدْعَوْنَ لِتُنْفِقُوا فِي سَبِيلِ اللَّهِ فَمِنْكُمْ مَنْ يَبْخَلُ ۖ وَمَنْ يَبْخَلْ فَإِنَّمَا يَبْخَلُ عَنْ نَفْسِهِ ۚ وَاللَّهُ الْغَنِيُّ وَأَنْتُمُ الْفُقَرَاءُ ۚ وَإِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ ثُمَّ لَا يَكُونُوا أَمْثَالَكُمْ",
      "verseStringB": "Here you are, being invited to donate in Allah’s cause. Among you are those who withhold. But whoever withholds is withholding against himself. Allah is the Rich, while you are the needy. And if you turn away, He will replace you with another people, and they will not be like you."
    }
  ],
  "nameEnglish": "Muhammad",
  "nameTrans": "Muhammad",
  "nameArabic": "محمـد",
  "chapterNumber": 47,
  "nVerses": 38
}