{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا",
      "verseStringB": "We have opened the way for you to a notable victory."
    },
    {
      "verseNumber": 2,
      "verseString": "لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ وَيَهْدِيَكَ صِرَاطًا مُسْتَقِيمًا",
      "verseStringB": "So that Allah may forgive you your sins—past and future—and complete His favor upon you, and guide you along a straight path."
    },
    {
      "verseNumber": 3,
      "verseString": "وَيَنْصُرَكَ اللَّهُ نَصْرًا عَزِيزًا",
      "verseStringB": "And so that Allah may help you with unwavering support."
    },
    {
      "verseNumber": 4,
      "verseString": "هُوَ الَّذِي أَنْزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ لِيَزْدَادُوا إِيمَانًا مَعَ إِيمَانِهِمْ ۗ وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا",
      "verseStringB": "It is He who sends down tranquility into the hearts of believers, to add faith to their faith. To Allah belong the Forces of the heavens and the earth, and Allah is Knowing and Wise."
    },
    {
      "verseNumber": 5,
      "verseString": "لِيُدْخِلَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَيُكَفِّرَ عَنْهُمْ سَيِّئَاتِهِمْ ۚ وَكَانَ ذَٰلِكَ عِنْدَ اللَّهِ فَوْزًا عَظِيمًا",
      "verseStringB": "So that He may admit the believers, male and female, into Gardens beneath which rivers flow, to remain there forever, and that He may remit their offenses. That, with Allah, is a great triumph."
    },
    {
      "verseNumber": 6,
      "verseString": "وَيُعَذِّبَ الْمُنَافِقِينَ وَالْمُنَافِقَاتِ وَالْمُشْرِكِينَ وَالْمُشْرِكَاتِ الظَّانِّينَ بِاللَّهِ ظَنَّ السَّوْءِ ۚ عَلَيْهِمْ دَائِرَةُ السَّوْءِ ۖ وَغَضِبَ اللَّهُ عَلَيْهِمْ وَلَعَنَهُمْ وَأَعَدَّ لَهُمْ جَهَنَّمَ ۖ وَسَاءَتْ مَصِيرًا",
      "verseStringB": "And so that He may punish the hypocrites, male and female, and the associators, male and female—those who harbor evil thoughts about Allah. They are surrounded by evil, and Allah is angry with them, and has cursed them, and has prepared for them Hell—a miserable destination."
    },
    {
      "verseNumber": 7,
      "verseString": "وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا",
      "verseStringB": "To Allah belong the Forces of the heavens and the earth. Allah is Mighty and Wise."
    },
    {
      "verseNumber": 8,
      "verseString": "إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا",
      "verseStringB": "We sent you as a witness, and a deliverer of good news, and a warner."
    },
    {
      "verseNumber": 9,
      "verseString": "لِتُؤْمِنُوا بِاللَّهِ وَرَسُولِهِ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُ وَتُسَبِّحُوهُ بُكْرَةً وَأَصِيلًا",
      "verseStringB": "So you may believe in Allah and His Messenger, and assist him, and respect him, and praise Him morning and evening."
    },
    {
      "verseNumber": 10,
      "verseString": "إِنَّ الَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ اللَّهَ يَدُ اللَّهِ فَوْقَ أَيْدِيهِمْ ۚ فَمَنْ نَكَثَ فَإِنَّمَا يَنْكُثُ عَلَىٰ نَفْسِهِ ۖ وَمَنْ أَوْفَىٰ بِمَا عَاهَدَ عَلَيْهُ اللَّهَ فَسَيُؤْتِيهِ أَجْرًا عَظِيمًا",
      "verseStringB": "Those who pledge allegiance to you, are pledging allegiance to Allah. Allah’s hand is above their hands. Whoever breaks his pledge, breaks it against himself. And whosoever fulfills what He promised Allah, He will give him a great reward."
    },
    {
      "verseNumber": 11,
      "verseString": "سَيَقُولُ لَكَ الْمُخَلَّفُونَ مِنَ الْأَعْرَابِ شَغَلَتْنَا أَمْوَالُنَا وَأَهْلُونَا فَاسْتَغْفِرْ لَنَا ۚ يَقُولُونَ بِأَلْسِنَتِهِمْ مَا لَيْسَ فِي قُلُوبِهِمْ ۚ قُلْ فَمَنْ يَمْلِكُ لَكُمْ مِنَ اللَّهِ شَيْئًا إِنْ أَرَادَ بِكُمْ ضَرًّا أَوْ أَرَادَ بِكُمْ نَفْعًا ۚ بَلْ كَانَ اللَّهُ بِمَا تَعْمَلُونَ خَبِيرًا",
      "verseStringB": "The Nomadic-Arabs, who stayed behind, will say to you, “Our belongings and our families have preoccupied us, so ask forgiveness for us.” They say with their tongues what is not in their hearts. Say, “Who can avail you anything against Allah, if He intends harm for you, or intends benefit for you?” But Allah is well informed of what you do."
    },
    {
      "verseNumber": 12,
      "verseString": "بَلْ ظَنَنْتُمْ أَنْ لَنْ يَنْقَلِبَ الرَّسُولُ وَالْمُؤْمِنُونَ إِلَىٰ أَهْلِيهِمْ أَبَدًا وَزُيِّنَ ذَٰلِكَ فِي قُلُوبِكُمْ وَظَنَنْتُمْ ظَنَّ السَّوْءِ وَكُنْتُمْ قَوْمًا بُورًا",
      "verseStringB": "But you assumed that the Messenger and the believers would not return to their families, ever, and this seemed fine to your hearts, and you harbored bad thoughts, and you became doomed people."
    },
    {
      "verseNumber": 13,
      "verseString": "وَمَنْ لَمْ يُؤْمِنْ بِاللَّهِ وَرَسُولِهِ فَإِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَعِيرًا",
      "verseStringB": "Whoever does not believe in Allah and His Messenger—We have prepared for the unbelievers a Blaze."
    },
    {
      "verseNumber": 14,
      "verseString": "وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ يَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ ۚ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "verseStringB": "To Allah belongs the kingdom of the heavens and the earth. He forgives whom He wills, and He punishes whom He wills. And Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 15,
      "verseString": "سَيَقُولُ الْمُخَلَّفُونَ إِذَا انْطَلَقْتُمْ إِلَىٰ مَغَانِمَ لِتَأْخُذُوهَا ذَرُونَا نَتَّبِعْكُمْ ۖ يُرِيدُونَ أَنْ يُبَدِّلُوا كَلَامَ اللَّهِ ۚ قُلْ لَنْ تَتَّبِعُونَا كَذَٰلِكُمْ قَالَ اللَّهُ مِنْ قَبْلُ ۖ فَسَيَقُولُونَ بَلْ تَحْسُدُونَنَا ۚ بَلْ كَانُوا لَا يَفْقَهُونَ إِلَّا قَلِيلًا",
      "verseStringB": "Those who lagged behind will say when you depart to collect the gains, “Let us follow you.” They want to change the Word of Allah. Say, “You will not follow us; Allah has said so before.” Then they will say, “But you are jealous of us.” In fact, they understand only a little."
    },
    {
      "verseNumber": 16,
      "verseString": "قُلْ لِلْمُخَلَّفِينَ مِنَ الْأَعْرَابِ سَتُدْعَوْنَ إِلَىٰ قَوْمٍ أُولِي بَأْسٍ شَدِيدٍ تُقَاتِلُونَهُمْ أَوْ يُسْلِمُونَ ۖ فَإِنْ تُطِيعُوا يُؤْتِكُمُ اللَّهُ أَجْرًا حَسَنًا ۖ وَإِنْ تَتَوَلَّوْا كَمَا تَوَلَّيْتُمْ مِنْ قَبْلُ يُعَذِّبْكُمْ عَذَابًا أَلِيمًا",
      "verseStringB": "Say to the Nomadic-Arabs who stayed behind, “You will be called to face a people of great strength. You will fight them—unless they submit. If you obey, Allah will give you a good reward. But if you turn away, as you turned away before, He will punish you a painful punishment.”"
    },
    {
      "verseNumber": 17,
      "verseString": "لَيْسَ عَلَى الْأَعْمَىٰ حَرَجٌ وَلَا عَلَى الْأَعْرَجِ حَرَجٌ وَلَا عَلَى الْمَرِيضِ حَرَجٌ ۗ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ وَمَنْ يَتَوَلَّ يُعَذِّبْهُ عَذَابًا أَلِيمًا",
      "verseStringB": "There is no blame on the blind, nor any blame on the disabled, nor any blame on the sick. Whoever obeys Allah and His Messenger: He will admit him into Gardens beneath which rivers flow. But whoever turns away: He will punish him a painful punishment."
    },
    {
      "verseNumber": 18,
      "verseString": "لَقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمْ فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ وَأَثَابَهُمْ فَتْحًا قَرِيبًا",
      "verseStringB": "Allah was pleased with the believers: when they pledged allegiance to you under the tree. He knew what was in their hearts, so He sent down Serenity upon them, and He rewarded them with an imminent conquest."
    },
    {
      "verseNumber": 19,
      "verseString": "وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا ۗ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا",
      "verseStringB": "And abundant gains that they will capture. Allah is Mighty and Wise."
    },
    {
      "verseNumber": 20,
      "verseString": "وَعَدَكُمُ اللَّهُ مَغَانِمَ كَثِيرَةً تَأْخُذُونَهَا فَعَجَّلَ لَكُمْ هَٰذِهِ وَكَفَّ أَيْدِيَ النَّاسِ عَنْكُمْ وَلِتَكُونَ آيَةً لِلْمُؤْمِنِينَ وَيَهْدِيَكُمْ صِرَاطًا مُسْتَقِيمًا",
      "verseStringB": "Allah has promised you abundant gains, that you will capture. He has expedited this for you, and He has restrained the people’s hands from you; so that it becomes a sign for the believers, and so that He may guide you to a straight path."
    },
    {
      "verseNumber": 21,
      "verseString": "وَأُخْرَىٰ لَمْ تَقْدِرُوا عَلَيْهَا قَدْ أَحَاطَ اللَّهُ بِهَا ۚ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرًا",
      "verseStringB": "And others of which you were incapable, Allah has surrounded them. Allah is Capable of all things."
    },
    {
      "verseNumber": 22,
      "verseString": "وَلَوْ قَاتَلَكُمُ الَّذِينَ كَفَرُوا لَوَلَّوُا الْأَدْبَارَ ثُمَّ لَا يَجِدُونَ وَلِيًّا وَلَا نَصِيرًا",
      "verseStringB": "If those who disbelieve had fought you, they would have turned their backs, then they would have found neither protector nor helper."
    },
    {
      "verseNumber": 23,
      "verseString": "سُنَّةَ اللَّهِ الَّتِي قَدْ خَلَتْ مِنْ قَبْلُ ۖ وَلَنْ تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلًا",
      "verseStringB": "It is the pattern of Allah, ongoing since the past. You will find no change in Allah’s pattern."
    },
    {
      "verseNumber": 24,
      "verseString": "وَهُوَ الَّذِي كَفَّ أَيْدِيَهُمْ عَنْكُمْ وَأَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ مِنْ بَعْدِ أَنْ أَظْفَرَكُمْ عَلَيْهِمْ ۚ وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا",
      "verseStringB": "It is He Who restrained their hands from you, and your hands from them, in the valley of Mecca, after having given you the upper hand over them. Allah is Observer of whatever you do."
    },
    {
      "verseNumber": 25,
      "verseString": "هُمُ الَّذِينَ كَفَرُوا وَصَدُّوكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ وَالْهَدْيَ مَعْكُوفًا أَنْ يَبْلُغَ مَحِلَّهُ ۚ وَلَوْلَا رِجَالٌ مُؤْمِنُونَ وَنِسَاءٌ مُؤْمِنَاتٌ لَمْ تَعْلَمُوهُمْ أَنْ تَطَئُوهُمْ فَتُصِيبَكُمْ مِنْهُمْ مَعَرَّةٌ بِغَيْرِ عِلْمٍ ۖ لِيُدْخِلَ اللَّهُ فِي رَحْمَتِهِ مَنْ يَشَاءُ ۚ لَوْ تَزَيَّلُوا لَعَذَّبْنَا الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابًا أَلِيمًا",
      "verseStringB": "It is they who disbelieved, and barred you from the Sacred Mosque, and prevented the offering from reaching its destination. Were it not for believing men and believing women, whom you did not know, you were about to hurt them, and become guilty unintentionally. Thus Allah admits into His mercy whom He wills. Had they dispersed, We would have punished those who disbelieved among them with a painful punishment."
    },
    {
      "verseNumber": 26,
      "verseString": "إِذْ جَعَلَ الَّذِينَ كَفَرُوا فِي قُلُوبِهِمُ الْحَمِيَّةَ حَمِيَّةَ الْجَاهِلِيَّةِ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَىٰ رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَلْزَمَهُمْ كَلِمَةَ التَّقْوَىٰ وَكَانُوا أَحَقَّ بِهَا وَأَهْلَهَا ۚ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا",
      "verseStringB": "Those who disbelieve filled their hearts with prejudice—the prejudice of the age of ignorance. But Allah sent down His Tranquility upon His Messenger, and upon the believers, and He made binding on them the words of righteousness—to which they were most entitled and most deserving. Allah is Knower of all things."
    },
    {
      "verseNumber": 27,
      "verseString": "لَقَدْ صَدَقَ اللَّهُ رَسُولَهُ الرُّؤْيَا بِالْحَقِّ ۖ لَتَدْخُلُنَّ الْمَسْجِدَ الْحَرَامَ إِنْ شَاءَ اللَّهُ آمِنِينَ مُحَلِّقِينَ رُءُوسَكُمْ وَمُقَصِّرِينَ لَا تَخَافُونَ ۖ فَعَلِمَ مَا لَمْ تَعْلَمُوا فَجَعَلَ مِنْ دُونِ ذَٰلِكَ فَتْحًا قَرِيبًا",
      "verseStringB": "Allah has fulfilled His Messenger’s vision in truth: “You will enter the Sacred House, Allah willing, in safety, heads shaven, or hair shortened, not fearing. He knew what you did not know, and has granted besides this an imminent victory.”"
    },
    {
      "verseNumber": 28,
      "verseString": "هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ ۚ وَكَفَىٰ بِاللَّهِ شَهِيدًا",
      "verseStringB": "It is He who sent His Messenger with the guidance and the Religion of Truth, to make it prevail over all religion. And Allah is enough as Witness."
    },
    {
      "verseNumber": 29,
      "verseString": "مُحَمَّدٌ رَسُولُ اللَّهِ ۚ وَالَّذِينَ مَعَهُ أَشِدَّاءُ عَلَى الْكُفَّارِ رُحَمَاءُ بَيْنَهُمْ ۖ تَرَاهُمْ رُكَّعًا سُجَّدًا يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا ۖ سِيمَاهُمْ فِي وُجُوهِهِمْ مِنْ أَثَرِ السُّجُودِ ۚ ذَٰلِكَ مَثَلُهُمْ فِي التَّوْرَاةِ ۚ وَمَثَلُهُمْ فِي الْإِنْجِيلِ كَزَرْعٍ أَخْرَجَ شَطْأَهُ فَآزَرَهُ فَاسْتَغْلَظَ فَاسْتَوَىٰ عَلَىٰ سُوقِهِ يُعْجِبُ الزُّرَّاعَ لِيَغِيظَ بِهِمُ الْكُفَّارَ ۗ وَعَدَ اللَّهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنْهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا",
      "verseStringB": "Muhammad is the Messenger of Allah. Those with him are firm against the unbelievers, yet kind amongst themselves. You see them kneeling, prostrating, seeking Allah’s blessings and His approval. Their marks are on their faces from the effects of prostration. Such is their example in the Torah, and their example in the Gospel: like a seed that sprouts, becomes strong, grows thick, and rises on its stem, delighting the planters. Through them, He infuriates the unbelievers. Allah has promised those among them who believe and do good works forgiveness and a splendid reward."
    }
  ],
  "nameEnglish": "Victory",
  "nameTrans": "al-Fath",
  "nameArabic": "الفتح",
  "chapterNumber": 48,
  "nVerses": 29
}