{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ",
      "verseStringB": "O you who believe! Do not place your opinions above that of Allah and His Messenger, and be conscious of Allah. Allah is Hearing and Knowing."
    },
    {
      "verseNumber": 2,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا لَهُ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ أَنْ تَحْبَطَ أَعْمَالُكُمْ وَأَنْتُمْ لَا تَشْعُرُونَ",
      "verseStringB": "O you who believe! Do not raise your voices above the Prophet’s voice, nor speak to him loudly, nor address him in the manner you address one another, lest your works be in vain without you realizing."
    },
    {
      "verseNumber": 3,
      "verseString": "إِنَّ الَّذِينَ يَغُضُّونَ أَصْوَاتَهُمْ عِنْدَ رَسُولِ اللَّهِ أُولَٰئِكَ الَّذِينَ امْتَحَنَ اللَّهُ قُلُوبَهُمْ لِلتَّقْوَىٰ ۚ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ عَظِيمٌ",
      "verseStringB": "Those who lower their voices in the presence of Allah’s Messenger—they are the ones whose hearts Allah has tested for reverence. They will have forgiveness and a great reward."
    },
    {
      "verseNumber": 4,
      "verseString": "إِنَّ الَّذِينَ يُنَادُونَكَ مِنْ وَرَاءِ الْحُجُرَاتِ أَكْثَرُهُمْ لَا يَعْقِلُونَ",
      "verseStringB": "Those who call you from behind the apartments—most of them do not understand."
    },
    {
      "verseNumber": 5,
      "verseString": "وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّىٰ تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَهُمْ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "verseStringB": "Had they been patient until you came out to them, it would have been better for them. And Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 6,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَنْ تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَىٰ مَا فَعَلْتُمْ نَادِمِينَ",
      "verseStringB": "O you who believe! If a sinner comes to you with any news, investigate, lest you harm some people out of ignorance, and you become regretful for what you have done."
    },
    {
      "verseNumber": 7,
      "verseString": "وَاعْلَمُوا أَنَّ فِيكُمْ رَسُولَ اللَّهِ ۚ لَوْ يُطِيعُكُمْ فِي كَثِيرٍ مِنَ الْأَمْرِ لَعَنِتُّمْ وَلَٰكِنَّ اللَّهَ حَبَّبَ إِلَيْكُمُ الْإِيمَانَ وَزَيَّنَهُ فِي قُلُوبِكُمْ وَكَرَّهَ إِلَيْكُمُ الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ ۚ أُولَٰئِكَ هُمُ الرَّاشِدُونَ",
      "verseStringB": "And know that Allah’s Messenger is among you. Had he obeyed you in many issues, you would have suffered hardship. But Allah has endeared the faith to you, and adorned it in your hearts—and He made disbelief, mischief, and rebellion hateful to you—these are the rightly guided."
    },
    {
      "verseNumber": 8,
      "verseString": "فَضْلًا مِنَ اللَّهِ وَنِعْمَةً ۚ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "verseStringB": "A Favor and a Blessing from Allah. Allah is Knowing and Wise."
    },
    {
      "verseNumber": 9,
      "verseString": "وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا ۖ فَإِنْ بَغَتْ إِحْدَاهُمَا عَلَى الْأُخْرَىٰ فَقَاتِلُوا الَّتِي تَبْغِي حَتَّىٰ تَفِيءَ إِلَىٰ أَمْرِ اللَّهِ ۚ فَإِنْ فَاءَتْ فَأَصْلِحُوا بَيْنَهُمَا بِالْعَدْلِ وَأَقْسِطُوا ۖ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ",
      "verseStringB": "And if two groups of believers fight each other, reconcile between them. But if one group aggresses against the other, fight the aggressing group until it complies with Allah’s rule. Once it has complied, reconcile between them with justice, and be equitable. Allah loves the equitable."
    },
    {
      "verseNumber": 10,
      "verseString": "إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ ۚ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ",
      "verseStringB": "The believers are brothers, so reconcile between your brothers, and be mindful of Allah, so you may receive mercy."
    },
    {
      "verseNumber": 11,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَسْخَرْ قَوْمٌ مِنْ قَوْمٍ عَسَىٰ أَنْ يَكُونُوا خَيْرًا مِنْهُمْ وَلَا نِسَاءٌ مِنْ نِسَاءٍ عَسَىٰ أَنْ يَكُنَّ خَيْرًا مِنْهُنَّ ۖ وَلَا تَلْمِزُوا أَنْفُسَكُمْ وَلَا تَنَابَزُوا بِالْأَلْقَابِ ۖ بِئْسَ الِاسْمُ الْفُسُوقُ بَعْدَ الْإِيمَانِ ۚ وَمَنْ لَمْ يَتُبْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ",
      "verseStringB": "O you who believe! No people shall ridicule other people, for they may be better than them. Nor shall any women ridicule other women, for they may be better than they. Nor shall you slander one another, nor shall you insult one another with nicknames. Evil is the return to wickedness after having attained faith. Whoever does not repent—these are the wrongdoers."
    },
    {
      "verseNumber": 12,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ ۖ وَلَا تَجَسَّسُوا وَلَا يَغْتَبْ بَعْضُكُمْ بَعْضًا ۚ أَيُحِبُّ أَحَدُكُمْ أَنْ يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا فَكَرِهْتُمُوهُ ۚ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ تَوَّابٌ رَحِيمٌ",
      "verseStringB": "O you who believe! Avoid most suspicion—some suspicion is sinful. And do not spy, nor backbite one another. Would any of you like to eat his dead brother’s flesh? You would hate it. So reverence Allah. Allah is the Acceptor of Repentance, the Mercy-Giver."
    },
    {
      "verseNumber": 13,
      "verseString": "يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُمْ مِنْ ذَكَرٍ وَأُنْثَىٰ وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا ۚ إِنَّ أَكْرَمَكُمْ عِنْدَ اللَّهِ أَتْقَاكُمْ ۚ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ",
      "verseStringB": "O, people! We created you from a male and a female, and We made you races and tribes, so that you may come to know one another. The best among you before Allah is the most righteous. Allah is Knowing and Aware."
    },
    {
      "verseNumber": 14,
      "verseString": "قَالَتِ الْأَعْرَابُ آمَنَّا ۖ قُلْ لَمْ تُؤْمِنُوا وَلَٰكِنْ قُولُوا أَسْلَمْنَا وَلَمَّا يَدْخُلِ الْإِيمَانُ فِي قُلُوبِكُمْ ۖ وَإِنْ تُطِيعُوا اللَّهَ وَرَسُولَهُ لَا يَلِتْكُمْ مِنْ أَعْمَالِكُمْ شَيْئًا ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "verseStringB": "The Nomadic-Arabs say, “We have believed.” Say, “You have not believed; but say, ‘We have submitted,’ for faith has not yet entered your hearts. But if you obey Allah and His Messenger, He will diminish none of your deeds. Allah is Forgiving and Merciful.”"
    },
    {
      "verseNumber": 15,
      "verseString": "إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ ثُمَّ لَمْ يَرْتَابُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ ۚ أُولَٰئِكَ هُمُ الصَّادِقُونَ",
      "verseStringB": "The believers are those who believe in Allah and His Messenger—then do not doubt—and strive with their wealth and their lives in Allah’s way. These are the sincere."
    },
    {
      "verseNumber": 16,
      "verseString": "قُلْ أَتُعَلِّمُونَ اللَّهَ بِدِينِكُمْ وَاللَّهُ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "verseStringB": "Say, “Are you going to teach Allah about your religion, when Allah knows everything in the heavens and on earth, and Allah is Knower of all things?”"
    },
    {
      "verseNumber": 17,
      "verseString": "يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا ۖ قُلْ لَا تَمُنُّوا عَلَيَّ إِسْلَامَكُمْ ۖ بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَاكُمْ لِلْإِيمَانِ إِنْ كُنْتُمْ صَادِقِينَ",
      "verseStringB": "They consider their submission a favor to you. Say, “Do not consider your submission a favor to me. It is Allah who has done you a favor, by guiding you to the faith—if you are truthful.”"
    },
    {
      "verseNumber": 18,
      "verseString": "إِنَّ اللَّهَ يَعْلَمُ غَيْبَ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَاللَّهُ بَصِيرٌ بِمَا تَعْمَلُونَ",
      "verseStringB": "Allah knows the secrets of the heavens and the earth, and Allah sees whatever you do."
    }
  ],
  "nameEnglish": "The Chambers",
  "nameTrans": "al-Hujurat",
  "nameArabic": "الحـجـرات",
  "chapterNumber": 49,
  "nVerses": 18
}