{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "ق ۚ وَالْقُرْآنِ الْمَجِيدِ",
      "verseStringB": "Qaf. By the Glorious Quran."
    },
    {
      "verseNumber": 2,
      "verseString": "بَلْ عَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ فَقَالَ الْكَافِرُونَ هَٰذَا شَيْءٌ عَجِيبٌ",
      "verseStringB": "They marveled that a warner has come to them from among them. The disbelievers say, “This is something strange."
    },
    {
      "verseNumber": 3,
      "verseString": "أَإِذَا مِتْنَا وَكُنَّا تُرَابًا ۖ ذَٰلِكَ رَجْعٌ بَعِيدٌ",
      "verseStringB": "When we have died and become dust? This is a farfetched return.”"
    },
    {
      "verseNumber": 4,
      "verseString": "قَدْ عَلِمْنَا مَا تَنْقُصُ الْأَرْضُ مِنْهُمْ ۖ وَعِنْدَنَا كِتَابٌ حَفِيظٌ",
      "verseStringB": "We know what the earth consumes of them, and with Us is a comprehensive book."
    },
    {
      "verseNumber": 5,
      "verseString": "بَلْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ فَهُمْ فِي أَمْرٍ مَرِيجٍ",
      "verseStringB": "But they denied the truth when it has come to them, so they are in a state of confusion."
    },
    {
      "verseNumber": 6,
      "verseString": "أَفَلَمْ يَنْظُرُوا إِلَى السَّمَاءِ فَوْقَهُمْ كَيْفَ بَنَيْنَاهَا وَزَيَّنَّاهَا وَمَا لَهَا مِنْ فُرُوجٍ",
      "verseStringB": "Have they not observed the sky above them: how We constructed it and decorated it, and it has no cracks?"
    },
    {
      "verseNumber": 7,
      "verseString": "وَالْأَرْضَ مَدَدْنَاهَا وَأَلْقَيْنَا فِيهَا رَوَاسِيَ وَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ بَهِيجٍ",
      "verseStringB": "And the earth, how We spread it out, and We set mountains on it, and We made every beautiful pair grow in it?"
    },
    {
      "verseNumber": 8,
      "verseString": "تَبْصِرَةً وَذِكْرَىٰ لِكُلِّ عَبْدٍ مُنِيبٍ",
      "verseStringB": "An observation and a reminder for every repenting worshiper."
    },
    {
      "verseNumber": 9,
      "verseString": "وَنَزَّلْنَا مِنَ السَّمَاءِ مَاءً مُبَارَكًا فَأَنْبَتْنَا بِهِ جَنَّاتٍ وَحَبَّ الْحَصِيدِ",
      "verseStringB": "And We sent down from the sky blessed water, and We grew with it gardens and grains for harvest."
    },
    {
      "verseNumber": 10,
      "verseString": "وَالنَّخْلَ بَاسِقَاتٍ لَهَا طَلْعٌ نَضِيدٌ",
      "verseStringB": "And the soaring palms, with layered clusters."
    },
    {
      "verseNumber": 11,
      "verseString": "رِزْقًا لِلْعِبَادِ ۖ وَأَحْيَيْنَا بِهِ بَلْدَةً مَيْتًا ۚ كَذَٰلِكَ الْخُرُوجُ",
      "verseStringB": "As sustenance for the servants. And We revive with it a dead land. Likewise is the emergence."
    },
    {
      "verseNumber": 12,
      "verseString": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَأَصْحَابُ الرَّسِّ وَثَمُودُ",
      "verseStringB": "Before them, the people of Noah denied, as did the dwellers of Russ, and Thamood."
    },
    {
      "verseNumber": 13,
      "verseString": "وَعَادٌ وَفِرْعَوْنُ وَإِخْوَانُ لُوطٍ",
      "verseStringB": "And Aad, and Pharaoh, and the brethren of Lot."
    },
    {
      "verseNumber": 14,
      "verseString": "وَأَصْحَابُ الْأَيْكَةِ وَقَوْمُ تُبَّعٍ ۚ كُلٌّ كَذَّبَ الرُّسُلَ فَحَقَّ وَعِيدِ",
      "verseStringB": "And the Woods-Dwellers, and the people of Tubba. They all rejected the messengers, so My threat was justly fulfilled."
    },
    {
      "verseNumber": 15,
      "verseString": "أَفَعَيِينَا بِالْخَلْقِ الْأَوَّلِ ۚ بَلْ هُمْ فِي لَبْسٍ مِنْ خَلْقٍ جَدِيدٍ",
      "verseStringB": "Were We fatigued by the first creation? But they are in doubt about a new creation."
    },
    {
      "verseNumber": 16,
      "verseString": "وَلَقَدْ خَلَقْنَا الْإِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ",
      "verseStringB": "We created the human being, and We know what his soul whispers to him. We are closer to him than his jugular vein."
    },
    {
      "verseNumber": 17,
      "verseString": "إِذْ يَتَلَقَّى الْمُتَلَقِّيَانِ عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ قَعِيدٌ",
      "verseStringB": "As the two receivers receive, seated to the right and to the left."
    },
    {
      "verseNumber": 18,
      "verseString": "مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ",
      "verseStringB": "Not a word does he utter, without an observer beside him ready."
    },
    {
      "verseNumber": 19,
      "verseString": "وَجَاءَتْ سَكْرَةُ الْمَوْتِ بِالْحَقِّ ۖ ذَٰلِكَ مَا كُنْتَ مِنْهُ تَحِيدُ",
      "verseStringB": "And the daze of death has come in truth: “This is what you were trying to evade.”"
    },
    {
      "verseNumber": 20,
      "verseString": "وَنُفِخَ فِي الصُّورِ ۚ ذَٰلِكَ يَوْمُ الْوَعِيدِ",
      "verseStringB": "And the Trumpet is blown: “This is the Promised Day.”"
    },
    {
      "verseNumber": 21,
      "verseString": "وَجَاءَتْ كُلُّ نَفْسٍ مَعَهَا سَائِقٌ وَشَهِيدٌ",
      "verseStringB": "And every soul comes, with it a driver and a witness."
    },
    {
      "verseNumber": 22,
      "verseString": "لَقَدْ كُنْتَ فِي غَفْلَةٍ مِنْ هَٰذَا فَكَشَفْنَا عَنْكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ",
      "verseStringB": "“You were negligent of this, so We lifted your screen from you, and your vision today is sharp.”"
    },
    {
      "verseNumber": 23,
      "verseString": "وَقَالَ قَرِينُهُ هَٰذَا مَا لَدَيَّ عَتِيدٌ",
      "verseStringB": "And His escort will say, “This is what I have ready.”"
    },
    {
      "verseNumber": 24,
      "verseString": "أَلْقِيَا فِي جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيدٍ",
      "verseStringB": "“Throw into Hell every stubborn disbeliever."
    },
    {
      "verseNumber": 25,
      "verseString": "مَنَّاعٍ لِلْخَيْرِ مُعْتَدٍ مُرِيبٍ",
      "verseStringB": "Preventer of good, aggressor, doubter."
    },
    {
      "verseNumber": 26,
      "verseString": "الَّذِي جَعَلَ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَأَلْقِيَاهُ فِي الْعَذَابِ الشَّدِيدِ",
      "verseStringB": "Who fabricated another god with Allah; so toss him into the intense agony.”"
    },
    {
      "verseNumber": 27,
      "verseString": "قَالَ قَرِينُهُ رَبَّنَا مَا أَطْغَيْتُهُ وَلَٰكِنْ كَانَ فِي ضَلَالٍ بَعِيدٍ",
      "verseStringB": "His escort will say, “Our Lord, I did not make him rebel, but he was far astray.”"
    },
    {
      "verseNumber": 28,
      "verseString": "قَالَ لَا تَخْتَصِمُوا لَدَيَّ وَقَدْ قَدَّمْتُ إِلَيْكُمْ بِالْوَعِيدِ",
      "verseStringB": "He will say, “Do not feud in My presence—I have warned you in advance."
    },
    {
      "verseNumber": 29,
      "verseString": "مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ وَمَا أَنَا بِظَلَّامٍ لِلْعَبِيدِ",
      "verseStringB": "The word will not be changed with Me, and I am not unjust to the servants.”"
    },
    {
      "verseNumber": 30,
      "verseString": "يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ امْتَلَأْتِ وَتَقُولُ هَلْ مِنْ مَزِيدٍ",
      "verseStringB": "On the Day when We say to Hell, “Are you full?” And it says, “Are there any more?”"
    },
    {
      "verseNumber": 31,
      "verseString": "وَأُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِينَ غَيْرَ بَعِيدٍ",
      "verseStringB": "And Paradise will be brought near for the righteous—not far away."
    },
    {
      "verseNumber": 32,
      "verseString": "هَٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍ",
      "verseStringB": "“This is what you were promised—for every careful penitent."
    },
    {
      "verseNumber": 33,
      "verseString": "مَنْ خَشِيَ الرَّحْمَٰنَ بِالْغَيْبِ وَجَاءَ بِقَلْبٍ مُنِيبٍ",
      "verseStringB": "Who inwardly feared the Compassionate, and came with a repentant heart."
    },
    {
      "verseNumber": 34,
      "verseString": "ادْخُلُوهَا بِسَلَامٍ ۖ ذَٰلِكَ يَوْمُ الْخُلُودِ",
      "verseStringB": "Enter it in peace. This is the Day of Eternity.”"
    },
    {
      "verseNumber": 35,
      "verseString": "لَهُمْ مَا يَشَاءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌ",
      "verseStringB": "In it, they will have whatever they desire—and with Us is even more."
    },
    {
      "verseNumber": 36,
      "verseString": "وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِنْ قَرْنٍ هُمْ أَشَدُّ مِنْهُمْ بَطْشًا فَنَقَّبُوا فِي الْبِلَادِ هَلْ مِنْ مَحِيصٍ",
      "verseStringB": "How many generations before them did We destroy, who were more powerful than they? They explored the lands—was there any escape?"
    },
    {
      "verseNumber": 37,
      "verseString": "إِنَّ فِي ذَٰلِكَ لَذِكْرَىٰ لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ",
      "verseStringB": "In this is a reminder for whoever possesses a heart, or cares to listen and witness."
    },
    {
      "verseNumber": 38,
      "verseString": "وَلَقَدْ خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ وَمَا مَسَّنَا مِنْ لُغُوبٍ",
      "verseStringB": "We created the heavens and the earth and everything between them in six stages, and no fatigue touched Us."
    },
    {
      "verseNumber": 39,
      "verseString": "فَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ",
      "verseStringB": "So endure what they say, and proclaim the praises of your Lord before the rising of the sun, and before sunset."
    },
    {
      "verseNumber": 40,
      "verseString": "وَمِنَ اللَّيْلِ فَسَبِّحْهُ وَأَدْبَارَ السُّجُودِ",
      "verseStringB": "And glorify Him during the night, and after the prostrations."
    },
    {
      "verseNumber": 41,
      "verseString": "وَاسْتَمِعْ يَوْمَ يُنَادِ الْمُنَادِ مِنْ مَكَانٍ قَرِيبٍ",
      "verseStringB": "And listen for the Day when the Caller calls from a nearby place."
    },
    {
      "verseNumber": 42,
      "verseString": "يَوْمَ يَسْمَعُونَ الصَّيْحَةَ بِالْحَقِّ ۚ ذَٰلِكَ يَوْمُ الْخُرُوجِ",
      "verseStringB": "On the Day when they hear the Shout in Truth. This is the Day of Emergence."
    },
    {
      "verseNumber": 43,
      "verseString": "إِنَّا نَحْنُ نُحْيِي وَنُمِيتُ وَإِلَيْنَا الْمَصِيرُ",
      "verseStringB": "It is We Who give life and cause death. And to Us, is the destination."
    },
    {
      "verseNumber": 44,
      "verseString": "يَوْمَ تَشَقَّقُ الْأَرْضُ عَنْهُمْ سِرَاعًا ۚ ذَٰلِكَ حَشْرٌ عَلَيْنَا يَسِيرٌ",
      "verseStringB": "The Day when the earth breaks open from them quickly. That is an easy gathering for Us."
    },
    {
      "verseNumber": 45,
      "verseString": "نَحْنُ أَعْلَمُ بِمَا يَقُولُونَ ۖ وَمَا أَنْتَ عَلَيْهِمْ بِجَبَّارٍ ۖ فَذَكِّرْ بِالْقُرْآنِ مَنْ يَخَافُ وَعِيدِ",
      "verseStringB": "We are fully aware of what they say, and you are not a dictator over them. So remind with the Quran whoever fears My warning."
    }
  ],
  "nameEnglish": "Qaf",
  "nameTrans": "Qaf",
  "nameArabic": "ق",
  "chapterNumber": 50,
  "nVerses": 45
}