{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "Whatsoever is in the heavens and the earth glorifies Allah. And He is the Mighty, the Wise."
    },
    {
      "verseNumber": 2,
      "verseString": "لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ يُحْيِي وَيُمِيتُ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "To Him belongs the kingdom of the heavens and the earth. He gives life and causes death, and He has Power over everything."
    },
    {
      "verseNumber": 3,
      "verseString": "هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ ۖ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "verseStringB": "He is the First and the Last, and the Outer and the Inner, and He has knowledge of all things."
    },
    {
      "verseNumber": 4,
      "verseString": "هُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ يَعْلَمُ مَا يَلِجُ فِي الْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنْزِلُ مِنَ السَّمَاءِ وَمَا يَعْرُجُ فِيهَا ۖ وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "verseStringB": "It is He who created the heavens and the earth in six stages, then settled on the Throne. He knows what penetrates into the earth, and what comes out of it, and what descends from the sky, and what ascends to it. And He is with you wherever you may be. And Allah sees whatever you do."
    },
    {
      "verseNumber": 5,
      "verseString": "لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ",
      "verseStringB": "To Him belongs sovereignty over the heavens and the earth. And to Allah, all matters are returned."
    },
    {
      "verseNumber": 6,
      "verseString": "يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ ۚ وَهُوَ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "verseStringB": "He merges the night into the day, and He merges the day into the night. And He knows what the hearts contain."
    },
    {
      "verseNumber": 7,
      "verseString": "آمِنُوا بِاللَّهِ وَرَسُولِهِ وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ ۖ فَالَّذِينَ آمَنُوا مِنْكُمْ وَأَنْفَقُوا لَهُمْ أَجْرٌ كَبِيرٌ",
      "verseStringB": "Believe in Allah and His Messenger, and donate from what He has entrusted you with. Those among you who believe and donate will have a great reward."
    },
    {
      "verseNumber": 8,
      "verseString": "وَمَا لَكُمْ لَا تُؤْمِنُونَ بِاللَّهِ ۙ وَالرَّسُولُ يَدْعُوكُمْ لِتُؤْمِنُوا بِرَبِّكُمْ وَقَدْ أَخَذَ مِيثَاقَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ",
      "verseStringB": "And what is the matter with you, that you don’t believe in Allah, while the Messenger is calling you to believe in your Lord, and He received a pledge from you—if you are believers?"
    },
    {
      "verseNumber": 9,
      "verseString": "هُوَ الَّذِي يُنَزِّلُ عَلَىٰ عَبْدِهِ آيَاتٍ بَيِّنَاتٍ لِيُخْرِجَكُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَإِنَّ اللَّهَ بِكُمْ لَرَءُوفٌ رَحِيمٌ",
      "verseStringB": "It is He who sends down clear revelations upon His servant, to bring you out of darkness into light. And Allah is Kind towards you, Most Merciful."
    },
    {
      "verseNumber": 10,
      "verseString": "وَمَا لَكُمْ أَلَّا تُنْفِقُوا فِي سَبِيلِ اللَّهِ وَلِلَّهِ مِيرَاثُ السَّمَاوَاتِ وَالْأَرْضِ ۚ لَا يَسْتَوِي مِنْكُمْ مَنْ أَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقَاتَلَ ۚ أُولَٰئِكَ أَعْظَمُ دَرَجَةً مِنَ الَّذِينَ أَنْفَقُوا مِنْ بَعْدُ وَقَاتَلُوا ۚ وَكُلًّا وَعَدَ اللَّهُ الْحُسْنَىٰ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "verseStringB": "And what is the matter with you, that you do not spend in Allah’s way—when to Allah belongs the inheritance of the heavens and the earth? Not equal among you are those who spent and fought before the conquest. These are higher in rank than those who spent and fought afterward. But Allah has promised each goodness. Allah is Aware of whatever you do."
    },
    {
      "verseNumber": 11,
      "verseString": "مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ وَلَهُ أَجْرٌ كَرِيمٌ",
      "verseStringB": "And who is he who will lend Allah a loan of goodness, so that He multiplies it for him, and there is a generous reward for him?"
    },
    {
      "verseNumber": 12,
      "verseString": "يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ يَسْعَىٰ نُورُهُمْ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ بُشْرَاكُمُ الْيَوْمَ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
      "verseStringB": "On the Day when you see the believing men and believing women—their light shining ahead of them, and to their right: “Good news for you today: gardens beneath which rivers flow, remaining in there forever. This is the ultimate success.”"
    },
    {
      "verseNumber": 13,
      "verseString": "يَوْمَ يَقُولُ الْمُنَافِقُونَ وَالْمُنَافِقَاتُ لِلَّذِينَ آمَنُوا انْظُرُونَا نَقْتَبِسْ مِنْ نُورِكُمْ قِيلَ ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُوا نُورًا فَضُرِبَ بَيْنَهُمْ بِسُورٍ لَهُ بَابٌ بَاطِنُهُ فِيهِ الرَّحْمَةُ وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ",
      "verseStringB": "On the Day when the hypocrite men and the hypocrite women say to those who believed, “Wait for us; let us absorb some of your light.” It will be said, “Go back behind you, and seek a light.” A wall will be raised between them, in which is a door; within it is mercy, and outside it is agony."
    },
    {
      "verseNumber": 14,
      "verseString": "يُنَادُونَهُمْ أَلَمْ نَكُنْ مَعَكُمْ ۖ قَالُوا بَلَىٰ وَلَٰكِنَّكُمْ فَتَنْتُمْ أَنْفُسَكُمْ وَتَرَبَّصْتُمْ وَارْتَبْتُمْ وَغَرَّتْكُمُ الْأَمَانِيُّ حَتَّىٰ جَاءَ أَمْرُ اللَّهِ وَغَرَّكُمْ بِاللَّهِ الْغَرُورُ",
      "verseStringB": "They will call to them, “Were we not with you?” They will say, “Yes, but you cheated your souls, and waited, and doubted, and became deluded by wishful thinking—until the command of Allah arrived—and the Deceiver deceived you about Allah.”"
    },
    {
      "verseNumber": 15,
      "verseString": "فَالْيَوْمَ لَا يُؤْخَذُ مِنْكُمْ فِدْيَةٌ وَلَا مِنَ الَّذِينَ كَفَرُوا ۚ مَأْوَاكُمُ النَّارُ ۖ هِيَ مَوْلَاكُمْ ۖ وَبِئْسَ الْمَصِيرُ",
      "verseStringB": "“So today, no ransom will be accepted from you, nor from those who disbelieved. Your housing is the Fire. It is most worthy of you—what a miserable destination!”"
    },
    {
      "verseNumber": 16,
      "verseString": "أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ وَمَا نَزَلَ مِنَ الْحَقِّ وَلَا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلُ فَطَالَ عَلَيْهِمُ الْأَمَدُ فَقَسَتْ قُلُوبُهُمْ ۖ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ",
      "verseStringB": "Is it not the time for those who believe to surrender their hearts to Allah’s remembrance, and to the truth that has come down, and not be like those who were given the Scripture before, but time became prolonged for them, so their hearts hardened, and many of them are sinful?"
    },
    {
      "verseNumber": 17,
      "verseString": "اعْلَمُوا أَنَّ اللَّهَ يُحْيِي الْأَرْضَ بَعْدَ مَوْتِهَا ۚ قَدْ بَيَّنَّا لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَعْقِلُونَ",
      "verseStringB": "Know that Allah revives the earth after its death. We made the signs clear for you, so you may understand."
    },
    {
      "verseNumber": 18,
      "verseString": "إِنَّ الْمُصَّدِّقِينَ وَالْمُصَّدِّقَاتِ وَأَقْرَضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعَفُ لَهُمْ وَلَهُمْ أَجْرٌ كَرِيمٌ",
      "verseStringB": "Charitable men and charitable women, who have loaned Allah a good loan—it will be multiplied for them, and for them is a generous reward."
    },
    {
      "verseNumber": 19,
      "verseString": "وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ أُولَٰئِكَ هُمُ الصِّدِّيقُونَ ۖ وَالشُّهَدَاءُ عِنْدَ رَبِّهِمْ لَهُمْ أَجْرُهُمْ وَنُورُهُمْ ۖ وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ",
      "verseStringB": "Those who believe in Allah and His messengers—it is they who are the truthful and the witnesses before their Lord. They have their reward and their light. As for those who disbelieve and deny Our revelations—these are the inhabitants of the Blaze."
    },
    {
      "verseNumber": 20,
      "verseString": "اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ ۖ كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَبَاتُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطَامًا ۖ وَفِي الْآخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِنَ اللَّهِ وَرِضْوَانٌ ۚ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ",
      "verseStringB": "Know that the worldly life is but play, and distraction, and glitter, and boasting among you, and rivalry in wealth and children— the likeness of rainfall that produces plants and delights the disbelievers. But then it withers, and you see it yellowing, and then it becomes debris. And in the Hereafter, there is severe agony, and forgiveness from Allah, and acceptance. The life of this world is nothing but the enjoyment of delusion."
    },
    {
      "verseNumber": 21,
      "verseString": "سَابِقُوا إِلَىٰ مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَاءِ وَالْأَرْضِ أُعِدَّتْ لِلَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ ۚ ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
      "verseStringB": "Race to forgiveness from your Lord, and a Garden as vast as the heavens and the earth, prepared for those who believe in Allah and His messengers. That is the grace of Allah, He bestows it on whomever He wills. And Allah has Immense Grace."
    },
    {
      "verseNumber": 22,
      "verseString": "مَا أَصَابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنْفُسِكُمْ إِلَّا فِي كِتَابٍ مِنْ قَبْلِ أَنْ نَبْرَأَهَا ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ",
      "verseStringB": "No calamity occurs on earth, or within yourselves, unless it is in a Book, even before We make it happen. That is easy for Allah."
    },
    {
      "verseNumber": 23,
      "verseString": "لِكَيْلَا تَأْسَوْا عَلَىٰ مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ",
      "verseStringB": "So that you may not sorrow over what eludes you, nor exult in what He has given you. Allah does not love the proud snob."
    },
    {
      "verseNumber": 24,
      "verseString": "الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ ۗ وَمَنْ يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ",
      "verseStringB": "Those who are stingy, and direct people to stinginess. Whoever turns away—Allah is the Independent, the Praiseworthy."
    },
    {
      "verseNumber": 25,
      "verseString": "لَقَدْ أَرْسَلْنَا رُسُلَنَا بِالْبَيِّنَاتِ وَأَنْزَلْنَا مَعَهُمُ الْكِتَابَ وَالْمِيزَانَ لِيَقُومَ النَّاسُ بِالْقِسْطِ ۖ وَأَنْزَلْنَا الْحَدِيدَ فِيهِ بَأْسٌ شَدِيدٌ وَمَنَافِعُ لِلنَّاسِ وَلِيَعْلَمَ اللَّهُ مَنْ يَنْصُرُهُ وَرُسُلَهُ بِالْغَيْبِ ۚ إِنَّ اللَّهَ قَوِيٌّ عَزِيزٌ",
      "verseStringB": "We sent Our messengers with clear proofs, and We sent down with them the Scripture and the Balance, so that people would uphold justice. And We sent down iron: in which is a violent force, and benefits for humanity. So that Allah may know those who will support Him and His messenger in secret. Allah is Strong and Powerful."
    },
    {
      "verseNumber": 26,
      "verseString": "وَلَقَدْ أَرْسَلْنَا نُوحًا وَإِبْرَاهِيمَ وَجَعَلْنَا فِي ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالْكِتَابَ ۖ فَمِنْهُمْ مُهْتَدٍ ۖ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ",
      "verseStringB": "We sent Noah and Abraham, and We established in their line Prophethood and Scripture. Some of them are guided, but many of them are sinners."
    },
    {
      "verseNumber": 27,
      "verseString": "ثُمَّ قَفَّيْنَا عَلَىٰ آثَارِهِمْ بِرُسُلِنَا وَقَفَّيْنَا بِعِيسَى ابْنِ مَرْيَمَ وَآتَيْنَاهُ الْإِنْجِيلَ وَجَعَلْنَا فِي قُلُوبِ الَّذِينَ اتَّبَعُوهُ رَأْفَةً وَرَحْمَةً وَرَهْبَانِيَّةً ابْتَدَعُوهَا مَا كَتَبْنَاهَا عَلَيْهِمْ إِلَّا ابْتِغَاءَ رِضْوَانِ اللَّهِ فَمَا رَعَوْهَا حَقَّ رِعَايَتِهَا ۖ فَآتَيْنَا الَّذِينَ آمَنُوا مِنْهُمْ أَجْرَهُمْ ۖ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ",
      "verseStringB": "Then We sent Our messengers to follow in their footsteps. And We followed up with Jesus son of Mary, and We gave him the Gospel. And We instilled in the hearts of those who followed him compassion and mercy. But as for the monasticism which they invented—We did not mandate it to them—only to seek Allah’s approval. But they did not observe it with its due observance. So We gave those among them who believed their reward, but many of them are sinful."
    },
    {
      "verseNumber": 28,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ وَيَجْعَلْ لَكُمْ نُورًا تَمْشُونَ بِهِ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "verseStringB": "O you who believe! Be conscious of Allah, and believe in His Messenger: He will give you a double portion of His mercy, and He will give you a light, by which you walk, and He will forgive you. Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 29,
      "verseString": "لِئَلَّا يَعْلَمَ أَهْلُ الْكِتَابِ أَلَّا يَقْدِرُونَ عَلَىٰ شَيْءٍ مِنْ فَضْلِ اللَّهِ ۙ وَأَنَّ الْفَضْلَ بِيَدِ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
      "verseStringB": "So that the People of the Scripture may know that they have no control whatsoever over Allah’s grace, and that all grace is in Allah’s hand. He gives it to whomever He wills. And Allah has enormous grace."
    }
  ],
  "nameEnglish": "Iron",
  "nameTrans": "al-Hadid`",
  "nameArabic": "الحـديد",
  "chapterNumber": 57,
  "nVerses": 29
}