{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "Glorifying Allah is all that exists in the heavens and the earth. He is the Powerful, the Wise."
    },
    {
      "verseNumber": 2,
      "verseString": "هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِنْ دِيَارِهِمْ لِأَوَّلِ الْحَشْرِ ۚ مَا ظَنَنْتُمْ أَنْ يَخْرُجُوا ۖ وَظَنُّوا أَنَّهُمْ مَانِعَتُهُمْ حُصُونُهُمْ مِنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا ۖ وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ ۚ يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ",
      "verseStringB": "It is He who evicted those who disbelieved among the People of the Scripture from their homes at the first mobilization. You never thought they would leave, and they thought their strongholds would protect them from Allah. But Allah came at them from where they never expected, and He threw panic into their hearts. They wrecked their homes with their own hands, and by the hands of the believers. So take a lesson, O you who have insight."
    },
    {
      "verseNumber": 3,
      "verseString": "وَلَوْلَا أَنْ كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلَاءَ لَعَذَّبَهُمْ فِي الدُّنْيَا ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابُ النَّارِ",
      "verseStringB": "Had Allah not decreed evacuation for them, He would have punished them in this life. And in the Hereafter, they will have the suffering of the Fire."
    },
    {
      "verseNumber": 4,
      "verseString": "ذَٰلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ ۖ وَمَنْ يُشَاقِّ اللَّهَ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ",
      "verseStringB": "That is because they opposed Allah and His Messenger. Whoever opposes Allah—Allah is severe in retribution."
    },
    {
      "verseNumber": 5,
      "verseString": "مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَىٰ أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ",
      "verseStringB": "Whatever palm-trees you cut down, or left it standing on its roots, it is by Allah’s will. So that He may disgrace the disobedient."
    },
    {
      "verseNumber": 6,
      "verseString": "وَمَا أَفَاءَ اللَّهُ عَلَىٰ رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَٰكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَىٰ مَنْ يَشَاءُ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "As for the gains Allah has turned over to His Messenger from them—you spurred neither horse nor camel for them. But Allah gives authority to His messengers over whomever He wills, and Allah is capable of all things."
    },
    {
      "verseNumber": 7,
      "verseString": "مَا أَفَاءَ اللَّهُ عَلَىٰ رَسُولِهِ مِنْ أَهْلِ الْقُرَىٰ فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ كَيْ لَا يَكُونَ دُولَةً بَيْنَ الْأَغْنِيَاءِ مِنْكُمْ ۚ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا ۚ وَاتَّقُوا اللَّهَ ۖ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ",
      "verseStringB": "As for gains granted by Allah to His Messenger from the villages' inhabitants, they are for Allah and His Messenger, and the relatives, and the orphans, and the poor, and the homeless; so that it may not circulate between the wealthy among you. Whatever the Messenger gives you, accept it. And whatever he forbids you, abstain from it. And be mindful of Allah. Allah is severe in punishment."
    },
    {
      "verseNumber": 8,
      "verseString": "لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَٰئِكَ هُمُ الصَّادِقُونَ",
      "verseStringB": "For the poor refugees who were expelled from their homes and their property, seeking bounty and approval from Allah, and standing up for Allah and His Messenger. These are the truthful."
    },
    {
      "verseNumber": 9,
      "verseString": "وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالْإِيمَانَ مِنْ قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِمَّا أُوتُوا وَيُؤْثِرُونَ عَلَىٰ أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ ۚ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
      "verseStringB": "As for those who had settled in the homeland before them, and had accepted faith—they love those who emigrated to them, and they find no hesitation in their hearts in helping them. They give them preference over themselves, even if they themselves are needy. Whoever is protected from his own selfishness—it is they who are the successful."
    },
    {
      "verseNumber": 10,
      "verseString": "وَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ",
      "verseStringB": "And those who came after them, saying, “Our Lord, forgive us, and our fellow believers who have preceded us in faith, and leave no bitterness in our hearts towards those who believe. Our Lord, You are Clement and Merciful.”"
    },
    {
      "verseNumber": 11,
      "verseString": "أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لِإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِنْ قُوتِلْتُمْ لَنَنْصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ",
      "verseStringB": "Have you not seen those who act hypocritically? They say to their fellow disbelievers among the People of the Scripture, “If you are expelled, we will leave with you, and We will never obey anyone against you. And if you are fought against, we will support you.” But Allah bears witness that they are liars."
    },
    {
      "verseNumber": 12,
      "verseString": "لَئِنْ أُخْرِجُوا لَا يَخْرُجُونَ مَعَهُمْ وَلَئِنْ قُوتِلُوا لَا يَنْصُرُونَهُمْ وَلَئِنْ نَصَرُوهُمْ لَيُوَلُّنَّ الْأَدْبَارَ ثُمَّ لَا يُنْصَرُونَ",
      "verseStringB": "If they are expelled, they will not leave with them. And if they are fought against, they will not support them. And if they go to their aid, they will turn their backs and flee. And they will be left without help."
    },
    {
      "verseNumber": 13,
      "verseString": "لَأَنْتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ مِنَ اللَّهِ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَفْقَهُونَ",
      "verseStringB": "Fear of you is more intense in their hearts than fear of Allah. That is because they are a people who do not understand."
    },
    {
      "verseNumber": 14,
      "verseString": "لَا يُقَاتِلُونَكُمْ جَمِيعًا إِلَّا فِي قُرًى مُحَصَّنَةٍ أَوْ مِنْ وَرَاءِ جُدُرٍ ۚ بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ ۚ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّىٰ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَعْقِلُونَ",
      "verseStringB": "They will not fight you all together, except from fortified strongholds, or from behind walls. Their hostility towards each other is severe. You think they are united, but their hearts are divided. That is because they are a people who do not reason."
    },
    {
      "verseNumber": 15,
      "verseString": "كَمَثَلِ الَّذِينَ مِنْ قَبْلِهِمْ قَرِيبًا ۖ ذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "Like those shortly before them. They tasted the consequences of their decisions. For them is a painful punishment."
    },
    {
      "verseNumber": 16,
      "verseString": "كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنْسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ",
      "verseStringB": "Like Satan, when he says to the human being, “Disbelieve.” But when he has disbelieved, he says, “I am innocent of you; I fear Allah, Lord of the Worlds.”"
    },
    {
      "verseNumber": 17,
      "verseString": "فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا ۚ وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ",
      "verseStringB": "The ultimate end for both is the Fire, where they will dwell forever. That is the penalty of the wrongdoers."
    },
    {
      "verseNumber": 18,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ",
      "verseStringB": "O you who believe! Fear Allah, and let every soul consider what it has forwarded for tomorrow, and be conscious of Allah. Allah is well informed of what you do."
    },
    {
      "verseNumber": 19,
      "verseString": "وَلَا تَكُونُوا كَالَّذِينَ نَسُوا اللَّهَ فَأَنْسَاهُمْ أَنْفُسَهُمْ ۚ أُولَٰئِكَ هُمُ الْفَاسِقُونَ",
      "verseStringB": "And be not like those who forgot Allah, so He made them forget themselves. These are the sinners."
    },
    {
      "verseNumber": 20,
      "verseString": "لَا يَسْتَوِي أَصْحَابُ النَّارِ وَأَصْحَابُ الْجَنَّةِ ۚ أَصْحَابُ الْجَنَّةِ هُمُ الْفَائِزُونَ",
      "verseStringB": "Not equal are the inhabitants of the Fire and the inhabitants of Paradise. It is the inhabitants of Paradise who are the winners."
    },
    {
      "verseNumber": 21,
      "verseString": "لَوْ أَنْزَلْنَا هَٰذَا الْقُرْآنَ عَلَىٰ جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا مِنْ خَشْيَةِ اللَّهِ ۚ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ",
      "verseStringB": "Had We made this Quran descend on a mountain, you would have seen it trembling, crumbling in awe of Allah. These parables We cite for the people, so that they may reflect."
    },
    {
      "verseNumber": 22,
      "verseString": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ",
      "verseStringB": "He is Allah—other than Whom there is no god, Knower of secrets and declarations. He is the Compassionate, the Merciful."
    },
    {
      "verseNumber": 23,
      "verseString": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ",
      "verseStringB": "He is Allah—besides Whom there is no god, the Sovereign, the Holy, the Peace-Giver, the Faith-Giver, the Overseer, the Almighty, the Omnipotent, the Proud. Glorified is Allah, beyond what they associate."
    },
    {
      "verseNumber": 24,
      "verseString": "هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "He is Allah—the Creator, the Inventor, the Designer. His are the Most Beautiful Names. Whatever is in the heavens and the earth praises Him. And He is the Majestic, the Wise."
    }
  ],
  "nameEnglish": "The Mobilization",
  "nameTrans": "al-Hashr",
  "nameArabic": "الـحـشـر",
  "chapterNumber": 59,
  "nVerses": 24
}