{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "Whatsoever is in the heavens and whatsoever is on earth praises Allah. He is the Almighty, the Wise."
    },
    {
      "verseNumber": 2,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ",
      "verseStringB": "O you who believe! Why do you say what you do not do?"
    },
    {
      "verseNumber": 3,
      "verseString": "كَبُرَ مَقْتًا عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ",
      "verseStringB": "It is most hateful to Allah that you say what you do not do."
    },
    {
      "verseNumber": 4,
      "verseString": "إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ",
      "verseStringB": "Allah loves those who fight in His way, in ranks, as if they were a solid structure."
    },
    {
      "verseNumber": 5,
      "verseString": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ لِمَ تُؤْذُونَنِي وَقَدْ تَعْلَمُونَ أَنِّي رَسُولُ اللَّهِ إِلَيْكُمْ ۖ فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ",
      "verseStringB": "When Moses said to his people, “O my people, why do you hurt me, although you know that I am Allah’s Messenger to you?” And when they deviated, Allah deviated their hearts. Allah does not guide the sinful people."
    },
    {
      "verseNumber": 6,
      "verseString": "وَإِذْ قَالَ عِيسَى ابْنُ مَرْيَمَ يَا بَنِي إِسْرَائِيلَ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ مُصَدِّقًا لِمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَمُبَشِّرًا بِرَسُولٍ يَأْتِي مِنْ بَعْدِي اسْمُهُ أَحْمَدُ ۖ فَلَمَّا جَاءَهُمْ بِالْبَيِّنَاتِ قَالُوا هَٰذَا سِحْرٌ مُبِينٌ",
      "verseStringB": "And when Jesus son of Mary said, “O Children of Israel, I am Allah’s Messenger to you, confirming what preceded me of the Torah, and bringing the good news of a Messenger who will come after me, whose name is Ahmad.” But when he brought them the miracles, they said, “This is obvious magic.”"
    },
    {
      "verseNumber": 7,
      "verseString": "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ الْكَذِبَ وَهُوَ يُدْعَىٰ إِلَى الْإِسْلَامِ ۚ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "verseStringB": "And who is more unjust than he who attributes falsehoods to Allah, while he is being called to Submission? Allah does not guide the wrongdoing people."
    },
    {
      "verseNumber": 8,
      "verseString": "يُرِيدُونَ لِيُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ",
      "verseStringB": "They want to extinguish Allah’s Light with their mouths, but Allah will complete His Light, even though the disbelievers hate it."
    },
    {
      "verseNumber": 9,
      "verseString": "هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ",
      "verseStringB": "It is He who sent His Messenger with the guidance and the Religion of Truth, to make it prevail over all religion, even though the associators hate it."
    },
    {
      "verseNumber": 10,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا هَلْ أَدُلُّكُمْ عَلَىٰ تِجَارَةٍ تُنْجِيكُمْ مِنْ عَذَابٍ أَلِيمٍ",
      "verseStringB": "O you who believe! Shall I direct you to a trade that will save you from a painful punishment?"
    },
    {
      "verseNumber": 11,
      "verseString": "تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ ۚ ذَٰلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ",
      "verseStringB": "Believe in Allah and His Messenger, and you strive in Allah’s path with your wealth and yourselves. That is best for you—if you only knew."
    },
    {
      "verseNumber": 12,
      "verseString": "يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ",
      "verseStringB": "He will forgive you your sins, and He will admit you into Gardens under which rivers flow, and into beautiful mansions in the Gardens of Eternity. That is the supreme success."
    },
    {
      "verseNumber": 13,
      "verseString": "وَأُخْرَىٰ تُحِبُّونَهَا ۖ نَصْرٌ مِنَ اللَّهِ وَفَتْحٌ قَرِيبٌ ۗ وَبَشِّرِ الْمُؤْمِنِينَ",
      "verseStringB": "And another thing you love: support from Allah, and imminent victory. So give good news to the believers."
    },
    {
      "verseNumber": 14,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا أَنْصَارَ اللَّهِ كَمَا قَالَ عِيسَى ابْنُ مَرْيَمَ لِلْحَوَارِيِّينَ مَنْ أَنْصَارِي إِلَى اللَّهِ ۖ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنْصَارُ اللَّهِ ۖ فَآمَنَتْ طَائِفَةٌ مِنْ بَنِي إِسْرَائِيلَ وَكَفَرَتْ طَائِفَةٌ ۖ فَأَيَّدْنَا الَّذِينَ آمَنُوا عَلَىٰ عَدُوِّهِمْ فَأَصْبَحُوا ظَاهِرِينَ",
      "verseStringB": "O you who believe! Stand up for Allah, as Jesus son of Mary said to the disciples, “Who will stand up with me for Allah?” The disciples said, “We will stand up for Allah.” Then a faction of the Children of Israel believed, while another faction disbelieved. And We supported those who believed against their enemies, and they became dominant."
    }
  ],
  "nameEnglish": "Column",
  "nameTrans": "as-Saff",
  "nameArabic": "الـصـف",
  "chapterNumber": 61,
  "nVerses": 14
}