{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "verseStringB": "Everything in the heavens and the earth glorifies Allah. His is the Sovereignty, and His is the praise, and He is capable of everything."
    },
    {
      "verseNumber": 2,
      "verseString": "هُوَ الَّذِي خَلَقَكُمْ فَمِنْكُمْ كَافِرٌ وَمِنْكُمْ مُؤْمِنٌ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "verseStringB": "It is He who created you. Among you are unbelievers, and among you are believers. And Allah sees whatever you do."
    },
    {
      "verseNumber": 3,
      "verseString": "خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ ۖ وَإِلَيْهِ الْمَصِيرُ",
      "verseStringB": "He created the heavens and the earth with truth, and He designed you, and He perfected your design, and to Him is the final return."
    },
    {
      "verseNumber": 4,
      "verseString": "يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ ۚ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "verseStringB": "He knows everything in the heavens and on earth, and He knows what you hide and what you disclose. And Allah knows what is within the hearts."
    },
    {
      "verseNumber": 5,
      "verseString": "أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِنْ قَبْلُ فَذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "Have the stories not reached you, of those who disbelieved before? They tasted the ill consequences of their conduct, and they will have a painful punishment."
    },
    {
      "verseNumber": 6,
      "verseString": "ذَٰلِكَ بِأَنَّهُ كَانَتْ تَأْتِيهِمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَقَالُوا أَبَشَرٌ يَهْدُونَنَا فَكَفَرُوا وَتَوَلَّوْا ۚ وَاسْتَغْنَى اللَّهُ ۚ وَاللَّهُ غَنِيٌّ حَمِيدٌ",
      "verseStringB": "That is because their messengers came to them with clear evidence, but they said, “Are humans going to guide us?” So they disbelieved and turned away, but Allah is in no need. Allah is Independent and Praiseworthy."
    },
    {
      "verseNumber": 7,
      "verseString": "زَعَمَ الَّذِينَ كَفَرُوا أَنْ لَنْ يُبْعَثُوا ۚ قُلْ بَلَىٰ وَرَبِّي لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ ۚ وَذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ",
      "verseStringB": "Those who disbelieve claim that they will not be resurrected. Say, “Yes indeed, by my Lord, you will be resurrected, then you will be informed of everything you did. And that is easy for Allah.”"
    },
    {
      "verseNumber": 8,
      "verseString": "فَآمِنُوا بِاللَّهِ وَرَسُولِهِ وَالنُّورِ الَّذِي أَنْزَلْنَا ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "verseStringB": "So believe in Allah and His Messenger, and in the Light that We revealed. And Allah is Aware of everything you do."
    },
    {
      "verseNumber": 9,
      "verseString": "يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ۖ ذَٰلِكَ يَوْمُ التَّغَابُنِ ۗ وَمَنْ يُؤْمِنْ بِاللَّهِ وَيَعْمَلْ صَالِحًا يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ",
      "verseStringB": "On the Day when He gathers you for the Day of Gathering—that is the Day of Mutual Exchange. Whoever believes in Allah and acts with integrity, He will remit his misdeeds, and will admit him into gardens beneath which rivers flow, remaining there forever. That is the supreme achievement."
    },
    {
      "verseNumber": 10,
      "verseString": "وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ النَّارِ خَالِدِينَ فِيهَا ۖ وَبِئْسَ الْمَصِيرُ",
      "verseStringB": "But as for those who disbelieve and denounce Our revelations—these are the inhabitants of the Fire, remaining in it forever. What a miserable destination!"
    },
    {
      "verseNumber": 11,
      "verseString": "مَا أَصَابَ مِنْ مُصِيبَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ وَمَنْ يُؤْمِنْ بِاللَّهِ يَهْدِ قَلْبَهُ ۚ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "verseStringB": "No tragedy happens except with Allah's permission. Whoever believes in Allah, He guides his heart. And Allah has full knowledge of all things."
    },
    {
      "verseNumber": 12,
      "verseString": "وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ ۚ فَإِنْ تَوَلَّيْتُمْ فَإِنَّمَا عَلَىٰ رَسُولِنَا الْبَلَاغُ الْمُبِينُ",
      "verseStringB": "So obey Allah, and obey the Messenger. But if you turn away—Our Messenger’s duty is only to deliver clearly."
    },
    {
      "verseNumber": 13,
      "verseString": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
      "verseStringB": "Allah—there is no god but He. So in Allah, let the believers put their trust."
    },
    {
      "verseNumber": 14,
      "verseString": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلَادِكُمْ عَدُوًّا لَكُمْ فَاحْذَرُوهُمْ ۚ وَإِنْ تَعْفُوا وَتَصْفَحُوا وَتَغْفِرُوا فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "verseStringB": "O you who believe! Among your spouses and your children are enemies to you, so beware of them. But if you pardon, and overlook, and forgive—Allah is Forgiving and Merciful."
    },
    {
      "verseNumber": 15,
      "verseString": "إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ ۚ وَاللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌ",
      "verseStringB": "Your possessions and your children are a test, but with Allah is a splendid reward."
    },
    {
      "verseNumber": 16,
      "verseString": "فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ وَاسْمَعُوا وَأَطِيعُوا وَأَنْفِقُوا خَيْرًا لِأَنْفُسِكُمْ ۗ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
      "verseStringB": "So be conscious of Allah, to the best of your ability, and listen, and obey, and spend in charity—for your own good. Whoever is safeguarded from his selfishness: these are the successful."
    },
    {
      "verseNumber": 17,
      "verseString": "إِنْ تُقْرِضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ شَكُورٌ حَلِيمٌ",
      "verseStringB": "If you lend Allah a good loan, He will multiply it for you, and forgive you. Allah is Appreciative and Forbearing."
    },
    {
      "verseNumber": 18,
      "verseString": "عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْعَزِيزُ الْحَكِيمُ",
      "verseStringB": "The Knower of the Unseen and the Seen—the Almighty, the Wise."
    }
  ],
  "nameEnglish": "Gathering",
  "nameTrans": "at-Taghabun",
  "nameArabic": "الـتغابن",
  "chapterNumber": 64,
  "nVerses": 18
}