{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "إِنَّا أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ أَنْ أَنْذِرْ قَوْمَكَ مِنْ قَبْلِ أَنْ يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ",
      "verseStringB": "We sent Noah to his people: “Warn your people before a painful punishment comes upon them.”"
    },
    {
      "verseNumber": 2,
      "verseString": "قَالَ يَا قَوْمِ إِنِّي لَكُمْ نَذِيرٌ مُبِينٌ",
      "verseStringB": "He said, “O my people, I am a clear warner to you."
    },
    {
      "verseNumber": 3,
      "verseString": "أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ",
      "verseStringB": "Worship Allah, and reverence Him, and obey me."
    },
    {
      "verseNumber": 4,
      "verseString": "يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَىٰ أَجَلٍ مُسَمًّى ۚ إِنَّ أَجَلَ اللَّهِ إِذَا جَاءَ لَا يُؤَخَّرُ ۖ لَوْ كُنْتُمْ تَعْلَمُونَ",
      "verseStringB": "He will forgive you of your sins, and He will delay you until a stated time. Allah’s time cannot be postponed once it has arrived—if you only knew.”"
    },
    {
      "verseNumber": 5,
      "verseString": "قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا",
      "verseStringB": "He said, “My Lord, I have called my people night and day."
    },
    {
      "verseNumber": 6,
      "verseString": "فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا",
      "verseStringB": "But my call added only to their flight."
    },
    {
      "verseNumber": 7,
      "verseString": "وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا",
      "verseStringB": "And whenever I called them to Your forgiveness, they thrust their fingers into their ears, and wrapped themselves with their clothes, and insisted, and became more and more arrogant."
    },
    {
      "verseNumber": 8,
      "verseString": "ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا",
      "verseStringB": "Then I called them openly."
    },
    {
      "verseNumber": 9,
      "verseString": "ثُمَّ إِنِّي أَعْلَنْتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا",
      "verseStringB": "Then I appealed to them publicly, and I spoke to them privately."
    },
    {
      "verseNumber": 10,
      "verseString": "فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا",
      "verseStringB": "I said, ‘Ask your Lord for forgiveness; He is Forgiving."
    },
    {
      "verseNumber": 11,
      "verseString": "يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا",
      "verseStringB": "He will let loose the sky upon you in abundant rain."
    },
    {
      "verseNumber": 12,
      "verseString": "وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَلْ لَكُمْ جَنَّاتٍ وَيَجْعَلْ لَكُمْ أَنْهَارًا",
      "verseStringB": "And will supply you with wealth and children, and will give you gardens, and will give you rivers."
    },
    {
      "verseNumber": 13,
      "verseString": "مَا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا",
      "verseStringB": "What is the matter with you, that you do not hope for Allah with dignity?"
    },
    {
      "verseNumber": 14,
      "verseString": "وَقَدْ خَلَقَكُمْ أَطْوَارًا",
      "verseStringB": "Although He created you in stages."
    },
    {
      "verseNumber": 15,
      "verseString": "أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَاوَاتٍ طِبَاقًا",
      "verseStringB": "Do you not see how Allah created seven heavens in layers?"
    },
    {
      "verseNumber": 16,
      "verseString": "وَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا",
      "verseStringB": "And He placed the moon in their midst for light, and He made the sun a lamp."
    },
    {
      "verseNumber": 17,
      "verseString": "وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا",
      "verseStringB": "And Allah germinated you from the earth like plants."
    },
    {
      "verseNumber": 18,
      "verseString": "ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا",
      "verseStringB": "Then He will return you into it, and He will bring you out again."
    },
    {
      "verseNumber": 19,
      "verseString": "وَاللَّهُ جَعَلَ لَكُمُ الْأَرْضَ بِسَاطًا",
      "verseStringB": "And Allah made the earth a spread for you."
    },
    {
      "verseNumber": 20,
      "verseString": "لِتَسْلُكُوا مِنْهَا سُبُلًا فِجَاجًا",
      "verseStringB": "So that you may travel its diverse roadways.’”"
    },
    {
      "verseNumber": 21,
      "verseString": "قَالَ نُوحٌ رَبِّ إِنَّهُمْ عَصَوْنِي وَاتَّبَعُوا مَنْ لَمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلَّا خَسَارًا",
      "verseStringB": "Noah said, “My Lord, they have defied me, and followed him whose wealth and children increase him only in loss.”"
    },
    {
      "verseNumber": 22,
      "verseString": "وَمَكَرُوا مَكْرًا كُبَّارًا",
      "verseStringB": "And they schemed outrageous schemes."
    },
    {
      "verseNumber": 23,
      "verseString": "وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا",
      "verseStringB": "And they said, “Do not give up your gods; do not give up Wadd, nor Souwa, nor Yaghoos, Yaooq, and Nassr."
    },
    {
      "verseNumber": 24,
      "verseString": "وَقَدْ أَضَلُّوا كَثِيرًا ۖ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ضَلَالًا",
      "verseStringB": "They have misled many, so increase the wrongdoers only in confusion.”"
    },
    {
      "verseNumber": 25,
      "verseString": "مِمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُمْ مِنْ دُونِ اللَّهِ أَنْصَارًا",
      "verseStringB": "Because of their wrongs, they were drowned, then hurled into a Fire, and they found none to help them against Allah."
    },
    {
      "verseNumber": 26,
      "verseString": "وَقَالَ نُوحٌ رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا",
      "verseStringB": "And Noah said, “My Lord, do not leave a single unbeliever on earth."
    },
    {
      "verseNumber": 27,
      "verseString": "إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا",
      "verseStringB": "If You leave them, they will mislead your worshipers, and breed nothing but immoral unbelievers."
    },
    {
      "verseNumber": 28,
      "verseString": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا",
      "verseStringB": "My Lord! Forgive me and my parents, and anyone who enters my home in faith, and the believing men and believing women, and do not increase the wrongdoers except in ruin.”"
    }
  ],
  "nameEnglish": "Noah",
  "nameTrans": "Nuh",
  "nameArabic": "نوح",
  "chapterNumber": 71,
  "nVerses": 28
}