{
  "verses": [
    {
      "verseNumber": 0,
      "verseString": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "verseStringB": "In the name of Allah, the Compassionate, the Merciful."
    },
    {
      "verseNumber": 1,
      "verseString": "يَا أَيُّهَا الْمُزَّمِّلُ",
      "verseStringB": "O you Enwrapped."
    },
    {
      "verseNumber": 2,
      "verseString": "قُمِ اللَّيْلَ إِلَّا قَلِيلًا",
      "verseStringB": "Stand vigil at night, except a little."
    },
    {
      "verseNumber": 3,
      "verseString": "نِصْفَهُ أَوِ انْقُصْ مِنْهُ قَلِيلًا",
      "verseStringB": "Half of it, or reduce it a little."
    },
    {
      "verseNumber": 4,
      "verseString": "أَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْآنَ تَرْتِيلًا",
      "verseStringB": "Or add to it—and recite the Quran slowly and rhythmically."
    },
    {
      "verseNumber": 5,
      "verseString": "إِنَّا سَنُلْقِي عَلَيْكَ قَوْلًا ثَقِيلًا",
      "verseStringB": "We are about to give you a heavy message."
    },
    {
      "verseNumber": 6,
      "verseString": "إِنَّ نَاشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئًا وَأَقْوَمُ قِيلًا",
      "verseStringB": "The vigil of the night is more effective—and more conducive to recitation."
    },
    {
      "verseNumber": 7,
      "verseString": "إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلًا",
      "verseStringB": "In the daytime, you have long work to do."
    },
    {
      "verseNumber": 8,
      "verseString": "وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا",
      "verseStringB": "So remember the Name of your Lord, and devote yourself to Him wholeheartedly."
    },
    {
      "verseNumber": 9,
      "verseString": "رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَا إِلَٰهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا",
      "verseStringB": "Lord of the East and the West. There is no god except He, so take Him as a Trustee."
    },
    {
      "verseNumber": 10,
      "verseString": "وَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاهْجُرْهُمْ هَجْرًا جَمِيلًا",
      "verseStringB": "And patiently endure what they say, and withdraw from them politely."
    },
    {
      "verseNumber": 11,
      "verseString": "وَذَرْنِي وَالْمُكَذِّبِينَ أُولِي النَّعْمَةِ وَمَهِّلْهُمْ قَلِيلًا",
      "verseStringB": "And leave to Me the deniers—those of luxury—and bear with them for a little while."
    },
    {
      "verseNumber": 12,
      "verseString": "إِنَّ لَدَيْنَا أَنْكَالًا وَجَحِيمًا",
      "verseStringB": "With Us are shackles, and a Fierce Fire."
    },
    {
      "verseNumber": 13,
      "verseString": "وَطَعَامًا ذَا غُصَّةٍ وَعَذَابًا أَلِيمًا",
      "verseStringB": "And food that chokes, and painful punishment."
    },
    {
      "verseNumber": 14,
      "verseString": "يَوْمَ تَرْجُفُ الْأَرْضُ وَالْجِبَالُ وَكَانَتِ الْجِبَالُ كَثِيبًا مَهِيلًا",
      "verseStringB": "On the Day when the earth and the mountains tremble, and the mountains become heaps of sand."
    },
    {
      "verseNumber": 15,
      "verseString": "إِنَّا أَرْسَلْنَا إِلَيْكُمْ رَسُولًا شَاهِدًا عَلَيْكُمْ كَمَا أَرْسَلْنَا إِلَىٰ فِرْعَوْنَ رَسُولًا",
      "verseStringB": "We sent to you a messenger, a witness over you, as We sent to Pharaoh a messenger."
    },
    {
      "verseNumber": 16,
      "verseString": "فَعَصَىٰ فِرْعَوْنُ الرَّسُولَ فَأَخَذْنَاهُ أَخْذًا وَبِيلًا",
      "verseStringB": "But Pharaoh disobeyed the Messenger, so We seized him with a crushing seizing."
    },
    {
      "verseNumber": 17,
      "verseString": "فَكَيْفَ تَتَّقُونَ إِنْ كَفَرْتُمْ يَوْمًا يَجْعَلُ الْوِلْدَانَ شِيبًا",
      "verseStringB": "So how will you, if you persist in unbelief, save yourself from a Day which will turn the children gray-haired?"
    },
    {
      "verseNumber": 18,
      "verseString": "السَّمَاءُ مُنْفَطِرٌ بِهِ ۚ كَانَ وَعْدُهُ مَفْعُولًا",
      "verseStringB": "The sky will shatter thereby. His promise is always fulfilled."
    },
    {
      "verseNumber": 19,
      "verseString": "إِنَّ هَٰذِهِ تَذْكِرَةٌ ۖ فَمَنْ شَاءَ اتَّخَذَ إِلَىٰ رَبِّهِ سَبِيلًا",
      "verseStringB": "This is a reminder. So whoever wills, let him take a path to his Lord."
    },
    {
      "verseNumber": 20,
      "verseString": "إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَىٰ مِنْ ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ وَطَائِفَةٌ مِنَ الَّذِينَ مَعَكَ ۚ وَاللَّهُ يُقَدِّرُ اللَّيْلَ وَالنَّهَارَ ۚ عَلِمَ أَنْ لَنْ تُحْصُوهُ فَتَابَ عَلَيْكُمْ ۖ فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآنِ ۚ عَلِمَ أَنْ سَيَكُونُ مِنْكُمْ مَرْضَىٰ ۙ وَآخَرُونَ يَضْرِبُونَ فِي الْأَرْضِ يَبْتَغُونَ مِنْ فَضْلِ اللَّهِ ۙ وَآخَرُونَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ ۖ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ ۚ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا ۚ وَمَا تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا ۚ وَاسْتَغْفِرُوا اللَّهَ ۖ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "verseStringB": "Your Lord knows that you stand vigil nearly two-thirds of the night, or half of it, or third of it, along with a group of those with you. Allah determines the night and the day. He knows that you will be unable to sustain it, so He has relented towards you. So read of the Quran what is easy for you. He knows that some of you may be ill; and others traveling through the land, seeking Allah’s bounty; and others fighting in Allah’s way. So read of it what is easy for you, and perform the prayer, and give the purifying charity, and lend Allah a loan of goodness. Whatever good you advance for yourselves, you will find it with Allah, improved and greater in reward. And ask Allah for forgiveness—Allah is Forgiving and Merciful."
    }
  ],
  "nameEnglish": "The Enwrapped",
  "nameTrans": "al-Muzzammil",
  "nameArabic": "الـمـزمـل",
  "chapterNumber": 73,
  "nVerses": 20
}